from "%globalScripts/logs.nut" import *
//
// Dirty Words tables for Japanese language.
//

return {

badsegments =
{
  ["あ"] =
    [
      "あおかん"
      "あきめくら"
      "あしきり"
      "あめこう"
    ],
  ["い"] =
    [
      "いたこう"
      "いぬごろし"
      "いんばい"
    ],
  ["う"] =
    [
      "うぇのむ"
      "うじよりそだち"
      "うらにほん"
    ],
  ["え"] =
    [
      "えちごのこめつき"
      "えんこう"
      "えんじょこうさい"
    ],
  ["お"] =
    [
      "おきなかし"
      "おなにー"
      "おにしまづ"
      "おまわり"
      "おもてにほん"
      "おわいや"
      "おわい屋"
      "おんぼうや"
      "おんぼう"
      "おーるどみす"
    ],
  ["か"] =
    [
      "かくちょういん"
      "かくちょうだんちょう"
      "かくちょうだん"
      "かこちょう"
      "かさっかき"
      "かつぎや"
      "かつぎ屋"
      "かぶや"
      "かわらこじき"
      "かわらもの"
    ],
  ["が"] =
    [
      "がちゃめ"
      "がちゃ目"
      "がんじゃ"
    ],
  ["き"] =
    [
      "きかれもの"
      "きけいじ"
      "きじるし"
      "きちがいにはもの"
      "きちがい"
      "きんたま"
      "き印"
    ],
  ["ぎ"] =
    [
      "ぎっちょ"
    ],
  ["く"] =
    [
      "くいちんぼう"
      "くいちん棒"
      "くびきり"
      "くまんこ"
      "くろんぼ"
      "くーりー"
    ],
  ["ぐ"] =
    [
      "ぐどん"
      "ぐんもう"
    ],
  ["こ"] =
    [
      "こうもうじん"
      "こっぱやくにん"
      "ころしてやる"
    ],
  ["さ"] =
    [
      "さんかんせいばつ"
      "さんごくじん"
    ],
  ["し"] =
    [
      "しなじん"
      "しのうこうしょう"
      "しゅうせんや"
      "しょくぶつにんげん"
      "しらっこ"
      "しんしんしょうがいしゃ"
      "しんへいみん"
    ],
  ["じ"] =
    [
      "じへいしょうじ"
      "じゃっぷ"
    ],
  ["せ"] =
    [
      "せいしんいじょうしゃ"
      "せいしんいじょう"
      "せいしんはくじゃくじ"
      "せいはくしゃ"
      "せむし"
    ],
  ["そ"] =
    [
      "そだちよりうじ"
    ],
  ["た"] =
    [
      "たけのこいしゃ"
      "たちんぼ"
    ],
  ["だ"] =
    [
      "だいさんごく"
      "だいわんはげ"
      "だっちまん"
    ],
  ["ち"] =
    [
      "ちゅうきょう"
      "ちょうせんじん"
      "ちょうせんせいばつ"
      "ちょんこう"
      "ちょんころ"
      "ちょん公"
      "ちんば"
      "ちんぽ"
    ],
  ["つ"] =
    [
      "つんぼさじき"
      "つんぼ桟敷"
      "つんぼ"
    ],
  ["て"] =
    [
      "ていかいはつこく"
      "てんさいときょうじんはかみひとえ"
    ],
  ["と"] =
    [
      "とうあびょうふ"
      "とくしゅがっきゅう"
      "とくしゅがっこう"
      "とくしゅぶたい"
      "とくしゅぶらく"
      "とさつじょう"
      "とさつにん"
      "とやまのさんすけ"
      "とるこじょう"
      "とるこぶろ"
    ],
  ["ど"] =
    [
      "どさまわり"
      "どさ回り"
      "どもり"
      "どやがい"
      "どん百姓"
    ],
  ["に"] =
    [
      "にがー"
      "にぐろ"
      "にこよん"
      "にんぴにん"
    ],
  ["の"] =
    [
      "のうなし"
      "のうまくえん"
    ],
  ["は"] =
    [
      "はっきょう"
      "はんとうじん"
    ],
  ["ば"] =
    [
      "ばいしゅん"
      "ばかちょんかめら"
      "ばたや"
      "ばーてい"
    ],
  ["ひ"] =
    [
      "ひのもとおにこ"
      "ひんのう"
    ],
  ["ふ"] =
    [
      "ふじのやまい"
      "ふみきりばん"
      "ふろうしゃ"
      "ふろうじ"
    ],
  ["ぶ"] =
    [
      "ぶらくみん"
      "ぶんもう"
    ],
  ["ぽ"] =
    [
      "ぽんびき"
      "ぽん引き"
    ],
  ["ま"] =
    [
      "まんこ"
    ],
  ["み"] =
    [
      "みかいはつこく"
      "みつくち"
    ],
  ["む"] =
    [
      "むすめをかたづける"
    ],
  ["め"] =
    [
      "めかけ"
      "めくらばん"
      "めくら判"
      "めくら滅法"
      "めくら縞"
      "めくら蛇におじず"
    ],
  ["も"] =
    [
      "もうあい"
      "もうじん"
    ],
  ["や"] =
    [
      "やぶにらみ"
    ],
  ["よ"] =
    [
      "よせば"
    ],
  ["ら"] =
    [
      "らいびょう"
      "らくにんぶらく"
    ],
  ["る"] =
    [
      "るんぺん"
    ],
  ["れ"] =
    [
      "れいぷ"
    ],
  ["ろ"] =
    [
      "ろすけ"
      "ろんぱり"
    ],
  ["ア"] =
    [
      "アオカン"
      "アメ公"
    ],
  ["イ"] =
    [
      "イタ公"
      "イヌゴロシ"
      "インバイ"
    ],
  ["ウ"] =
    [
      "ウェノム"
    ],
  ["オ"] =
    [
      "オナニー"
      "オメコ"
      "オールドミス"
    ],
  ["カ"] =
    [
      "カワラコジキ"
      "カワラモノ"
    ],
  ["キ"] =
    [
      "キケイジ"
      "キチガイ"
      "キンタマ"
    ],
  ["ク"] =
    [
      "クロンボ"
      "クーリー"
    ],
  ["コ"] =
    [
      "コロシテヤル"
    ],
  ["シ"] =
    [
      "シナジン"
    ],
  ["ジ"] =
    [
      "ジャップ"
    ],
  ["タ"] =
    [
      "タケノコ医者"
      "タコ部屋"
      "タチンボ"
    ],
  ["ダ"] =
    [
      "ダッチマン"
    ],
  ["チ"] =
    [
      "チャンコロ"
      "チョッパリ"
      "チョンコウ"
      "チョンコロ"
      "チンポ"
    ],
  ["ツ"] =
    [
      "ツンボ"
    ],
  ["ト"] =
    [
      "トルコ嬢"
      "トルコ風呂"
    ],
  ["ド"] =
    [
      "ドキュン"
      "ドヤ街"
    ],
  ["ニ"] =
    [
      "ニガー"
      "ニグロ"
      "ニコヨン"
    ],
  ["バ"] =
    [
      "バカチョンカメラ"
      "バカチョン"
      "バタ屋"
      "バッタ屋"
    ],
  ["ブ"] =
    [
      "ブッシュマン"
    ],
  ["ポ"] =
    [
      "ポコペン"
      "ポリ公"
      "ポンコツ屋"
    ],
  ["マ"] =
    [
      "マンコ"
    ],
  ["ラ"] =
    [
      "ライ病"
    ],
  ["ル"] =
    [
      "ルンペン"
    ],
  ["レ"] =
    [
      "レイプ"
    ],
  ["ロ"] =
    [
      "ロスケ"
      "ロンパリ"
      "ロ助"
    ],
  ["三"] =
    [
      "三国人"
      "三韓征伐"
    ],
  ["上"] =
    [
      "上方のぜい六"
    ],
  ["不"] =
    [
      "不治の病"
    ],
  ["中"] =
    [
      "中共"
    ],
  ["交"] =
    [
      "交姦"
    ],
  ["人"] =
    [
      "人非人"
    ],
  ["伊"] =
    [
      "伊勢こじき"
    ],
  ["低"] =
    [
      "低能"
      "低開発国"
    ],
  ["公"] =
    [
      "公明党"
    ],
  ["創"] =
    [
      "創価学会"
    ],
  ["北"] =
    [
      "北鮮"
    ],
  ["半"] =
    [
      "半島人"
    ],
  ["南"] =
    [
      "南部のシャケの鼻まがり"
      "南鮮"
    ],
  ["台"] =
    [
      "台湾ハゲ"
    ],
  ["同"] =
    [
      "同和地区"
    ],
  ["名"] =
    [
      "名無しさん"
      "名称未設定"
    ],
  ["周"] =
    [
      "周旋屋"
    ],
  ["国"] =
    [
      "国民新党"
    ],
  ["土"] =
    [
      "土人"
    ],
  ["在"] =
    [
      "在日朝鮮人"
      "在日韓国人"
    ],
  ["士"] =
    [
      "士農工商"
    ],
  ["売"] =
    [
      "売春"
    ],
  ["天"] =
    [
      "天才と狂人は紙一重"
    ],
  ["姦"] =
    [
      "姦通"
    ],
  ["娘"] =
    [
      "娘をかたづける"
    ],
  ["寄"] =
    [
      "寄せ場"
      "寄り目"
    ],
  ["富"] =
    [
      "富山の三助"
    ],
  ["小"] =
    [
      "小使い"
      "小日本"
    ],
  ["屠"] =
    [
      "屠役"
      "屠殺人"
      "屠殺場"
      "屠殺"
    ],
  ["幸"] =
    [
      "幸福の科学"
      "幸福実現党"
    ],
  ["廃"] =
    [
      "廃人"
    ],
  ["引"] =
    [
      "引かれ者"
    ],
  ["強"] =
    [
      "強姦"
    ],
  ["後"] =
    [
      "後進国"
    ],
  ["心"] =
    [
      "心身障害者"
    ],
  ["性"] =
    [
      "性芯異常者"
    ],
  ["愚"] =
    [
      "愚鈍"
    ],
  ["慰"] =
    [
      "慰安婦"
    ],
  ["拡"] =
    [
      "拡張員"
      "拡張団長"
      "拡張団"
    ],
  ["援"] =
    [
      "援交"
      "援助交際"
    ],
  ["支"] =
    [
      "支那人"
    ],
  ["文"] =
    [
      "文盲"
    ],
  ["新"] =
    [
      "新党大地"
      "新党改革"
      "新党日本"
      "新平民"
    ],
  ["日"] =
    [
      "日本のチベット"
      "日本共産党"
      "日本鬼子"
    ],
  ["暴"] =
    [
      "暴姦"
    ],
  ["朝"] =
    [
      "朝鮮人"
      "朝鮮征伐"
    ],
  ["木"] =
    [
      "木っ端役人"
    ],
  ["未"] =
    [
      "未開発国"
    ],
  ["東"] =
    [
      "東亜病夫"
      "東夷"
      "東洋鬼"
    ],
  ["株"] =
    [
      "株屋"
    ],
  ["植"] =
    [
      "植物人間"
    ],
  ["毛"] =
    [
      "毛唐"
      "毛等"
    ],
  ["氏"] =
    [
      "氏より育ち"
    ],
  ["民"] =
    [
      "民主党"
    ],
  ["気"] =
    [
      "気違いに刃物"
      "気違い"
    ],
  ["汚"] =
    [
      "汚穢屋"
    ],
  ["沖"] =
    [
      "沖仲仕"
      "沖縄社会大衆党"
    ],
  ["河"] =
    [
      "河原乞食"
    ],
  ["法"] =
    [
      "法輪功"
    ],
  ["浮"] =
    [
      "浮浪児"
      "浮浪者"
    ],
  ["淫"] =
    [
      "淫売"
    ],
  ["特"] =
    [
      "特殊学校"
      "特殊学級"
      "特殊部落"
    ],
  ["犬"] =
    [
      "犬殺し"
    ],
  ["番"] =
    [
      "番太"
    ],
  ["痴"] =
    [
      "痴呆"
    ],
  ["白"] =
    [
      "白痴"
    ],
  ["盲"] =
    [
      "盲人"
      "盲愛"
    ],
  ["知"] =
    [
      "知恵の遅れている子供"
    ],
  ["穢"] =
    [
      "穢多"
    ],
  ["第"] =
    [
      "第三国"
    ],
  ["精"] =
    [
      "精神異常"
      "精神薄弱児"
      "精薄者"
      "精薄"
    ],
  ["紅"] =
    [
      "紅毛人"
    ],
  ["統"] =
    [
      "統一協会"
    ],
  ["群"] =
    [
      "群盲"
    ],
  ["育"] =
    [
      "育ちより氏"
    ],
  ["自"] =
    [
      "自閉症児"
    ],
  ["落"] =
    [
      "落人部落"
    ],
  ["表"] =
    [
      "表日本"
    ],
  ["裏"] =
    [
      "裏日本"
    ],
  ["貧"] =
    [
      "貧農"
    ],
  ["賎"] =
    [
      "賎民"
    ],
  ["赤"] =
    [
      "赤旗"
    ],
  ["越"] =
    [
      "越後の米つき"
    ],
  ["足"] =
    [
      "足切り"
    ],
  ["踏"] =
    [
      "踏切番"
    ],
  ["輪"] =
    [
      "輪姦"
    ],
  ["運"] =
    [
      "運営バカ"
    ],
  ["過"] =
    [
      "過去帳"
    ],
  ["部"] =
    [
      "部落民"
      "部落"
    ],
  ["酒"] =
    [
      "酒鬼薔薇聖斗"
    ],
  ["隠"] =
    [
      "隠亡屋"
    ],
  ["露"] =
    [
      "露助"
    ],
  ["非"] =
    [
      "非人"
    ],
  ["首"] =
    [
      "首切り"
    ],
  ["馬"] =
    [
      "馬丁"
      "馬鹿でもチョンでも"
    ],
  ["鬼"] =
    [
      "鬼石曼子"
    ],
  ["鮮"] =
    [
      "鮮人"
    ],
}

}
