from "%globalScripts/logs.nut" import *




let LANGS_CN = [ "Chinese" ]

return {
  badsegments = [
    {
      list = {
        ["下"] =
          [
            "下体"
          ],
        ["不"] =
          [
            "不要脸"
          ],
        ["中"] =
          [
            "中共"
            "中出"
            "中国共产党"
          ],
        ["习"] =
          [
            "习近平"
          ],
        ["他"] =
          [
            "他妈"
          ],
        ["你"] =
          [
            "你妈"
            "你马"
          ],
        ["倪"] =
          [
            "倪哥"
          ],
        ["做"] =
          [
            "做爱"
          ],
        ["傻"] =
          [
            "傻b"
            "傻逼"
          ],
        ["元"] =
          [
            "元首"
          ],
        ["党"] =
          [
            "党卫军"
          ],
        ["內"] =
          [
            "內設"
          ],
        ["八"] =
          [
            "八紘一宇"
          ],
        ["公"] =
          [
            "公安部"
          ],
        ["内"] =
          [
            "内射"
            "内设"
          ],
        ["净"] =
          [
            "净液"
          ],
        ["刁"] =
          [
            "刁迈乎"
          ],
        ["列"] =
          [
            "列托夫"
          ],
        ["勃"] =
          [
            "勃列日涅夫"
          ],
        ["台"] =
          [
            "台独"
            "台獨"
          ],
        ["后"] =
          [
            "后入"
          ],
        ["吸"] =
          [
            "吸進瓶"
          ],
        ["国"] =
          [
            "国民党"
          ],
        ["大"] =
          [
            "大日本"
            "大鸡鸡"
          ],
        ["天"] =
          [
            "天安门"
          ],
        ["失"] =
          [
            "失禁"
          ],
        ["女"] =
          [
            "女优"
          ],
        ["小"] =
          [
            "小日本"
          ],
        ["尝"] =
          [
            "尝龟"
          ],
        ["尼"] =
          [
            "尼哥"
          ],
        ["屌"] =
          [
            "屌"
          ],
        ["岸"] =
          [
            "岸田"
          ],
        ["希"] =
          [
            "希特勒"
          ],
        ["帝"] =
          [
            "帝国师"
          ],
        ["常"] =
          [
            "常凯申"
          ],
        ["张"] =
          [
            "张春桥"
          ],
        ["径"] =
          [
            "径浓"
          ],
        ["性"] =
          [
            "性奴"
          ],
        ["愺"] =
          [
            "愺"
          ],
        ["戈"] =
          [
            "戈林"
          ],
        ["批"] =
          [
            "批斗"
            "批鬥"
          ],
        ["搞"] =
          [
            "搞怀"
          ],
        ["撸"] =
          [
            "撸着管"
          ],
        ["操"] =
          [
            "操死"
          ],
        ["斐"] =
          [
            "斐济杯"
          ],
        ["斯"] =
          [
            "斯大林"
          ],
        ["日"] =
          [
            "日本帝国"
          ],
        ["普"] =
          [
            "普丁"
            "普京"
          ],
        ["李"] =
          [
            "李洪志"
          ],
        ["林"] =
          [
            "林彪"
          ],
        ["榴"] =
          [
            "榴莲视频"
          ],
        ["死"] =
          [
            "死全家"
          ],
        ["毛"] =
          [
            "毛主席"
            "毛泽东"
          ],
        ["江"] =
          [
            "江青"
          ],
        ["没"] =
          [
            "没亩"
            "没母"
          ],
        ["洗"] =
          [
            "洗头乐"
            "洗特勒"
          ],
        ["流"] =
          [
            "流精"
          ],
        ["淦"] =
          [
            "淦"
          ],
        ["淫"] =
          [
            "淫啪"
            "淫纹"
          ],
        ["混"] =
          [
            "混蛋"
          ],
        ["灌"] =
          [
            "灌"
          ],
        ["爆"] =
          [
            "爆操"
            "爆炒"
          ],
        ["牛"] =
          [
            "牛子"
          ],
        ["特"] =
          [
            "特朗普"
          ],
        ["玉"] =
          [
            "玉足"
          ],
        ["王"] =
          [
            "王宏文"
            "王洪文"
          ],
        ["直"] =
          [
            "直肠"
          ],
        ["篮"] =
          [
            "篮子"
          ],
        ["精"] =
          [
            "精叶"
            "精液"
          ],
        ["紅"] =
          [
            "紅衛兵"
          ],
        ["红"] =
          [
            "红卫兵"
          ],
        ["级"] =
          [
            "级霸"
          ],
        ["纳"] =
          [
            "纳粹"
          ],
        ["绝"] =
          [
            "绝顶"
          ],
        ["网"] =
          [
            "网红文"
          ],
        ["習"] =
          [
            "習維尼"
            "習總書記"
            "習近平"
          ],
        ["老"] =
          [
            "老母"
          ],
        ["肉"] =
          [
            "肉棒"
          ],
        ["脚"] =
          [
            "脚盆"
          ],
        ["蒋"] =
          [
            "蒋中正"
            "蒋介石"
          ],
        ["蔡"] =
          [
            "蔡英文"
          ],
        ["蔣"] =
          [
            "蔣中正"
          ],
        ["足"] =
          [
            "足交"
          ],
        ["近"] =
          [
            "近平"
          ],
        ["邓"] =
          [
            "邓小平"
          ],
        ["金"] =
          [
            "金将军"
            "金正恩"
          ],
        ["阿"] =
          [
            "阿道夫"
          ],
        ["音"] =
          [
            "音蒂"
          ],
        ["飞"] =
          [
            "飞机杯"
          ],
        ["高"] =
          [
            "高潮"
          ],
        ["鬼"] =
          [
            "鬼子"
          ],
        ["鲁"] =
          [
            "鲁关"
          ],
        ["鸡"] =
          [
            "鸡儿"
            "鸡巴"
          ],
        ["麦"] =
          [
            "麦克阿瑟"
          ],
        ["黑"] =
          [
            "黑奴"
          ],
      }
    }
  ]

  forbiddennamesegments = [
    {
      langs = LANGS_CN
      list = {
        ["P"] =
          [
            "PLA"
          ],
        ["中"] =
          [
            "中国人民解放军"
            "中央"
          ],
        ["主"] =
          [
            "主义"
            "主席"
            "主義"
          ],
        ["党"] =
          [
            "党"
          ],
        ["共"] =
          [
            "共和国"
            "共產國際"
          ],
        ["勾"] =
          [
            "勾石"
          ],
        ["北"] =
          [
            "北方工业"
          ],
        ["南"] =
          [
            "南梁"
          ],
        ["哈"] =
          [
            "哈耶克"
          ],
        ["国"] =
          [
            "国防"
          ],
        ["國"] =
          [
            "國軍"
          ],
        ["坏"] =
          [
            "坏掉"
          ],
        ["妈"] =
          [
            "妈"
            "妈妈"
          ],
        ["学"] =
          [
            "学历"
          ],
        ["射"] =
          [
            "射爆"
            "射进"
          ],
        ["床"] =
          [
            "床上"
          ],
        ["张"] =
          [
            "张作霖"
          ],
        ["总"] =
          [
            "总书记"
          ],
        ["恩"] =
          [
            "恩情"
          ],
        ["户"] =
          [
            "户口"
          ],
        ["扑"] =
          [
            "扑街"
          ],
        ["打"] =
          [
            "打我"
          ],
        ["拔"] =
          [
            "拔"
          ],
        ["插"] =
          [
            "插"
          ],
        ["搞"] =
          [
            "搞怀"
          ],
        ["撅"] =
          [
            "撅"
          ],
        ["操"] =
          [
            "操"
          ],
        ["日"] =
          [
            "日台同盟"
          ],
        ["昭"] =
          [
            "昭和天皇"
          ],
        ["朱"] =
          [
            "朱可夫"
          ],
        ["榨"] =
          [
            "榨"
          ],
        ["母"] =
          [
            "母亲"
          ],
        ["父"] =
          [
            "父亲"
          ],
        ["爸"] =
          [
            "爸爸"
          ],
        ["爹"] =
          [
            "爹"
          ],
        ["男"] =
          [
            "男娘"
          ],
        ["盖"] =
          [
            "盖金"
          ],
        ["码"] =
          [
            "码"
          ],
        ["社"] =
          [
            "社会主义"
          ],
        ["第"] =
          [
            "第三帝国"
            "第五帝国"
          ],
        ["统"] =
          [
            "统一"
          ],
        ["舔"] =
          [
            "舔"
          ],
        ["艹"] =
          [
            "艹"
          ],
        ["菜"] =
          [
            "菜逼"
          ],
        ["许"] =
          [
            "许世友"
          ],
        ["超"] =
          [
            "超市"
          ],
        ["蹂"] =
          [
            "蹂躏"
          ],
        ["郭"] =
          [
            "郭台銘"
          ],
        ["隆"] =
          [
            "隆美尔"
          ],
        ["韩"] =
          [
            "韩红"
          ],
        ["马"] =
          [
            "马踏东京"
          ],
        ["魏"] =
          [
            "魏特曼"
          ],
      }
    }
  ]

  badphrases =
  [
    "nmsl"
    "rnm"
  ]

  forbiddennames = [
    { value = "b(vv|yy|w)d", langs = LANGS_CN }
  ]
}
