from "%globalScripts/logs.nut" import *
//
// Dirty Words tables for Chinese language.
//

let REGIONS_CN = [ "CN" ]

return {
  badsegments = [
    {
      list = {
        ["他"] =
          [
            "他妈"
          ],
        ["八"] =
          [
            "八紘一宇"
          ],
        ["后"] =
          [
            "后入"
          ],
        ["天"] =
          [
            "天安门"
          ],
        ["希"] =
          [
            "希特勒"
          ],
        ["戈"] =
          [
            "戈林"
          ],
        ["榴"] =
          [
            "榴莲视频"
          ],
        ["洗"] =
          [
            "洗头乐"
            "洗特勒"
          ],
        ["男"] =
          [
            "男娘"
          ],
        ["脚"] =
          [
            "脚盆"
          ],
        ["若"] =
          [
            "若紫"
          ],
        ["隆"] =
          [
            "隆美尔"
          ],
        ["鬼"] =
          [
            "鬼子"
          ],
      }
    }
  ]

  forbiddennamesegments = [
    {
      regions = REGIONS_CN // This list is only for China region!!!
      list = {
        ["中"] =
          [
            "中共"
            "中华民国"
            "中央"
            "中華民國"
          ],
        ["主"] =
          [
            "主义"
            "主席"
            "主義"
          ],
        ["乌"] =
          [
            "乌克兰"
          ],
        ["习"] =
          [
            "习近平"
          ],
        ["人"] =
          [
            "人民"
          ],
        ["俄"] =
          [
            "俄罗斯人民联盟军"
          ],
        ["元"] =
          [
            "元首"
          ],
        ["党"] =
          [
            "党"
          ],
        ["全"] =
          [
            "全斗焕"
          ],
        ["公"] =
          [
            "公安部"
          ],
        ["共"] =
          [
            "共和国"
          ],
        ["列"] =
          [
            "列托夫"
          ],
        ["北"] =
          [
            "北方工业"
          ],
        ["台"] =
          [
            "台湾"
            "台灣"
            "台独"
          ],
        ["哈"] =
          [
            "哈耶克"
          ],
        ["国"] =
          [
            "国防"
          ],
        ["大"] =
          [
            "大日本"
          ],
        ["小"] =
          [
            "小日本"
          ],
        ["巴"] =
          [
            "巴穆特赫"
          ],
        ["常"] =
          [
            "常凯申"
          ],
        ["张"] =
          [
            "张作霖"
            "张泰玩"
          ],
        ["总"] =
          [
            "总书记"
          ],
        ["斯"] =
          [
            "斯大林"
          ],
        ["日"] =
          [
            "日本帝国"
            "日本鬼子"
          ],
        ["昭"] =
          [
            "昭和天皇"
          ],
        ["朱"] =
          [
            "朱可夫"
          ],
        ["李"] =
          [
            "李洪志"
          ],
        ["毛"] =
          [
            "毛泽东"
          ],
        ["江"] =
          [
            "江青"
          ],
        ["王"] =
          [
            "王洪文"
          ],
        ["社"] =
          [
            "社会主义"
          ],
        ["第"] =
          [
            "第三帝国"
            "第五帝国"
          ],
        ["统"] =
          [
            "统一"
          ],
        ["蒋"] =
          [
            "蒋中正"
            "蒋介石"
          ],
        ["蔡"] =
          [
            "蔡英文"
          ],
        ["解"] =
          [
            "解放军"
          ],
        ["许"] =
          [
            "许世友"
          ],
        ["邓"] =
          [
            "邓小平"
          ],
        ["郭"] =
          [
            "郭台銘"
          ],
        ["阿"] =
          [
            "阿道夫"
          ],
        ["马"] =
          [
            "马踏东京"
          ],
        ["魏"] =
          [
            "魏特曼"
          ],
      }
    }
  ]

  badphrases = [
    { value = "\\bpla\\b", regions = REGIONS_CN }
  ]

  badcombination = [
    "希 特 勒"
  ]
}
