//
// Dirty Words tables for Russian language.
//

return {

excludesdata =
[
  {
    key = "а",
    arr =
    [
      "автомоб",
      "амеб",
      "амудар",
      "ансамбл",
      "ансибл",
      "архиманд",
      "атрибут",
      "атак",
      "аспид",
      "ахнет",
      "ахнул",
      "ахтуб"
    ]
  },
  {
    key = "б",
    arr =
    [
      @"(бал[#]?)",
      "бебел",
      "бедр",
      "белибер",
      "бермуд",
      "блюхер",
      "блямб",
      @"бляпан[н]?",
      "бляронс",
      @"блях[аеиу]?\$",
      @"бляхо([^мпс])",
      @"бляха[йю]",
      "бляше",
      "бляшк",
      "богохул",
      "боскреб",
      "бронеб",
      @"(бу[#]?)(бу[#]?)+",
      "быстро"
    ]
  },
  {
    key = "в",
    arr =
    [
      "веб",
      "вебер",
      @"веб.?об",
      "вебсер",
      "вебстер",
      "верх",
      "вдребез",
      "вздох",
      "влюбля",
      "волшеб",
      "востреб",
      "враждеб",
      "врачеб",
      "вроде",
      @"все.?\$",
      @"все[#]?т[ао]",
      "встрепан",
      "всуху",
      "втиху",
      "выгреб",
      "вытрях",
      "выхлеб"
    ]
  },
  {
    key = "г",
    arr =
    [
      "гербарий",
      "гибел",
      @"гидро[кт]",
      @"где.+нибу",
      "глеб",
      "гомеоп",
      "голов",
      "горох",
      "граб",
      @"гре[#]?б[еклноушя]",
      "гриб"
    ]
  },
  {
    key ="д",
    arr =
    [
      "две",
      "дебаркад",
      @"деб[еи]л",
      "дебет",
      "дебош",
      @"деба[г|ж]",
      "дезокси",
      "дерябну",
      "дирижаб",
      @"дох[л|н]",
      "дребед",
      "дротик",
      "дрыхн",
      "дубля"
    ]
  },
  {
    key = "е",
    arr =
    [
      "евпатори",
      "еле-еле",
      @"епан[н]?ч",
      "епарх"
    ]
  },
  {
    key = "ж",
    arr =
    [
      "жебы",
      @"ж[е|и]реб",
      "жили?",
      "жулеб"
    ]
  },
  {
    key = "з",
    arr =
    [
      "завихрен",
      "загиб",
      "заглубля",
      @"загреб[ану]?",
      "задолбил",
      "за[дс]ох",
      "заколеб",
      "закрепл",
      @"залупил\$",
      "залупит",
      "замах",
      "зашиб",
      @"зеб[ру]",
      "злоупотребля",
      "зяб"
    ]
  },
  {
    key = "и",
    arr =
    [
      "избал",
      "изгиб",
      "икебан",
      "имбеци",
      "иметь",
      "инкассат",
      @"(ипат\$)|(ипат((и)|(у)|(о)))",
      "испан",
      "испар",
      "истреб",
      "исчерп",
      @"их[#]?\$"
    ]
  },
  {
    key = "к",
    arr =
    [
      "кабел",
      @"как..-т[ао]",
      @"как..-[лн]и[бк]",
      @"кан[н]?[еи]бал",
      "кипуч",
      "клебанов",
      "клеп",
      "кобел",
      @"ков((ре)|(ер))",
      "колеб",
      "коктебе",
      "констеб",
      "корабля",
      "кракозяб",
      "крик",
      @"куй\$",
      "купидон",
      "кухн"
    ]
  },
  {
    key = "л",
    arr =
    [
      "ламборд",
      "лапидар",
      "либер",
      "липидо",
      "липуч",
      "лихую"
    ]
  },
  {
    key = "м",
    arr =
    [
      "м-да",
      "мандари",
      "мандат([^в])",
      @"^мандел((а)|(ой))\$",
      "мандоли",
      @"м[ао]хер",
      "мебел",
      "муданьцзян",
      "мудехары",
      "мыши"
    ]
  },
  {
    key = "н",
    arr =
    [
      "нагибать",
      "ногебать",
      "нагебать",
      "ногибать",
      "нагреб",
      "наибол",
      "наибыс",
      "наколеб",
      "напереб",
      "нахмурил",
      "наябед",
      "неблаг",
      "небы",
      "неплох",
      @"нет\$",
      @"нибу[дт]",
      "новосиб",
      "норманд",
      "нотебук",
      "ноябр"
    ]
  },
  {
    key = "о",
    arr =
    [
      @"обд[и|е]р",
      @"обляпа[лн]",
      "обсох",
      "обтяг",
      "оглобл",
      "одномандат",
      "озлобля",
      "октябр",
      "опозд",
      "оскорбл",
      "ослабл",
      "отдохн",
      "отребье",
      "отсебя",
      "отскреб",
      "отхлеб",
      "отчебуч",
      @"охи[#]?((вз)|(ах))",
      "охудеп",
      "ошиб"
    ]
  },
  {
    key = "п",
    arr =
    [
      "парикмахер",
      "пасиб",
      "пассат",
      @"пахн[еу]",
      "пахуч",
      "педагог",
      "педал",
      "педант",
      "педераст",
      "педолог",
      "педофил",
      @"педро\$",
      @"переб[еиор]",
      "перебло",
      "перемудр",
      "перепал",
      "пидопригор",
      "пистол",
      "пищеблок",
      "пихнул",
      "плебисц",
      "плебс",
      @"плох[ио]",
      @"плят(!(ь))",
      @"по[#]?бабь",
      @"п[р]?одебош",
      @"поб[ае]р",
      "побыст",
      "погиб",
      "погреб",
      "подгреб",
      "подсобля",
      "подох",
      "поколеб",
      "поперх",
      "попух",
      @"потре[бп]",
      "похи[тщ]",
      "похлеб",
      @"поху[дж]",
      "пошле",
      "пребел",
      @"пр[еи]б[аы]в",
      "пребол",
      "препин",
      "прибаут",
      "прибе",
      @"приб[иы][лт]",
      @"прибли[жз]",
      @"прибо[ейря]",
      "прибра",
      "припизднюват",
      "приспособля",
      "прозяб",
      "протреп",
      "протух",
      "прошиб",
      "прохуд",
      "пятибал"
    ]
  },
  {
    key = "р",
    arr =
    [
      "равнобедр",
      "разгиб",
      "разгреб",
      "раздроблят",
      @"рас[с]?лабля",
      "растреп",
      "расхлеб",
      "расшиб",
      @"ребе\$",
      "ребен",
      "ребер",
      "ребло",
      "ребр",
      @"ребу[ст]",
      "ребя",
      "ренессанс",
      "репин",
      "рибосом",
      "розет",
      @"ру[#]?бля",
      "рябина"
    ]
  },
  {
    key = "с",
    arr =
    [
      @"(сабля\$)|(сабля(!(к)))|(сабл[ие])",
      "салат",
      "сбербан",
      "свадеб",
      "свирепст",
      "сгреб",
      "себ",
      "сентябр",
      "сердце",
      "серебр",
      "сиб",
      "скипидар",
      "скобля",
      "скопид",
      "скреб",
      "скрипуч",
      "смахи",
      "служеб",
      @"(спид[а]?\$)|(спидо)",
      "соскобля",
      "спасиб",
      "ссутул",
      "стеб",
      @"стебл[ея]",
      "степа",
      "стибрит",
      "стриптизбар",
      "судеб",
      "сукачев",
      "сшиб"
    ]
  },
  {
    key = "т",
    arr =
    [
      "талмуд",
      @"твоя[#]?\$",
      "телепат",
      "тереб",
      "тибер",
      "типун",
      "торпед",
      @"треба\$",
      "треб((у)|(ов))",
      "трепа((нг)|([лт]))",
      "трибун"
    ]
  },
  {
    key = "у",
    arr =
    [
      "убил",
      "углуб",
      @"^уед",
      @"^уеха",
      "уже",
      "уподоб",
      "упорхн",
      "употреб",
      "усугуб",
      @"ух[ао]йд[ао]к",
      "учеб"
    ]
  },
  {
    key = "ф",
    arr =
    [
      "фламанд",
      "фон"
    ]
  },
  {
    key = "э",
    arr =
    [
      "эберт",
      @"эби.?нур",
      "эбнер",
      "эбонит",
      "экебан",
      "эпистал",
      "эреб"
    ]
  },
  {
    key = "х",
    arr =
    [
      "хайдфил",
      "херберт",
      "херес",
      "херомант",
      "херсон",
      "херувим",
      "хлеб",
      @"хли[вф]кие",
      "хмур",
      "хотябы",
      @"хреб[ет]",
      "хреновый",
      "хубер",
      "худо",
      @"худе[лт]",
      "худющ",
      "худяк",
      "хуже",
      "хуизху",
      "хулиган",
      @"хули[ло]",
      "хулит([^о])",
      "хунвеэбин"
    ]
  },
  {
    key = "ц",
    arr =
    [
      "целебн",
      "церебрал"
    ]
  },
  {
    key = "ч",
    arr =
    [
      "чебок",
      "чебур"
    ]
  },
  {
    key = "ш",
    arr =
    [
      "шебурш",
      "шиб",
      "шле",
      "штуч",
      "швальб",
      "шумахер"
    ]
  },
  {
    key = "щ",
    arr =
    [
      "щебе[нт]",
      "щедрот",
      "щелбан"
    ]
  },
  {
    key = "ю",
    arr =
    [
      "ютитс"
    ]
  },
  {
    key = "я",
    arr =
    [
      "ябло[кнч]",
      "ястреб"
    ]
  }
]


excludescore =
[
  { key = "боле",   value = "боле" },
  { key = "гре#1",  value = @"^.{0,3}гре[#]?б\$" },
  { key = "гре#2",  value = "^.{0,3}гре[#]?б[аеклноушя]" },
  { key = "страх",  value = @"(стра[#]?ху([^еи]))|(^((за)|(пере)|(под))стра[#]?хуя\$)|(^((за)|(пере)|(под))стра[#]?хуй((те(с.)?)|(ся))?\$)|(^((за)|(пере)|(под))стра[#]?хуем(ся)?\$)" },
  { key = "команд", value = "команд" },
  { key = "леопард", value = "леопард" },
  { key = "мандат", value = "мандат([^в])" },
  { key = "неб",    value = "неб[еиоу]" },
  { key = "пасиб",  value = "пасиб" },
  { key = "псих",   value = "психу" },
  { key = "хлеб",   value = "^.{0,3}хлеб" },
  { key = "хули",   value = "хулиган([^х])" },
  { key = "шлеп",   value = "шлеп" },
  { key = "штрих",  value = "штри[#]?ху" }
]


foulcore =
[
  { key = "бзд",    value = "бзд" },
  { key = "бля",    value = @"(б[\#+еи]?л[у\#+]?я)|(б[\#+]я)|(блиад)|(бл[еи]д[иу])|([кю]ляд)|([бп][и]?л[ая][дт]ь$)|(билат.?$)|(блдс)" },
  { key = "гондон", value = "г[ао]+нд[ао]+[ен]" },
  { key = "долб",   value = "(д[ао]лб[ао]дя)|(д[ао]л[бп][ао]манд)|(д[ао](д[ао])?лб[ао]л[еия]х)|(((д[ао])|(об))д[ао]лб[ао]н)" },
  { key = "дроч",   value = "(др[ою]+[ктч])|(драчис)" },
  { key = "еб#1",   value = @"(^е[\#+]?[бп][а]*\$)|([\#+еиэ][\#+б][аеиу]+[лнктрщчм])|(е.?[\#+бп][аы][лнрт])|([еи][\#+б]авш)|(еб[ст]ел)|(^ебят)" },
  { key = "еб#2",   value = @"(ебну)|([еи][\#+б][ыу]р)|(((орж)|(от)|(по)|(под)|(при)|(про)|(раз)|(рас)|(у))[\#+ъь]?[\#+ие]б)|(е[\#+б][лносуц])|(е.?[\#+бп][аы]мат)" },
  { key = "еб#3",   value = @"(в.?[ея]б+)|(.а[\#+ъь]?[\#+еия][\#+б])|([\#+еия][\#+б]в)|(п[ао]д[\#+ьъ][\#+е]б)|(^ебя\$)|(27[\\d]*.?.?ба)" },
  { key = "еб#4",   value = @"(йо[б])|(епин)|(епст)|([\#+еи][\#+п]у[нч])|(((твою)|(тебя))еб)|(ибиом)|(^ебт.\$)|(вы[ея]вы)|((вы)?йаб)" },
  { key = "жоп",    value = @"(ж[\#+ео]+п)" },
  { key = "залуп",  value = "за+лу+п" },
  { key = "муда",   value = @"(м[\#+\у]+д[аеиоюыянл\#])|(.удозв)|(мудвин)|(мудчи)|(м[\#+у]драк)|(\#удак)" },
  { key = "манда",  value = "(м[аоу]нд[аеоя])|(манд[иуыю])|(мндо)|(мандр[еию])" },
  { key = "лядс",   value = "лядс" },
  { key = "падл",   value = "(па+дл[аоыю])|(пипид)" },
  { key = "перд",   value = @"([^су]перн((у)|(ет)))|(выпер[дж])|(пердан)|(^перд\$)|(перд[ея][жлнт])|(перд[ия][млтщ])|(пердн[еу])|(перд((ли)|(ол)|(у)))|(перд[ью])|(пердо\$)|([^су]п[еи]рну)" },
  { key = "пидар",  value = @"([бп][\#еиы]+д[аеио]?р)|(п[еия]д[ао]г)|(педик)|(пидеатр)|([гф][еи]д[ео]рас)|(пудура)|(п[еи]т[ае]рас)" },
  { key = "пизд#1", value = @"(п[ийы]*[с]?[жзс][дж])|(п[еия][зс]?[ьъ]?д[ао])|(пист[ае])|(пи[тд]за)|(пизта)|(п[\#+]?[еи][\#+]?[зс][\#+]?д)|(кизд)|(капец)|(звезди)|(физд[еи])" },
  { key = "пизд#2", value = @"(п[\\w]?[сз]д[ао][бт])|(пивд)|(пиз((ад)|(оп)))|(пита\$)|(бл[ею]зд)|(ф[л]?[ею]зд)|(пиз[еу][днц])|(приздроп)|(з14[\\d]*.?.?[з]?д[аеы])|(п[еи]рзд)" },
  { key = "сран",   value = @"(сран[н]?[адекоыь])|(сра[лч]ь?)|(срать)|(срет.?(ся)?\$)|(^сри\$)|(^сру\$)|(срун)|(срут)|(^срю\$)|(((об)|(под))сер[еи]в)|(сраст)|(сраты)" },
  { key = "сать",   value = @"(^сс?ать)|(ссат)|(^ссу\$)|(ссут)|(^ссы\$)|(^сс?ыку)|(^ссыте?\$)|(^ссыш)|(ссан)|(((обо)|(пере)|(недо))сс?а[лт])" },
  { key = "хуй#1",  value = @"(х.?у+[^дя]?[еийыюя])|(х[\#]+)\$|(^[мх][\-у\#+][\-у\#+]?[еийыюя])|(х[у\#+][у\#+]?л[еиья])|(^а[\#+]?ху\$)|(ахай)" },
  { key = "хуй#2",  value = @"(^а[\#+]?ху\$)|(ахай)|(х[о]й[дл])|(куй)|(м[\#+у]йня)|(х[\#+]+н[еюя])|(х[\#+][еюя])|(^[\#+]+у[еийыюя])" },
  { key = "член",   value = "члено((вид)|(воз)|(вре)|(гл)|(мет)|(ног)|(прием)|(сос)|(под))" },
  { key = "япуч",   value = "яп[п]?уч" }
]


fouldata =
[
  {
    key = "а",
    arr =
    [
      "^абанамат",
      "^анахну",
      "^архипиздрит",
      @"^аст[ао]еб",
      @"^аст[ао]п[еи]зд",
      @"^аст[ао]хер",
      "^атасас",
      @"^ат[\#+ъь]?[ея]б"
    ]
  },
  {
    key = "б",
    arr =
    [
      "^бабоеб",
      "^басран",
      "^баться",
      "^бзд",
      "^бзжу",
      @"^блев[ао]",
      "^блюдов",
      "^блюзд",
      @"^б[еи]л[еи]ат",
      "^блежник",
      "^блья",
    ]
  },
  {
    key = "в",
    arr =
    [
      @"^вафлезл[ао]",
      "^великодрюч",
      "^взбзд",
      @"^вз[\#+ъь]еб",
      @"^висл[ао]хеу",
      @"^влагопр[о]?еб",
      @"^влагопр[ао]",
      "^восьмипроеб",
      @"^вп[еи]рдол",
      "^впендюр",
      @"^врот.?[еи\#+][\#+б]",
      "^вротзапил",
      "^вротскреб",
      "^выдрюч",
      @"^выбл[еию]",
      "^выйобыв",
      "^выеть",
      "^выешкив",
      @"^вып[еи]здр",
      @"^выпенд[ю]?р",
      "^выподв",
      "^высерусь",
      "^высира",
      "^высра",
      "^высса",
      "^выссу"
    ]
  },
  {
    key = "г",
    arr =
    [
      @"^г[ао][вм]н",
      "^гвоздедроч",
      "^гноильн",
      "^говен",
      "^говешка",
      "^гомик",
      "^гомино",
      @"^гомосек[\\w]{0,2}\$",
      "^гонолуп",
      "^гребзд",
      @"^греб[ао]н",
    ]
  },
  {
    key = "д",
    arr =
    [
      "^данунах",
      "^двужоп",
      "^дермо",
      "^дерьм",
      @"^д[еи]бил",
      @"^д[еи]б[еи]дозуб",
      "^длиннохер",
      @"^д[ао]лбое",
      @"^д[ао]пи[зж]",
      "^дрисн",
      "^дрисс",
      "^дрист",
      "^дрищ",
      "^дрочена",
      "^дрочан",
      @"^дрочи[лтш]",
      @"^дроч[ук]",
      "^дрочк",
      "^д[ао][ея]б",
      "^домохнот",
      @"^д[ао]лб[ао]дя",
      @"^д[ао]л[бп][ао]манд",
      @"^д[ао](д[ао])?лб[ао]л[еия]х",
      @"^д[ао]д[ао]лб[ао]н",
      @"^додр[ою]ч",
      @"^дыдл"
   ]
  },
  {
    key = "е",
    arr =
    [
      @"^е[\#+][\#+]?т",
       "^ебашка",
      @"^е[бп]аши",
      @"^е[бп]е[нмтц]",
      @"^е[бп]т[ивы]",
      @"^еби([^з])",
      @"^е[бп]ки",
      @"^е[бп]твою",
      @"^е[бп][с]?тит",
      "^едрит",
      "^ездец",
      "^елб",
      "^елд",
      @"^еп[е]?рн",
      @"^епрст\$",
      @"^ептать\$",
      @"^епт[аю]\$",
      @"^(?<!(им))еть",
      @"^ехнут"
    ]
  },
  {
    key = "ж",
    arr =
    [
      "^жмуд",
    ]
  },
  {
    key = "з",
    arr =
    [
      "^заблева",
      "^заговнять",
      "^задристать",
      "^задышк",
      "^заелдон",
      @"^заеп[п]?ен",
      "^заеть",
      "^зажоп",
      @"^з[ао]луп",
      @"^заман((ал)|(дюк))",
      "^замуда",
      "^замудоха",
      "^занафуяч",
      @"^заныка[лт]",
      @"^зап[еи]ж",
      @"^зап[еи]ндюр",
      @"^зап[еи]рдун",
      "^запипи",
      "^записьк",
      "^заподл",
      "^запроеб",
      "^засер",
      "^засир",
      @"^засобачи[лт]",
      "^застебан",
      "^засса",
      @"^зас[с]?ыха\$",
      "^заторчал",
      @"^зав[ао]фл",
      "^защекан",
      "^захера",
      @"^зв[еи]здобол",
      @"^зв[еи]здун",
      "^здец",
      "^звизд",
      @"^зл[ао][бп][ао]е[бп]",
      @"^зл[ао][яе]б",
      @"^злоп[ао]х",
    ]
  },
  {
    key = "и",
    arr =
    [
        @"^и.?[бп]а[лнрт]",
        @"^и.?[бп]аши",
        @"^и.?[бп]е[нмтц]",
        "^изговн",
        "^издец",
        "^ипа[ц]+а",
        @"^итит([\#+ъь]?)|(!(с))",
        @"^их[еи]бут"
    ]
  },
  {
    key = "й",
    arr =
    [
      "^йобан",
    ]
  },
  {
    key = "к",
    arr =
    [
      "^кабзд",
      "^калоед",
      "^квазиуеб",
      @"^кизди[тш]",
      "^кляпыжит",
      @"^к[ао]бзд",
      @"^к[ао]зл[ао]еб",
      @"^к[ао]лд[ао]еб",
      @"^к[ао]лдыр",
      @"^к[ао]н[ао]еб",
      "^кебени",
      @"^к[еи]рд[еы][кц]",
      "^кисец",
      "^коз.бл",
      "^косозалуп",
      @"^коца[нт]",
      @"^кр[ао]к[ао]еб",
      @"^красн[ао]жоп",
      "^крендец",
      "^куякнул"
    ]
  },
  {
    key = "л",
    arr =
    [
      "^лжеб",
      "^лихолох",
      @"^л[уо]рк[ао]еб",
      "^лярв"
    ]
  },
  {
    key = "м",
    arr =
    [
      @"^ма[вз][аео].?фак",
      @"^м[ао]л[ао]ф",
      @"^манд[\#+а]\$",
      @"^м[ао]нд[ао][в]",
      "^мандакрыл",
      @"^мандар[ао]еб",
      @"^м[ао]нде[йрт]",
      @"^манди[лтщ]?([^р])",
      "^мдак",
      "^междужоп",
      @"^мндр[оу]",
      @"^м[ао]ндатня",
      @"^манд[уыю]",
      "^матоеб",
      "^матозад",
      @"^мин[\#+ъь]?ет",
      "^мобсел",
      "^мозгоеб",
      "^мозгопроеб",
      @"^мокрощ[еи]лк",
      @"^моноп[еи]н[еи]с",
      @"^мохно((нед)|(муд))",
      @"^м[ао]шонк[ао][ао]?б",
      "^мундел",
      "^муячеч"
    ]
  },
  {
    key = "н",
    arr =
    [
      @"^набзде[лт]",
      "^наговня",
      @"^надр[иы]с",
      @"^надр[ою]ч",
      "^надрямс",
      "^назалуп",
      "^намандаш",
      "^напизд",
      "^насал",
      "^насса",
      "^насца",
      @"^нах\$",
      @"^нах[пу]",
      "^нахеза",
      "^нахер",
      @"^нахуа\$",
      @"^на[\#+ц]уй",
      @"^нед[ао][ея]б",
      @"^нед[ао]пи[зж]",
      @"^неуе[\#+б]+",
      "^нечленосос"
    ]
  },
  {
    key = "о",
    arr =
    [
      "^обдриста",
      @"^обл[еи]м[ао]нд",
      @"^обл[еи]муд",
      "^обосца",
      "^обсир",
      "^обспускан",
      "^обуевш",
      "^огрохув",
      "^окуел",
      @"^опр[ао]муд",
      @"^опрст\$",
      @"^ост[ао]хер",
      "^отдрюч",
      "^отмудоха",
      "^отпиз",
      @"^отсоси\$",
      "^отчермуто",
      "^отъеть",
      "^офоршмачи",
      @"^офуен[н]?",
      @"^ох[еу]жоп",
      "^охумев",
      "^охулк",
      @"^ох[еу]ндрот",
      @"^ох[еу]р",
      "^ошмудок"
    ]
  },
  {
    key = "п",
    arr =
    [
      @"^педри[лк]",
      "^пендюр",
      @"^пере[е]?б[алд]",
      @"^пере[е]?б[ал]",
      "^передрен",
      "^перевзб",
      @"^пер[е]?колд",
      "^перекосоеб",
      "^перемат",
      "^перемуд",
      "^перепизну",
      "^пересуч",
      "^перетит",
      "^перехер",
      "^пердлов",
      "^пернет",
      @"^перну[влт]",
      @"^п[еи][сз]ж",
      "^пиндос",
      @"^пипе[т]?ц",
      @"^пи[пс]ис",
      @"^писк.\$",
      @"^пист(([\#+ъью])|([^о]))",
      @"^питишка\$",
      @"^плеха\$",
      @"^плыва\$",
      @"^п[ао]бл[еи]ден",
      @"^п[ао]бл[ия]душ",
      "^подвзб",
      "^подговн",
      "^подзабор",
      @"^подзл[ао]еб",
      "^подлоеб",
      @"^подре[й]?туз",
      @"^подроч[иу]",
      @"^под[\#+ъь]еб",
      @"^подстр[ао]хер",
      "^поеть",
      "^полуеб",
      "^полужоп",
      "^попоеб",
      @"^поср[ае]т",
      "^посру",
      @"^посс[ауы]",
      "^похер",
      "^похух",
      @"^пох[\#+ъь]е",
      @"^поц[ау]?\$",
      "^поцоват",
      "^припизд",
      @"^произ[\#+ъь]?еб",
      @"^пр[ао]х[ао]еб",
      @"^пр[еи]здун",
      @"^пр[еиу]м[ао]нд[ао]",
      "^прилабун",
      "^прозалуп",
      @"^пром[ао]нд",
      "^промуд",
      @"^пр[ао]п[еиу]рд((ы)|([ао]м[ао]нд[ао]))",
      @"^пр[ао]с[с]?уч",
      @"^пр[ао]шм[ао]нд",
      @"^пр[ао]х.блу",
      "^приебо",
      "^пропизд",
      "^пучезад"
    ]
  },
  {
    key = "р",
    arr =
    [
      @"^р[ао][зс][\#+ъь]?е[бпт]",
      @"^рах[\#+ъь]?ед",
      @"^ра[зс]долба[еий]",
      @"^ра[зс]долбое",
      @"^ра[зс]дрю",
      @"^ра[зс]простоеб",
      @"^ра[зс]пидз",
      @"^ра[зс]проеб",
      @"^ра[зс]проет",
      @"^ра[зс]пронаедр",
      @"^ра[зс][с]?теб",
      @"^ра[зс]тр[еи]кв",
      @"^ра[зс]тыка",
      @"^ра[зс]членх",
      @"^р[ау][зс]туд[иы]т",
      @"^расп[ао]хаб",
      "^распроторазд"
    ]
  },
  {
    key = "с",
    arr =
    [
      "^сака",
      "^самоеб",
      "^сахер",
      @"^свином[ао]нд",
      "^сговня",
      "^секел",
      "^семироеб",
      "^серепер",
      "^серун",
      "^серька",
      @"^сест[\\w]?[ао]еб",
      "^сика",
      "^сикат",
      "^сикел",
      "^сипов",
      "^сирать",
      "^сирывать",
      @"^ском[м]?унизд",
      "^скурви",
      "^скурех",
      "^скурея",
      "^скуряг",
      "^скуряж",
      "^сосомол",
      @"^состать\$",
      @"^спермот[ао]в[ао]з",
      "^спиж",
      "^спизд",
      @"^срак\$",
      @"^срак[ауо]",
      "^сруль",
      "^ссака",
      "^ссаки",
      @"^ссан[н]?о",
      @"^струк\$",
      @"^[с]?сук((а)|(ин))",
      @"^[с]?суче((х)|(нок)|(чк))",
      @"^[с]?суч[к]?ар",
      @"^[с]?суч((ий)|(ка))",
      "^суперзаеб",
      "^сухобзд",
      "^суходроч",
      "^сцавинье",
      @"^сц[аиы]к[аиу]",
      "^сцание",
      "^сцать",
      "^сциха",
      "^сцуль",
      "^сцыха",
      @"^с[\#+ъь]еб",
      "^сыкун"
    ]
  },
  {
    key = "т",
    arr =
    [
      "^тарачлен",
      "^твоюмат",
      @"^трандец\$",
      "^триквант",
      @"^трим[ао]н[ао]?д",
      "^троедром",
      "^троедруч",
      "^тринитроеб",
      @"^трипиз[ао][бп]лд",
      "^трипробзд",
      @"^трих[ао]м[ао]н[ао]?д",
      "^троедолбо",
      @"^трындоп[еи]нд",
      "^туебен"
    ]
  },
  {
    key = "у",
    arr =
    [
      "^ублюд",
      @"^угреб[и]",
      "^угробищ",
      "^уеть",
      @"^ум[аоу]дох",
      "^упизд",
      @"^усса[лт]",
      "^уссыш",
      "^усцаться"
    ]
  },
  {
    key = "ф",
    arr =
    [
      "^факин",
      "^факну",
      "^факуд",
      "^факошит",
      "^фидераст",
      "^фопа",
      @"^фуй\$",
      "^фуцк"
    ]
  },
  {
    key = "х",
    arr =
    [
      "^хезать",
      "^хер",
      "^хера",
      "^хере",
      @"^херн[еияю]",
      @"^х[еи]ров",
      "^хером",
      "^хитрожоп",
      "^хитрозад",
      "^хлабал",
      "^хлюха",
      "^хуканут",
      "^хурл",
      "^хуров"
    ]
  },
  {
    key = "ч",
    arr =
    [
      "^черебзд",
      @"^чернож[ео]п",
      "^чикс.",
      @"^чмо\$",
      @"^чмыр[еья]",
      "^членяр"
    ]
  },
  {
    key = "ш",
    arr =
    [
      "^шваль",
      "^швинд",
      @"^шизд[ао]х",
    ]
  },
  {
    key = "э",
    arr =
    [
      @"^э[бп]а[лнрт]",
      @"^э[бп]аши",
      @"^э[бп]е[нмтц]",
      @"^эб[илносуц]",
    ]
  },
  {
    key = "ю",
    arr =
    [
      "^юхан"
    ]
  },
  {
    key = "я",
    arr =
    [
      @"^я.?[бп]а[лнрт]",
      @"^я.?[бп]аши",
      @"^я.?[бп]е[нмтц]",
      @"^яб[илносуц]",
      @"^я[бп]тв",
      "^япу",
      @"^ялд[аоу]"
    ]
  }
]


badphrases =
[
  @"анепош[е]?л[и]?бы[вт]ы",
  "еханыйбабай",
  "идинахуй",
  @"редк..педальност",
  "сучийпотрох",
  @"тык[ао]зел",
  @"отс[ао]сатьу",
  @"отс[ао]сичлен",
]

badcombination =
[
]

}
