return [
{t="h1" v="Огненный дождь"}
"Почти 30 новых машин, в том числе реактивные истребители Jaguar, новые версии популярного P-47 Thunderbolt, два новых топа T-72 и многое другое!"
{t="sep"}
{t="h2" v="Бронетехника"}
"7 машин, включая новые модификации танка Т-72."
"СССР"
{t="bullets" v=[
  "Т-72Б 1989"
  "Т-72Б3"
]}
"Франция"
{t="bullets" v=[
  "Char SOMUA SM (в составе набора)"
]}
"Германия"
{t="bullets" v=[
  "TAM 2C"
]}
"Япония"
{t="bullets" v=[
  "Chi-Ha Long Gun"
]}
"Китай"
{t="bullets" v=[
  "CM 25"
]}
"Швеция"
{t="bullets" v=[
  "Strv 104"
]}
{t="sep"}
{t="h2" v="Авиация"}
"14 новых или обновлённых моделей техники."
"США"
{t="bullets" v=[
  "P-47D-22"
  "YP-38 (в составе набора). Самолет будет доступен в составе набора в магазине 'Тихоокеанская кампания США'. XP-38G для приобретения более доступен не будет и останется только у его текущих обладателей."
  "P-51C-10"
]}
"СССР"
{t="bullets" v=[
  "Су-6 одноместный (премиум)"
  "Су-7 БКЛ"
]}
"Британия"
{t="bullets" v=[
  "Jaguar GR.1"
  "Thunderbolt Mk.1 (премиумный)"
]}
"Германия"
{t="bullets" v=[
  "Ил-28"
]}
"Япония"
{t="bullets" v=[
  "B-6N2 (кабина)"
]}
"Франция"
{t="bullets" v=[
  "Jaguar A"
  "P-40F-5 Lafayette  (премиум)"
]}
"Италия"
{t="bullets" v=[
  "Bf-110G-4 (премиум)"
]}
"Китай"
{t="bullets" v=[
  "Q-5 Early"
]}
"Швеция"
{t="bullets" v=[
  "B17BS"
]}
{t="sep"}
{t="h2" v="Флот"}
"Сразу 8 новых кораблей."
"США"
{t="bullets" v=[
  "USS Northampton (CA-26)"
]}
"СССР"
{t="bullets" v=[
  "СКР Пр.50 «Енот»"
]}
"Италия"
{t="bullets" v=[
  "MAS 561"
  "Zara"
  "Comandanti Medaglie d'Oro"
]}
"Япония"
{t="bullets" v=[
  "Chidori"
  "Akebono (премиумный)"
]}
"Британия"
{t="bullets" v=[
  "HMS Peacock"
]}
{t="sep"}
{t="h2" v="Новые локация и миссии"}
{t="bullets" v=[
  "Набор корабельных миссий для локации «Алеутские острова»."
  "Новая авиационная карта «зимний Моздок»."
  "Новые авиационные исторические миссии:"
  "Моздок. Зима 1943."
  "Москва. 42 километр."
  "Москва. Наро-Фоминск."
  "Москва. Серпухов."
]}
{t="sep"}
{t="h2" v="Изменения в локациях и миссиях"}
{t="bullets" v=[
  "Внесены правки в авиационную локацию «Москва» — добавлены отсутствовавшие в южной части карты реки."
  "Карта авиационной локации «Москва» была переделана с целью повышения удобочитаемости. Теперь на ней меньше названий населенных пунктов, но зато все они должны читаться нормально."
]}
"Изменения в исторических авиационных миссиях"
{t="bullets" v=[
  "«Ладога» — миссия переделана, также внесены изменения из общего списка (см. ниже)."
  "«Халкин-Гол» — изменения из общего списка."
  "«Корсунь» — изменения из общего списка."
  "«Крымск» — миссия переделана, также внесены изменения из общего списка."
  "«Курск» — изменения из общего списка."
  "«Моздок» — миссия переделана, также внесены изменения из общего списка."
  "«Нормандия» — миссия переделана, также внесены изменения из общего списка."
]}
"Общий список изменений"
{t="bullets" v=[
  "Модели баз для бомбардировки заменены на актуальные, а их функционал теперь соответствует таковому в миссиях «Противостояния». Базы после их уничтожения будут появляться снова в случайных местах из перечня заранее определённых для каждой из миссий позиций."
  "Из списка целей для бомбометания убраны аэродромы, теперь их нельзя уничтожить."
  "Модели аэродромов и их расстояние до центра карты стандартизированы. На низких рангах аэродромы располагаются в 12 км от центра карты, на средних — в 20 км, на высоких — в 26 км. До этого все ранги начинали бой на аэродромах, удалённых от центра карты на 20 км."
  "Размер аэродрома теперь зависит от ранга боёв."
  "На средних рангах появился аэродром подскока, расположенный на расстоянии 12 км от центра карты."
]}
"«Противостояние»"
{t="bullets" v=[
  "В морском Противостоянии «Ла-Манш» добавлен 4-й порт за каждую из сторон. Общее количество портов в миссии теперь равно 8."
  "Теперь при захвате портов больше не учитываются находящиеся в воздухе самолёты."
  "Новое морское Противостояние на локации «Дания»: 4 порта за каждую сторону, размер поля боя 86x86 км."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v=[
  "Для следующих машин Германии добавлены зенитные пулемёты: Pz.III M, Pz.III N, Pz.IV H, Pz.Bef.Wg.IV J, Panther A, Panther G, Tiger II (P), Tiger II (H), Tiger II (10.5cm Kw.K)."
  "Pz.Bef.Wg.IV J, Brummbär — добавлена модификация ходовой части Ostketten."
  "Для следующих машин добавлена модификация ходовой части Winterketten: Pz.III E, Pz.III F, Pz.III J, Pz.III J1, Pz.III L, Pz.III M — со снятием экранов на корпусе, Pz.III N — со снятием экранов на корпусе."
  "Для следующих машин добавлена модификация СПО/LWS (предупреждение о лазерном облучении): Ariete, Ariete PSO, Type 89, Centauro, Centauro ROMOR, Centauro MGS, Merkava Mk.2b late, TAM 2C, CV 90120, Type 16, Type 74G, Type 87, Type 90, Type 90(B)."
  "Актуализированы и уточнены значения стойкости брони к попаданию кумулятивных и бронебойных снарядов для следующих машин: Т-64А, Т-72А, Т-64Б, Т-80Б, Т-72Б, Т-80У."
  "T92 — внесены уточнения в размещение модулей боекомплекта. Возимый боекомплект снижен с 60 до 59 выстрелов. Источник: R.P. Hunnicutt, (2015) Sheridan: A History of the American Light Tank, Volume 2."
  "Begleitpanzer 57 — переделана механика заряжания (по аналогии с Strf 9040C). Число членов экипажа уменьшено с пяти до трёх человек. Источник: Thyssen-Henschel and Bofors brochure."
  "ZBD86 — уточнена модель техники. Модификация БМП-1П заменена на модификацию с ПТУР HJ-73E. Стартовый ПТУР заменён на ПТУР HJ-73."
  "VK4501 P, Pz.Bef.Wg.VI P — бронирование маски и башни переведено в объёмную броню."
  "M60A1, M60A1 RISE — бронирование орудийной маски переведено в объёмную броню."
  "ИС-2 (1944), ИС-2 (1944) Китай — бронирование орудийной маски, ВЛД и НЛД переведено в объёмную броню."
  "OTOMATIC — для башни добавлен функционал «разрушения корпуса»."
  "Исправлены ошибки в отображении времени ремонта наземной техники в окне экипажа."
  "Максимальная скорость движения, при которой работает вертикальный стабилизатор, увеличена с 15 до 24 км/ч для нижеперечисленной техники: M4A4 (Китай), M4A4 (1st PTG), M4A1, M4, M4A2, M4A1 (76) W, M4A2 (76) W, M4A3 (76) W, M4A3E2, M4A3E2 (76) W, Cobra King, Calliope, M4A2 (СССР), Sherman II, M4A3 (76) W (Япония), M4A1 (Франция), M4A4 (Франция), M4A3E2 (Франция), M4 Hybrid (Италия), M4A4 (Италия), M4 748 (a) (Германия), M24, M24 (TL), M6A1, T25, T20, T14, M24 (Япония). Источник: AD 65653 Tank Fire Control Systems Study, Philip I. Brown, Frankford Arsenal, 1955 // Ohio State Engineer, vol. 28, no. 4, March 1945 // KG-9-3, PROJECT REPORT, Gyrostabilizer, 90mm Gun, in Tanks, Sep 24 1945."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v=[
  "На американские военно-морские самолёты добавлены авиационные морские мины Mk 13 Mod 0.: PV-2D, SB2U-2, SB2U-3, PBY-5, PBY-5a, BTD-1, PBM-3, SB2C-4, SB2C-1c, SBD-3."
]}
{t="emphasis" v="Изменения в лётных моделях"}
{t="bullets" v=[
  "FW 190 (вся линейка) — включена автоматическая перестановка стабилизатора в посадочное положение для облегчения достижения трёхточечного положения. Уточнены углы выпуска закрылков, а также их поляра во всех положениях, эффективность боевых закрылков повышена. Выпуск шасси вызывает небольшое изменение балансировки с облегчением хвоста. Значительно увеличен пробег без применения тормозов, увеличена эффективность тормозов, как следствие, возможно опрокидывание (капотирование) при посадке на передние шасси и зажиме тормозов. Улучшено управление самолётом на всех типах управления. Время работы на форсажных режимах ограничено паспортными значениями."
  "F-104 (вся линейка) — убрано боевое положение закрылков согласно РЛЭ."
  "VB.10C-1, VB.10-02 — уточнены Лётная модель и модель двигателя, увеличена мощность на режиме 100% (взлётном), нагнетатель переделан в 1-скоростной с впускным направляющим аппаратом (мощность на 100% и WEP теперь постоянна до высоты ~6000 м), улучшены посадочные характеристики."
  "A-4B — исправлена ошибка, приводящая к заниженной угловой скорости крена. Скорость крена установлена согласно РЛЭ и ограничена 270 градусами в секунду."
  "He-100D / J1N1 / G4M1 / He-112 (вся линейка) / BF-110 (вся линейка) — обновлена Летная модель. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолёта при выпуске механизации и шасси."
  "F4U-1 (вся линейка) — исправлена ошибка, периодически приводящая к резкому изменению оборотов двигателя на завышенных значениях."
  "Ta-152H1 — переставной стабилизатор автоматически устанавливается в посадочное положение при выпуске закрылок в посадочное положение для облегчения достижения трёхточечного положения. Уточнены углы выпуска закрылок а так же их поляра во всех положениях. Выпуск шасси вызывает небольшое изменение балансировки с облегчением хвоста. Значительно увеличен пробег без применения тормозов, увеличена эффективность тормозов, как следствие возможно опрокидывание при посадке не достигшей трёхточечного положения и зажиме тормозов. Все тяги к управляющим поверхностям заменены на трубчатое управление, что делает управление более точным на любых режимах полёта. Значительно улучшена работа винтомоторной группы на больших высотах (режимы работы системы GM-1). Уменьшен нагрев двигателя на небольших скоростях полёта, из за непосредственного обдува системы охлаждения потоком."
  "И-225 — значительно улучшено управление по тангажу на больших скоростях. Выпуск шасси вызывает небольшое изменение балансировки с облегчением хвоста. Значительно увеличен пробег без применения тормозов, увеличена эффективность тормозов, как следствие возможно опрокидывание при посадке не достигшей трёхточечного положения и зажиме тормозов. Уменьше время инвертированного полёта."
  "Система обнаружения лазерного воздействия добавлена следующим вертолётам: EC-665 Tiger HAP, EC-665 , Tiger HAD, EC-665 Tiger UHT, Ка-52, Ка-50, Ми-28Н, AH-1Z, AH-64D, AH Mk.1"
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения флота"}
"Вооружение"
"В Морские бои добавлен новый вид вооружения — морские мины. На первом этапе его получили следующие корабли:"
"СССР"
{t="bullets" v=[
  "БМО"
  "ПР.191"
  "ПР.191М"
  "Пр.1204"
  "Пр.1204 Поздний"
]}
"Германия"
{t="bullets" v=[
  "R-boot R-130"
  "R-boot R-301"
  "S-100 (1944)"
  "S-100 (1945)"
  "S-100 Lang"
]}
"Британия"
{t="bullets" v=[
  "Fairmile A (ML100)"
  "Fairmile B (ML345)"
  "SGB (S304)"
  "SGB (S309)"
]}
"Япония"
{t="bullets" v=[
  "IJN Mutsuki"
  "IJN Kuma"
]}
"Италия"
{t="bullets" v=[
  "Turbine"
  "Attilio Regolo"
  "Для их использования нужно исследовать и установить модификацию «Мины», после чего выбрать их в «Дополнительном оружии» в окне модификаций."
  "Отключена возможность вести огонь по воздушным целям ИИ-стрелкам на неуниверсальных неавтоматических артиллерийских установках и на установках без зенитных снарядов."
  "283-мм Spgr. L/4.4 Kz ОФ снаряду (Admiral Graf Spee) исправлен фугасный урон."
  "Albatros-Klasse (143) — боекомплект 76-мм орудия OTO-Melara Compact приведён в соответствие с итальянской установкой."
  "IJN Ayanami — добавлены запасные торпеды."
  "203-мм ОФ-ДВ Contro-aerea (Trento) — исправлены вес, наполнение и начальная скорость снаряда."
  "Исправлены названия итальянских торпед:"
  "450-мм торпеда Si 200 исправлена на W.200/450X5,75."
  "450-мм торпеда SI 170 исправлена на S.I.170/450X5,25."
  "USS Cleveland — исправлены скорости наведения башен главного калибра."
  "Admiral Hipper — исправлены предельные углы горизонтального наведения торпедных аппаратов."
  "Raimondo Montecuccoli — 20-мм/70 автоматические пушки Oerlikon Mk.2 заменены на Oerlikon 3S."
  "Добавлена модификация режима хода торпед для следующих итальянских кораблей: MAS 555, MAS 569, Folgore P-490, MS-473, VAS 201, Vosper 70' GIS 811"
  "MS-15 — торпеда S.I.270 заменена на S.I. 270/533X6.84 Tipo L"
  "Stefano Turr — в ленте 6,5-мм пулемёта бронебойный патрон заменён на патрон общего назначения."
  "MAS 569 — в ленту 6,5-мм пулемёта добавлен трассирующий патрон."
  "203-мм снаряд Mk.25 HC (USS Portland (CA-33)) — тип взрывателя исправлен с донного на головной мгновенного действия."
  "76-мм/62 автоматическое орудие OTO-Melara Compact — количество выстрелов до перегрева увеличено примерно до 60-65."
  "Пушка 100-мм/56 Б-34 — добавлен ОФ снаряд."
  "114-мм орудие 8cwt QF Mk I (Класс Dark (FPB 1101)) — ОФ снаряд заменён на ОФ с донным взрывателем."
  "47-мм пушка Гочкисса (Fairmile A (ML100), Fairmile B (ML345)) — тип и количество ВВ в ОФ снаряде исправлены на 120 г лиддита."
  "Тип 1934А (1940) — исправлены предельные углы наведения второй и третьей башен ГК."
  "S-100 (1944), S-100 (1945), S-100 (S204) — добавлены запасные торпеды."
  "IJN Kiyoshimo — исправлено наведение зенитного орудия на кормовой турели главного калибра."
  "Hunt (L79) — улучшены углы горизонтального наведения второй турели главного калибра. Убрано лишнее задирание стволов вверх при переходе стволов с одного траверза на другой через нос."
  "MAS 555, MAS 569 — улучшены углы наведения у 20-мм автоматических пушек Breda."
]}
"Модификации и навыки экипажа:"
{t="bullets" v=[
  "Исправлена ошибка определения расстояния в большую сторону при установленной модификации улучшенного дальномера."
  "Stefano Turr — удалена лишняя модификация приводов вспомогательной артиллерии. Опыт и деньги за её изучение возвращены на аккаунты игроков."
]}
"ТТХ, физика и модель повреждений флота"
{t="bullets" v=[
  "Изменены скорость отклонения руля и максимальный угол отклонения:"
  "Лёгкие, небольшие катера стали гораздо динамичней в управлении."
  "Эскортные корабли с водоизмещением в районе 800 тонн стали быстрее входить в циркуляцию."
  "На эсминцах и лёгких крейсерах изменения практически не ощущаются."
  "Время перекладки руля у тяжёлых крейсеров из одного крайнего положения в другое выросло примерно на 20%."
  "Изменения в системе пожаров — пересмотрены урон, время горения и место возгорания. Каждый пожар теперь имеет две фазы:"
  "Начальная — со слабым воздействием. Пожар разгорается, начинает наносить небольшой урон экипажу. Механизмы и модули не получают урона."
  "Основная — с полным воздействием, зависящим от размеров пожара, который распространяется, разрастается и наносит урон горящему узлу и всем остальным окружающим его механизмам."
  "Время начальной фазы пожара невелико, но достаточно для своевременного принятия мер по его тушению, при котором ущерб от пожара окажется минимальным. Любой отсек или модуль может полностью выгореть, после чего пожар с определённой вероятностью погаснет без использования огнетушителя в случае, если распространение огня не пошло в соседние отсеки или модули. При уничтожении артиллерийской установки или башни любым способом есть шанс её возгорания. В этом случае возникает пожар, который может распространиться на соседние модули, если до них достанет."
  "Увеличена живучесть снарядных погребов на эсминцах и крейсерах с раздельным заряжанием орудий главного калибра. Толщина стенок хранящихся в снарядных погребах снарядов увеличена в соответствии с их калибром. Увеличена сопротивляемость хранящихся снарядов взрыву, огню и осколкам."
  "USS Atlanta (CL-51) — исправлена Модель повреждения кормового погреба боезапаса, ранее имевшего слишком большие габариты."
  "IJN Tone — исправлена толщина и форма бронирования барбетов, вырезов в бронепалубе, защиты подачных труб, носовых и кормовых траверзов."
  "Köln F220 — добавлено бронирование 40-мм установок."
  "На следующих итальянских кораблях исправлено количество экипажа: Vosper GIS811: 13 → 16, MS472: 19 → 20, MS473: 19 → 20, MV611: 19 → 22, Corazziere: 219 → 215, Geniere 219: → 215, Bartolomeo Colleoni: 507 → 521."
  "Всем итальянским катерам уменьшены габариты погребов боезапаса."
  "HMS London, HMS Kent — исправлена схема и толщина брони погребов боезапаса."
  "Тип 1936А (Mob) — исправлено наполнение кормового погреба боезапаса."
  "Kanonenboot K-2 — исправлены пересечения бронепалубы погребами боезапаса."
  "USS Pensacola (CA-24) — исправлена толщина и тип брони поясов."
  "94 ft PT-811 — максимальная скорость уменьшена с 55 до 47,7 узлов."
  "89 ft PT-810 — максимальная скорость увеличена с 41 до 44,3 узлов."
  "AF D1, AF D3, HMS Kent (54) — уменьшен крен корабля в циркуляции."
  "USS Portland (CA-33) — корабль восстановлен в исходное состояние, с небронированными стенками корпуса. За основу взята информация из отчёта о повреждениях корабля 1945 года."
  "HMS London (69) — бронирование первой турели главного калибра приведено к соответствию с видимой моделью."
  "PGH-2, PG 02, Sparviero — уменьшены радиус и потеря скорости в циркуляции."
  "HMS Tiger — полностью переделаны топливные баки корабля. Дополнительная информация взята из Original Plan - HMS Tiger (as fitted), 1959. General arrangement and Cross Sections."
  "Bartolomeo Colleoni — убрано бронирование барбетов башен ГК в соответствии с историческими данными."
]}
"Модели кораблей, визуальная часть"
{t="bullets" v=[
  "HMS Tiger — исправлены размеры разрывов ОФ снарядов с радиовзрывателем."
  "MV-611 — флаг изменён на послевоенный вариант."
  "Raimondo Montecuccoli — исправлена осадка в ангаре."
  "Bennion (DD-662) — добавлены тканевые маски на третье орудие ГК."
  "МО-4 — позиция стрелка кормовой пушки изменена, чтобы избежать пересечений с объектами на палубе."
  "Тип 4 Модель 2, Ha-Go — исправлено пересечение глубинных бомб между собой."
  "Bartolomeo Colleoni — исправлено исчезание масок орудий главного калибра в зависимости от уровня детализации модели (LOD)."
  "IJN Kako, IJN Furutaka — добавлены визуальные модели ящиков с глубинными бомбами на корме."
  "Dardo — установки ГК 1937 года заменены на модификацию 1926 года."
]}
{t="sep"}
{t="h2" v="Экономика и развитие"}
{t="bullets" v=[
  "Изменены ветки истребительной авиации США."
  "Увеличено минимальное количество необходимой техники Италии для открытия V ранга."
  "Pz.III L и Pz.III M в дереве исследования наземной техники Германии объединены в одну группу."
  "P-47D-25/D28 — Боевой рейтинг в Аркадных боях изменён с 3.7 до 4.0."
]}
{t="sep"}
{t="h2" v="Внешний вид и достижения"}
{t="bullets" v=[
  "Декораторы перераспределены по новым группам."
  "Топовые танки СССР — добавлены для исследования и покупки «Поздний одноцветный» и «Поздний пустынный» камуфляжи."
  "Опознавательные знаки и декали на нижеперечисленных машинах перенесены на слой стандартного камуфляжа. Ранее выданные декали также остались доступны: M46 'Tiger', M18 'Black Cat', Cobra King, M3A1 (USMC), M2A4 (1st Arm.Div.), M5A1 (5th arm.div.), Pz.Kpfw. Churchill, Pz.II C (DAK), T-V (СССР), СУ-76М (5гв.Кав.Корп), М-3 Средний (СССР), Т-26 (1 Гв.Т.Бр.), Iron Duke IV, Sherman IC, 'Trzyniec', A13 Mk.I (3rd RTR), A13 Mk.II 1939, IS-2 №402, Т-34-85 №215"
  "Опознавательные знаки и декали на нижеперечисленных машинах перенесены на дополнительный бесплатный камуфляж «Полигон 113». Ранее выданные декали остались доступны. Стандартный камуфляж изменён: КВ-220, Grant I"
  "Для следующих камуфляжей убраны дополнительные условия получения в виде типа цели: A6M2 — камуфляж 'V-103'; Bf 109 E-3 — камуфляж Stab III./JG53; Bf 109 G-6 — камуфляж Stab.III/JG.52; Ла-5 — одноцветный камуфляж; P-40E-1 — «Белый 106»; P-47D-28 — камуфляж 61FS/56FG; Як-1Б — камуфляж Лидии Литвяк; Hurricane Mk.I/L — камуфляж FAA."
  "Пересчитаны условия выполнения заданий для получения камуфляжа на всей технике (таблица)."
  "Рост значений сделан более плавным (особенно будет заметно на высокоранговой технике)."
  "Порядок получения камуфляжей приведён к единой схеме (пустыня — зима — лес). Изменения не коснутся уже полученных камуфляжей. Если новых значений будет достаточно для выполнения задания, камуфляж будет выдан сразу."
  "США — зимний камуфляж теперь будет выдаваться перед «двухцветным»."
  "Германия — зимний камуфляж будет выдаваться перед камуфляжами «Линии» и «Пятна»."
  "СССР — лесной и пустынный камуфляжи поменяны местами."
]}
{t="sep"}
{t="h2" v="Коллекции"}
{t="bullets" v=[
  "В игру добавлена новая сущность «коллекция» — набор предметов, за составление которого игрок получает награду. Награда выдается только при наличии предметов (декали и декораторы) на аккаунте игрока."
  "Добавлен пункт меню «Магазин → Коллекция»."
  "Добавлены стартовые коллекции декалей и декораторов. В будущем количество коллекций будет увеличено."
  "Добавлены ссылки на Биржу для акционных декалей и декораторов."
  "Добавлен коллекционный трофей для консолей."
]}
{t="sep"}
{t="h2" v="Интерфейс"}
{t="bullets" v=[
  "Добавлена возможность выбора подвесного вооружения самолета в блок 'Избранное вооружение'."
  "Улучшена камера в корабельном ангаре: её перемещение стало более плавным, сама камера теперь находится на одинаковом расстоянии от корабля."
  "Улучшено качество иконок маркеров техники на тактической карте, самолётном радаре, а также в маркерах над техникой в Аркадных боях."
]}
{t="sep"}
{t="h2" v="Игровая механика"}
{t="bullets" v=[
  "Добавлен анализ защищенности для авиации."
  "Снаряды в Модели повреждений теперь имеют геометрические размеры, соответствующие реальным."
  "Для техники, оборудованной системой СПО, добавлена система обнаружения лазерного облучения."
  "В совместных танковых боях в СБ добавлена механика, при которой для игрока после возрождения в течение 7 секунд будут отображаться маркера союзников на миникарте. Это сделано для понимания расположения игроков на поле боя  и повышения командного взаимодействия."
  "Увеличена дистанция опознавания кораблей в боях (переключение названия корабля на маркере противника)."
]}
{t="sep"}
{t="h2" v="Графика"}
{t="bullets" v=[
  "Визуальный эффект пожаров двигателей на эсминцах и крейсерах полностью переработан. Добавлена новая логика определения мест возникновения эффектов дыма и огня."
]}
{t="sep"}
{t="h2" v="Звук"}
{t="bullets" v=[
  "Звуки пушек и пулеметов наземной и морской техники скорректированы в сторону большей яркости и четкости звучания, также подчёркнута низкочастотная составляющая выстрела."
  "Созданы новые звуки для пушки с вращающимся блоком стволов M61 (SPAAG M163)."
  "Изменён принцип реверберационного отклика для всех звуков с целью сделать звуковую картину в игре более естественной. Ранее использовалась алгоритмическая реверберация (расчёт в реальном времени отражения звука от некоего виртуального объема, параметры которого заданы математической функцией), теперь используется конволюционная реверберация (то есть применение операции свёртки к исходному звуку в игре и эталонному, записанному в реальных условиях). Для звуков внутри кабины самолёта или закрытого корпуса танка использованы реальные отражения (импульсная характеристика реального объема, будь то улица, комната или кабина), записанные в интерьерах военной техники. Для звуков окружения использованы реальные отражения, записанные в поле и на местности со средней и плотной застройкой. Также при приближении к земле на самолёте с видом от третьего лица можно ощутить отражения звуков от поверхности земли."
  "Изменены звуки пролётов пуль и снарядов. Теперь они щелкают или хлопают при пролёте мимо слушателя."
  "Исправлена ошибка, из-за которой звуки пролёта пуль и снарядов проигрывались при попадании по технике игрока. Теперь звуки пролёта звучат только в случае близкого промаха."
  "Добавлен характерный звук падения на землю оторванной танковой башни."
]}
{t="sep"}
{t="h2" v="Матчинг"}
{t="bullets" v=[
  "Балансные правки танкового СБ"
  "Сетап 2_5 - убран T 34 747 (r)."
  "Сетап 8_2_5 - возвращен ИС-7."
  "Сетапы 8_2_5, 9_5 - стоимость возрождения на тяжелых танках увеличена до 450 ОВ."
]}
]
