return [
  {t="h1" v="Обновление «Ярость викингов»"}
  {t="h2" v="Остальное"}
  {t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
  {t="bullets" v = [
    "Т-72А — детали ВЛД сделаны по технологии объёмной брони."
    "Т-80Б — детали ВЛД сделаны по технологии объёмной брони."
    "Т-54 (1947), Т-54 (1949), Т-54 (1951) — орудийная маска сделана по технологии объёмной брони."
    "Type 59, Type 69, ZTZ59D1 — орудийная маска сделана по технологии объёмной брони."
    "Т-34, все версии с 76-мм и 57-мм орудиями — детали маски и ВЛД сделаны по технологии объёмной брони и детализированы."
    "Kpz-70, MBT-70, Leopard 1, M48AC2 — добавлены инфракрасные прожекторы."
    "Значительно увеличена точность сопровождения целей оптическими средствами зенитных установок."
    "ЗРК Stormer HVM — исправлена максимальная дальность действия, ранее заявленная в карточке дальность в 7 км не достигалась, ракеты подрывались на дистанции около 5 км."
    "Изменено заброневое действие подкалиберных оперённых снарядов. Теперь при пробитии брони с большим запасом остаточного пробития (мощный снаряд против слабо защищённой зоны танка) заброневое действие выше, тогда как при пробитии брони с малым запасом остаточной бронепробиваемости заброневое действие вторичных осколков ниже, чем раньше, примерно на 15-20%."
  ]}
  {t="sep"}
  {t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
  {t="bullets" v = [
    "Дальность пуска большинства ракет «воздух-воздух» приведена к реальной на малых высотах, т.е. снижена примерно на 25-30%. Снижение дальности пуска для средних и больших высот незначительно."
    "Исправлено поведение ИК ГСН ракет «воздух-воздух» при появлении нескольких целей в поле зрения ГСН. Теперь ракеты больше не будут отворачивать в сторону от целей."
    "Ракеты «Игла», «Стингер» и “Mistral” — уточнены лётные характеристики и параметры ГСН: повышена тяга двигателя и снижена располагаемая перегрузка."
    "Уточнены параметры ракеты “Firestreak” — увеличена располагаемая перегрузка и угол слежения за целью, реализован метод погони вместо пропорционального наведения."
    "Лётные характеристики ракеты Р-60М приведены к историческому соответствию, а именно сделаны по аналогии с Р-60."
    "Облачность теперь снижает дальность захвата цели ИК и лазерной ГСН ракет, а также дальность обнаружения и захвата цели оптическими средствами вертолётов и ЗРК."
    "Уточнены скорости и максимальное время полёта всех авиационных ПТУР. Максимальная дальность пуска стала зависеть от высоты вертолёта и цели. В частности, дальность ПТУР «Вихрь» при пуске у земли сократилась с 10 до 8.6 км, у других ПТУР изменения дальности пуска незначительны."
    "F-4M FGR-2 — получил СПО и вычислитель зоны разрешённых пусков ракет «воздух-воздух» для РЛС, а также баллистический вычислитель для применения бомб, НУРСов и пушки по наземным целям."
    "F-4C — модульный комплект получил СПО."
    "МиГ-21Ф-13, МиГ-21МФ, МиГ-21СМТ — получили вычислители зоны разрешённых пусков ракет «воздух-воздух» для радиодальномера и РЛС соответственно."
    "МиГ-21МФ, МиГ-21СМТ — получили баллистический вычислитель для применения НУРСов и пушки по наземным целям."
    "F-4C— получил вычислители зоны разрешённых пусков ракет «воздух-воздух» для РЛС."
    "T-2 — получил вычислитель зоны разрешённых пусков ракет «воздух-воздух» для РЛС, баллистический вычислитель для применения бомб, НУРСов и пушки по наземным целям."
    "AH-1F, AH-1Z — вертолёты получили автоматический прицел для стрельбы НУРСами. AH-1Z также получил автоматический прицел для стрельбы курсовыми пушками и автоматическое прицеливание пушечной турели по выбранной цели."
    "Tiger UHT — вертолёт получил автоматический прицел для стрельбы НУРСами и курсовыми пушками по выбранной цели."
    "Ми-28Н — вертолёт получил СПО-150 «Пастель» вместо СПО-15 «Берёза». Боекомплект  пушки 2A42 скорректирован до 250 выстрелов."
    "Ми-24, Ми-35М, Ми-28Н, Ка-50 — вертолёты получили автоматический прицел для стрельбы НУРСами и курсовыми пушками. Ми-28Н и Ка-50 получили автоматическое прицеливание пушечных турелей по выбранной цели."
    "AH-1S — вертолёт получил автоматический прицел для стрельбы НУРсами."
    "A-129A — вертолёт получил автоматический прицел для стрельбы НУРСами и курсовыми пушками, а также автоматическое прицеливание пушечной турели по выбранной цели."
    "Tiger HAP, Tiger HAD — вертолёты получили автоматический прицел для стрельбы НУРСами и курсовыми пушками, а также автоматическое прицеливание пушечных турелей по выбранной цели."
    "Авиационные пушки ГШ-30, НР-30, Н-37 — снижена отдача при выстреле."
    "Тип боеприпаса 30-мм пушки вертолета Tiger HAP и HAD исправлен с осколочно-фугасного на полубронебойный (SAPHEI), увеличена баллистическая дальность полёта, добавлено кинетическое пробитие. Теперь данный снаряд сохраняет эффективность при стрельбе по целям на дистанции до 3-х км."
    "Ракеты RP-3 — исправлена локализация, которая неверно отображалась у части самолётов."
    "Pyorremyrsky — изменена набивка лент и боеприпасы к 12,7 пулемёту LKk/42."
    "J20, J11 — состав вооружения изменён на пулемёты Akan m/40."
  ]}
  {t="sep"}
  {t="emphasis" v="Изменения в лётных моделях"}
  {t="bullets" v = [
    "Все вертолёты — в Аркадном режиме отключено заваливание вертолёта набок при превышении максимально допустимой скорости полёта."
    "ЛаГГ-3-11/23/34/35/66 серий — исправлена ошибка, приводящая к неверному отображению полётного времени в зависимости от количества выбранного топлива."
    "Бомбы калибров от 100 до 3000 фунтов (США, Британия) — исправлены ошибки, связанные с некорректными значениями паразитного лобового сопротивления самолёта."
    "FFAR,  Mighty Mouse — лобовое сопротивление блоков скорректировано."
    "Halifax B Mk.III — исправлено название и модель двигателей при просмотре в режиме рентгена в ангаре."
    "A21A-3 — исправлена ошибка, приводящая к неверному заполнению баков топливом."
    "A21RB — исправлена ошибка влияния на ЛТХ самолёта подвесного контейнера Ksp m/22."
    "B5N2, B7A2, D4Y1, D4Y2, D4Y3 Ko, P1Y1 – лётная модель полностью обновлена. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолётов при выпуске механизации и шасси. Скорректировано распределение топлива по бакам. Уточнены моменты инерции."
    "B7A2 — исправлена заниженная скорость самолёта. Скорость приведена к паспортным данным."
    "Lynx AH.Mk.1, G-LYNX, Scout AH.Mk.1, Wasp HAS.Mk.1 — исправлена ошибка, приводящая к некорректному освещению приборной панели вертолётов."
    "G5N1 — лётная модель полностью обновлена. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Скорректировано распределение топлива по бакам. Уточнены моменты инерции."
    "СБ 2 (вся линейка) — исправлена ошибка, из-за которой самолёт сваливался в штопор при остановке одного из двигателей на скоростях, превышающих указанные в РЛЭ значения. Данный эффект теперь будет проявляться на скоростях около 135 км/ч и ниже."
    "ДБ-3А — исправлена ошибка в работе механизации (посадочных щитков)."
    "F-86F-40, F-86F-40 JASDF — уменьшена эффективность рулей высоты на больших скоростях, максимальная располагаемая перегрузка снижена до более безопасных значений (разрушения от перегрузок стали реже)."
  ]}
]