return [
  {t="h1" v="Обновление 'Ярость викингов'"}
  {t="h2" v="Новые локации и миссии"}
  {t="bullets" v = [
    "Новая танковая локация 'Швеция' вместе с набором миссий."
    "Новая авиационная локация 'Дания'."
    "Пробный вылет на локации 'Дания' для шведской авиации."
  ]}
  {t="sep"}
  {t="h2" v="Изменения на локациях и миссиях"}
  {t="bullets" v = [
    {t="vertical" v = [
      "В Совместных танковых боях изменены модели аэродромов, теперь длина взлётных полос будет варьироваться в зависимости от ранга боя:"
      {t="bullets" v = [
        "ВПП на низких рангах - 1200 м."
        "ВПП на средних рангах - 1700 м."
        "ВПП на высоких рангах - 3200 м."
      ]}
    ]}
    "В Совместных танковых боях расположение аэродромов приведено к единому стандарту. Теперь для боёв низких и средних рангов аэродромы располагаются в 7000 метрах от центра локации, а на высоких рангах дистанция увеличена до 12000 метров (до этого аэродромы в основном располагались на дистанциях от 6000 до 9000 метров)."
    {t="vertical" v = [
      "В следующих миссиях типа 'Штурмовка' отключён механизм автоматического уничтожения наземных целей под управлением ИИ 'барабашка'. Вместо него добавлен новый тип целей - ИИ-штурмовики, которые появляются за каждую из команд и атакуют наземную технику. Также в этих миссиях увеличено количество наземной техники, а в зачёт Очков победы идёт как тяжёлая техника (доты и танки), так и лёгкая (артиллерия, грузовики, зенитки). Ранее уничтожение лёгкой техники не влияло на очки победы."
      {t="bullets" v = [
        "Штурмовка 'Оаху'"
        "Штурмовка 'Берлин'"
        "Штурмовка 'Британия'"
        "Штурмовка 'Гуам'"
        "Штурмовка 'Корсунь'"
      ]}
    ]}
    "В этих же миссиях модели аэродромов заменены на новые с длиной взлётной полосы 1700 метров."
    "В этих же миссиях отключены счётчики техники. По сути они дублировали полоску очков в верхней части экрана, но в некоторых случаях могли не отражать реального количества техники, необходимой для победы - например, при уничтожении зон для бомбардировки."
    "В этих же миссиях сбитие самолётов игроков теперь влияет на количество Очков победы у его команды (ранее сбитие самолётов не влияло на очки). Аналогичный механизм уже некоторое время используется в миссиях типа 'Превосходство на аэродромах' и хорошо себя показал."
    "Исправлено отсутствие неуязвимости при возрождении наземной техники на локациях 'Хюртгенский лес' и 'Линия Мажино'."
  ]}
]