return [
{t="h1" v="Новая техника"}
"Новая линейка развития флота Италии, новые самолёты, бронетехника, локации и многое другое. Всего больше 60 новых танков, самолётов, вертолётов и кораблей."
{t="sep"}
{t="h2" v="Самолёты"}
"В игру прибывает почти два десятка новых машин."
{t="horizontal" v = [
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(8), fpx(10)] v = [
      {t="image" v = "!ui/aircrafts/f3h-2" size = [fpx(282), fpx(188)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="США"}
      {t="bullets" v = [
        "F3H-2"
        "F-104A"
        "F-104C"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(8), fpx(10)] v = [
      {t="image" v = "!ui/aircrafts/f-86k_late_german" size = [fpx(282), fpx(188)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Германия"}
      {t="bullets" v = [
        "F-86K"
        "G.91 R/4 Премиумный"
        "F-104G"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(8), fpx(10)] v = [
      {t="image" v = "!ui/aircrafts/su-7b" size = [fpx(282), fpx(188)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="СССР"}
      {t="bullets" v = [
        "Су-7Б"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(8), fpx(10)] v = [
      {t="image" v = "!ui/aircrafts/scimitar_f1" size = [fpx(282), fpx(188)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Британия"}
      {t="bullets" v = [
        "Scimitar F Mk.1"
        "Phantom FG. Mk1"
        "Spitfire Mk.IIa Venture I Премиумный"
      ]}
    ]}
  ]}
]}
"\n"
{t="horizontal" v = [
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/aircrafts/f-104j" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Япония"}
      {t="bullets" v = [
        "F-104J"
        "B6N2 Model 12"
        "Ki-27 otsu Tachiarai Премиумный"
        "Ki-44-I 34 Премиумный"
        "Ki-61-I hei Tada’s Премиумный"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(6), fpx(15)] v = [
      {t="image" v = "!ui/aircrafts/f-86f-40_china" size = [fpx(282), fpx(190)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Китай"}
      {t="bullets" v = [
        "F-86F-40"
        "F-104A"
        "F-104G"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/aircrafts/f-104s" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Италия"}
      {t="bullets" v = [
        "F-104S"
        "Re.2001 gruppo 22 Премиумный"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/aircrafts/mirage_3c" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Франция"}
      {t="bullets" v = [
        "Mirage IIIC"
      ]}
    ]}
  ]}
]}
{t="sep"}
{t="h2" v="Бронетехника"}
"Почти два десятка новых машин."
{t="horizontal" v = [
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/tanks/us_hstv_l" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="США"}
      {t="bullets" v = [
        "HSTV-L"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/tanks/germ_mkpz_super_m48" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="Германия"}
      {t="bullets" v = [
        "Kampfpanzer M48 Super"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/tanks/ussr_9p157" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="СССР"}
      {t="bullets" v = [
        "9П157-2 «Хризантема-С»"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/tanks/uk_challenger_2_dorchester" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="Британия"}
      {t="bullets" v = [
        "Challenger 2F"
        "Stuart I"
        "Stuart III"
      ]}
    ]}
  ]}
]}
"\n"
{t="horizontal" v = [
  {t="vertical" v = [
    {t="horizontal" halign = ALIGN_CENTER padding = [fpx(11), fpx(17)] v = [
      {t="image" v = "!ui/tanks/jp_type_93" size = [fpx(278), fpx(178)]}
    ]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="Япония"}
      {t="bullets" v = [
        "Type 93"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="image" v = "!ui/tanks/cn_zsd63_pg87" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="Китай"}
      {t="bullets" v = [
        "ZSD63"
        "T-69 II G (в составе пакета)"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="image" v = "!ui/tanks/it_sherman_75_37" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="Италия"}
      {t="bullets" v = [
        "M4 Hybrid (премиумный)"
        "M3A3"
        "M24"
        "M4A4"
        "Sherman Vc"
        "M18"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="image" v = "!ui/tanks/fr_amx_13_chaffee" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(48)] v = [
      {t="emphasis" v="Франция"}
      {t="bullets" v = [
        "AMX-13-M24 (премиумный)"
        "M4A4"
        "Renault D2"
      ]}
    ]}
  ]}
]}
{t="horizontal" padding = [fpx(11), fpx(17)] margin = [0, fpx(27)] v = [
  {t="image" v = "!ui/tanks/sw_strf_9056" size = [fpx(278), fpx(178)]}
]}
{t="vertical" margin = [0, fpx(48)] v = [
  {t="emphasis" v="Швеция"}
  "Бронетехника Швеции доступна для исследования и покупки всем игрокам."
  {t="bullets" v = [
    "Strf 9056"
  ]}
]}
{t="sep"}
{t="h2" v="Вертолёты"}
{t="horizontal" padding = [fpx(11), fpx(17)] margin = [0, fpx(27)] v = [
  {t="image" v = "!ui/aircrafts/ah_64d_japan" size = [fpx(278), fpx(178)]}
]}
{t="vertical" margin = [0, fpx(48)] v = [
  {t="emphasis" v="Япония"}
  {t="bullets" v = [
    "UH-1B"
    "AH-1S early"
    "AH-1S"
    "AH-64DJP"
  ]}
]}
{t="sep"}
{t="h2" v="Флот"}
{t="horizontal" valign = ALIGN_CENTER v = [
  {t="vertical" v = [
    {t="image" v = "!ui/ships/us_cruiser_cleveland_class_cleveland" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="США"}
      {t="bullets" v = [
        "USS Cleveland (CL-55)"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="image" v = "!ui/ships/ussr_destroyer_pr56_spokoinyy" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="СССР"}
      {t="bullets" v = [
        "Пр. 56 Спокойный"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="image" v = "!ui/ships/uk_cruiser_york" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Британия"}
      {t="bullets" v = [
        "HMS York (90)"
      ]}
    ]}
  ]}
  {t="vertical" v = [
    {t="image" v = "!ui/ships/jp_cruiser_tone" size = [fpx(312), fpx(200)]}
    {t="vertical" margin = [0, fpx(50)] v = [
      {t="emphasis" v="Япония"}
      {t="bullets" v = [
        "IJN Tone"
      ]}
    ]}
  ]}
]}

"\n"
{t="horizontal" margin = [0, fpx(27)] v = [
  {t="image" v = "!ui/ships/it_destroyer_soldati_serie1_geniere" size = [fpx(312), fpx(200)]}
]}
{t="vertical" margin = [0, fpx(48)] v = [
  {t="emphasis" v="Италия"}
  "Мы начинаем ЗБТ итальянского флота. Исследование и покупка кораблей Италии доступна владельцам наборов раннего доступа Италии и Испытателям — игрокам, выполняющим специальные задания на получение доступа. Не пропустите подробности и условия в новостях."
  {t="bullets" v = [
    {t="url" v= "Наборы раннего доступа флота Италии" url="https://store.gaijin.net/catalog.php?search=wt_italian_navy&tag=1" platform="pc"}
  ]}
  "\n"
  "Сразу 21 единица техники стартовой линейки развития."
  {t="bullets" v = [
    "MAS 555"
    "MS-15"
    "VAS 201"
    "Stefano Turr"
    "MS-53"
    "Vosper 70' GIS 811"
    "MS-472"
    "MV-611"
    "MS-473"
    "Folgore P-490"
    "Saetta P-494"
    "Turbine"
    "Dardo"
    "Corazziere"
    "Attilio Regolo"
    "Bartolomeo Colleoni"
    "Raimondo Montecuccoli"
    "Trento"
    "MAS 569 (премиумный)"
    "Sparviero (в составе набора)"
    "Geniere (в составе набора)"
  ]}
]}
{t="h2" v="Новые локации и миссии"}
{t="bullets" v = [
"Локация «Курск — Огненная дуга» — улучшена в соответствии с отзывами пользователей."
"Локация «Италия» — улучшена в соответствии с отзывами пользователей. Название изменено на «Кампания» чтобы избежать путаницы с предыдущей версией локации."
]}
{t="sep"}
{t="emphasis" v="Изменения в локациях и миссиях"}
{t="bullets" v = [
"Исправлена коллизия камней на танковой локации «Финляндия»."
"Локации «Пепельная река», «Карпаты», «38 параллель» — закрыты известные кемперские позиции, не предусмотренные дизайном локаций."
"Локация «Польша» — уменьшена высота камней на утёсе с западной стороны озера."
]}

{t="emphasis" v="Изменения в авиационных миссиях для Реалистичных боёв:"}
{t="bullets" v = [
"[Операция] Смоленск — миссия удалена."
"[Операция] Смоленск. 1941 — новая миссия."
"[Операция] Смоленск. 1943 — новая миссия."
"[Операция] Битва за Бастонь."
"[Операция] Берлин — миссия полностью переделана."
"[Операция] Сражение при Эль-Аламейне."
"[Операция] Гуадалканал — миссия полностью переделана."
"[Операция] Хуртген."
]}
{t="emphasis" v="Список изменений, характерных только для этих миссий:"}
{t="bullets" v = [
"Модели баз для бомбардировки заменены на актуальные, а их функционал теперь соответствует таковому в миссиях «Противостояния». Базы после их уничтожения будут появляться снова в случайных местах из перечня заранее определённых для каждой из миссий позиций."
"Из списка целей для бомбометания убраны аэродромы, теперь их нельзя уничтожить."
"Модели аэродромов и их расстояние до центра карты стандартизированы. На низких рангах аэродромы располагаются в 12 км от центра карты, на средних — в 20 км, на высоких — в 26 км. До этого все ранги начинали бой на аэродромах, удалённых от центра карты на 20 км."
"Размер аэродрома теперь зависит от ранга боёв."
"На средних рангах появился аэродром подскока, расположенный на расстоянии 12 км от центра карты."
]}
{t="emphasis" v="Изменения в авиационных миссиях для Аркадных боёв:"}
{t="bullets" v = [
"[Штурмовка] Моздок."
"[Штурмовка] Порт-Морсби."
"[Штурмовка] Рур."
"[Штурмовка] Сицилия."
"[Штурмовка] Корсунь."
"[Штурмовка] Заброшенный завод."
"[Штурмовка] Ледяной перевал."
"[Штурмовка] Горный кряж, Китай."
"[Штурмовка] Утёсы чёрных копателей."
]}
{t="emphasis" v="Список изменений, характерных только для этих миссий:"}
{t="bullets" v = [
"Модели баз для бомбардировки заменены на актуальные."
"Модели аэродромов заменены на новые с длиной взлётной полосы 1700 метров."
]}
{t="emphasis" v="Список изменений, общий для всех вышеуказанных миссий Реалистичных и Аркадных боёв:"}
{t="bullets" v = [
"Сбитие самолётов под управлением игроков теперь приносит очки победы."
"Отключены счётчики техники. По сути они дублировали полоску очков в верхней части экрана, но в некоторых случаях могли не отражать реального количества техники, необходимой для победы — например, при уничтожении зон для бомбардировки. Теперь ориентироваться следует на шкалу индикации очков победы."
"Вся наземная техника теперь влияет на очки победы (ранее уничтожение лёгкой техники не влияло на очки победы), а её количество увеличено. Игрокам для уничтожения доступна как лёгкая наземная техника (артиллерия, грузовики, зенитки), так и тяжёлая (доты и танки)."
"Отключён механизм автоматического уничтожения наземных целей под управлением ИИ. Вместо него добавлен новый тип целей — ИИ-штурмовики, которые появляются за каждую из команд и атакуют наземную технику."
"Улучшено распределение наземной техники. Теперь она либо равномерно распределена по всей линии фронта протяжённостью порядка 10 км, либо сфокусирована в 3-4 зонах, расположенных вдоль той же линии фронта. Ранее в миссиях бывали ситуации, при которых вся наземка либо базировалась в одной области протяжённостью 2-4 км, либо же расстояние между местами её дислокации было слишком большим."
]}
{t="emphasis" v="Изменения и исправления в танковых миссиях:"}
{t="bullets" v = [
"[Сражение] Аляска — исправлена ошибка, из-за которой зоны возрождения южной команды отображались одной иконкой."
"[Захват] Карелия — удалены лишние зоны возрождения из брифинга миссии; исправлена позиция зоны возрождения, которая была расположена перед деревом."
"[Захват] Фульда — исправлен размер боевой зоны в брифинге миссии для Реалистичных боёв."
"[Захват] Польша — исправлено расположение точек захвата и возрождения в брифинге миссии для Реалистичных и Симуляторных боёв."
"[Захват] Вьетнам — в Реалистичных и Симуляторных боях зоны возрождения перенесены ближе к точке захвата."
"[Захват] Второе сражение за Эль-Аламейн — убраны лишние зоны возрождения; увеличен размер зон захвата."
"[Захват] Поля Польши — в Реалистичных и Симуляторных боях зоны возрождения перенесены ближе к точке захвата."
"[Сражение] Поля Польши — исправлено расположение точек захвата в брифинге миссии."
]}
{t="emphasis" v="Изменения и исправления в морских миссиях:"}
{t="bullets" v = [
"«[Превосходство] Огненная земля» — исправлено расположение защиты зон возрождений."
]}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v = [
"Для ЗРК реализовано обнаружение, захват и сопровождение авиационных средств поражения. Теперь ЗРК может обнаруживать, захватывать и обстреливать атакующие их ракеты или бомбы. Также на индикаторе отображаются собственные пущенные ракеты."
"Максимальная дальность замера для всех лазерных дальномеров увеличена до 9999 м."
"Увеличена дальность шкал прицела по умолчанию для всей наземной техники. Максимальная дальность нарезки шкал составляет теперь 6000 м."
"Для следующих машин добавлена модификация Ostketten («Восточные гусеницы»), меняющая тип установленных гусениц со стандартных на специальные с увеличенной шириной: Jagdpanzer IV, Nashorn, Panzer IV/70(V), Pz.IV Ausf.E, Pz.IV Ausf.F, Pz.IV Ausf.F2, Pz.IV Ausf.G, Pz.IV Ausf.H, Pz.IV Ausf.J, StuG.III Ausf.F, StuG.III Ausf.G, StuH.III Ausf.G. Модификация увеличивает общую подвижность и незначительно увеличивает стойкость гусеницы к урону."
"БМП-3 — время перезарядки ПТУР снижено с 2 до 3 выстрелов в минуту. Источник: Вестник бронетанковой техники, 1991, Комплекс вооружения БМП-3."
"Т-10М — скорострельность орудия увеличена с 3,9 до 4 выстрелов в минуту. Источник: Руководство по материальной части и эксплуатации танка Т-10М, 1960."
"Объект 268 — начальная скорость бронебойного снаряда БР-540Б увеличена с 750 до 760 м/с. Источник: Отечественные бронированные машины. XX век. Том 3. 1946-1965, Солянкин А.Г, Желтов И.Г., Кудряшов К.Н."
"БМП-1, Spz BMP-1, Type 86 — угол склонения орудия снижен с -5° до -4°. Источник: Боевая Машина Пехоты БМП-1 Техническое описание и инструкция по эксплуатации."
"Type 60 SPRG — добавлена механика разрушения корпуса."
"Type 89 — размер боекомплекта для пулемёта снижен с 2000 до 1000 патронов."
"Type 61 — размер боекомплекта снижен с 4900 до 4000 патронов для 7,62-мм пулемёта, и с 2175 до 500 — для пулемёта 12,7 мм."
"Type 74, Type 74G — размер боекомплекта снижен с 5500 до 4500 патронов для 7,62-мм пулемёта, и с 1000 до 600 — для пулемёта 12,7 мм."
"Leopard 2A5, Strv 122 — исправлен пресет тепловизионного оборудования.Теперь наводчик использует тепловизор первого поколения, а командир — второго. Ранее оба использовали тепловизоры второго поколения. Источник: 12 cm kanon strv 121/122. Skjuttabeller. // PRZEGLĄD SIŁ ZBROJNYCH nr 6/ 2014 // Vehicle Optronics, HENSOLDT brochure."
"Pz.V Ausf.D/A/G/F, Panther II, T-V, Ersatz-M10, Tiger H1, Tiger E, Heavy Tank No.6, M4A3E2, M4A3E2 Kobra King, M4A3E2 76 (W) — уточнено бронирование орудийных масок. Бронирование масок переведено в объемную броню."
"M1A2 — исправлен пресет поколения тепловизионного оборудования. Ранее ошибочного использовался пресет второго поколения, теперь он заменён на первое поколение. Источник: Center for Night Vision and Electro-Optic, Common Modules, A Success Story, June 1988, AD-A195 937 // The M1A2: Current and Future Program Plans, 1997."
"КВ-1С — масса танка увеличена с 41400 до 42500 кг. Источник: Инструкция по эксплуатации танка КВ-1С, издание завода, 1943."
"XM-803, MBT-70 — скорострельность при стрельбе снарядами увеличена с 6 до 8 выстрелов в минуту. Источник: HEARINGS before COMMITTEE ON APPROPRIATIONS, HOUSE OF REPRESENTATIVES, part 5 RESEARCH, DEVELOPMENT, TEST AND EVALUATION December 1969 // ARMOR magazine july-august 1970 // HEARINGS on MILITARY POSTURE AND HR 3818 and HR 8687 July 1977."
"QF Ram AA — материал конструкции корпуса (за исключением элементов, оставшихся от базового шасси) исправлен с катанной гомогенной брони на конструкционную сталь толщиной 19,05 мм. Источник: Canadian Microfilms, Project 14 SP 3.7 on Ram chassis."
"Sd.Kfz.234/1 — уточнено положение камеры для режима СБ."
"Lvkv 42 — добавлен функционал управляемой подвески. Добавлена возможность разворота на нейтральной передаче. Толщина бронирования увеличена с 8 до 10 мм. Источник: Blad nr 39, Upprattat 29/08 1955."
"M3 Bradley — скорость, при которой возможно использование ПТУР, снижена с 11 до 5 км/ч. Угол склонения орудия над МТО ограничен значением -1°. Источник: TECHNICAL MANUAL TM 9-2350-252-10-2."
"Type 90, Type 90B — масса танка снижена с 51600 до 50200 кг. Источник: Japan Defense Agency (August 6, 1990) Format Outline, Type 90 Tank, D9003 // Japan Defense Agency (August 6, 1990) (Modified March 12, 1993) Format Outline, Type 90 Tank (B), D9003B."
"Strv 74 — класс техники изменён со «Среднего танка» на «Лёгкий танк». Добавлен функционал лёгких танков «Разведка», а также модификации «Улучшенная оптика» и «Авиаудар»."
"Chieftain Marksman — добавлена модификация «ПНВ» для мехвода."
"100 мм ОФ-412 (Д-10Т) — начальная скорость увеличена с 880 до 900 м/с. Источник: Наставление по стрельбе из танков. Основы стрельбы из танков. Издание второе, стереотипное. 1984 // 100-мм танковые пушки Д10-Т, Д10-ТГ и Д10-Т2С. Руководство службы. 1971."
"БМП-1, ZBD86, SPz BMP-1 — значение оборотов двигателя уменьшено с 2880 до 2600. Источник: БМП-1 — Техническое описание и инструкция по эксплуатации. 1979."
"T29, T30, T34 — добавлена механика боеукладки первой очереди."
"T14 (США) — добавлен дымовой снаряд M89."
"Ru 251 — тип действия дымовых гранат изменён на мгновенный."
"Stormer HVM — разрешение тепловизионного прицела приведено в соответствие ТВП третьего поколения."
"АСУ-57 — уточнены углы наведения орудия: по вертикали: от -4° до +12° → от -5° до +12°; по горизонтали: ±7° → ±8° Источник: 57-мм самоходные пушки Ч-51М и Ч-51П. Руководство службы. 1956."
]}
{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v = [
"J35D — добавлены ракеты воздух-воздух RB 24J."
"B17A, B17B — исправлены углы наведения оборонительной турели, убрана возможность прострела киля."
"B-17 (все модификации) — угол наведения по вертикали для верхней оборонительной турели исправлен до 85°."
"Swordfish Mk.I — для оборонительной турели исправлены углы наведения по вертикали и горизонтали."
"B17A, B17B, B3C — обозначение лент боекомплекта в окне исследования модификаций исправлено с курсовых на турельные."
"A21RB — добавлен раздельный пуск подвесного ракетного вооружения."
"Hornet Mk.III — в окне исследования модификаций исправлена информация о возможности установки ракет RP-3."
"Як-4 — боекомплект турели увеличен до 1000 выстрелов, угол наведения по вертикали увеличен до 70°."
"Су-2 ТСС-1 — исправлены углы наведения турели: по горизонтали: до ±90°, по вертикали: от -32° до +50° → -30° до +70°."
"B5N2 — исправлены углы наведения турели: по горизонтали: до ±50°, по вертикали: от -40° до +80°."
"P-39Q-5, P-39Q-15 — боекомплект крыльевых пулемётов увеличен до 300 выстрелов."
"P-39N — боекомплект крыльевых пулемётов уменьшен до 300 выстрелов."
"F-100D — запуск AGM-12B Bullpup исправлен на клавишу запуска управляемых ракет «воздух — поверхность» в пресете AGM12b bullpup x2+750lbs m117 cone 45 bomb x4 аналогично пресету AGM12b bullpup x2."
"Ki-100, Ki-100-II — исправлена ошибочная информация об отсутствии протектированных топливных баков."
"Sea Fury FB.11 — модификации 20-мм пушек перераспределены на 1 и 3 уровни исследования модификаций. Добавлены ракеты Triplex R.P. Модификация GRC mk8 перенесена на 3 уровень исследования."
"Avenger Mk.II — добавлены ракеты Uncle Tom."
"Firebrand TF.Mk.IV — модификации 20-мм пушек перераспределены на 1 и 3 уровни исследования модификаций. Добавлены ракеты Uncle Tom. Модификации ракетно-бомбового вооружения перераспределены с 1 по 4 уровни исследования."
"Mosquito FB.Mk.VI — модификации 7-мм пулемётов перераспределены на 1 и 3 уровни исследования модификаций. Добавлены ракеты Uncle Tom."
"P-51K (Китай) — исправлена ошибка, из-за которой самолёт появлялся на авианосцах."
"S.O.4050 Vautour IIA — ракеты T10 121 в некоторых пресетах исправлены на T10 140."
"SA.341F Gazelle — исправлены ошибка, из-за которой запускалось по две ракеты Mighty Mouse за раз."
"UH-1C — исправлено визуальное отображение дополнительного 40-мм гранатомёта, а также его визуализация в режиме рентгена."
"BO 105 CB-2 — в прицел стрелка добавлен режим ночного видения."
"H-34 — боекомплект пушечного контейнера Mk 4 Mod 0 увеличен до 750 выстрелов."
"AH-64A, AH-64A Peten — УРВВ AIM-92 Stinger перенесены на законцовки крыла, вместо них на пилоны добавлены различные типы подвесного вооружения."
"BGM-71 TOW, BGM-71 TOW-2 — минимальная дальность пуска исправлена с 30 до 65 метров."
"Торпеда Mk.13 — обозначение торпеды исправлено на Mk.13-1, уточнены её вес и дальность хода."
"Торпеда Mk.XII — уточнены вес и дальность хода."
"210-мм ракеты Wrf.Gr.21 — исправлена ошибка, из-за которой самоликвидатор ракеты на расстояниях до 500 метров срабатывал неверно."
"40-мм граната M430 — исправлена ошибка, из-за которой попадание данной гранаты вызывало разрушение корпуса у ряда моделей наземной техники."
"13-мм пулемёт Type 2 — скорострельность увеличена до 936 выстрелов в минуту."
"20-мм пушка Ho-5 — скорострельность увеличена до 950 выстрелов в минуту."
"Пушечный контейнер Mk 4 Mod 0 — скорострельность уменьшена до 4000 выстрелов в минуту, добавлен дополнительный режим стрельбы со скорострельностью в 700 выстрелов в минуту. Исправлены характеристики боеприпасов."
"37-мм пушка Ho-203 — скорострельность увеличена до 300 выстрелов в минуту."
"30-мм пушка DEFA 552 — вес пушки скорректирован до 81 кг."
"Исправлена точка прицеливания ракет, самонаводящихся на самолёты и вертолёты. теперь она всегда находится в середине фюзеляжа. Раньше она могла располагаться чуть выше, из-за чего не оснащённые неконтактным взрывателем ракеты «воздух-воздух» (например, AIM-92 «Стингер») часто промахивались."
"Переработан автопилот и работа рулевых поверхностей всех самонаводящихся ракет (УРВВ, самонаводящиеся ПТУРы). Ракеты стали управляться более точно, без лишний метаний из стороны в сторону, а также стали точнее выдерживать заданную перегрузку на всех скоростях полёта."
"Исправлено отображение макс. скорости и перегрузки в карточках ракет Р-60/Р-60М и AIM-9L. Максимальная скорость ракет дана для большей скорости пуска (M=1.0). В качестве максимальной перегрузки теперь указана предельно достижимая на больших скоростях (M=2.0 и выше), а не средняя за время управляемого полёта до цели при пуске сзади на скорости M=1.0 при скорости цели M=1.0 на уровне моря на предельную дальность. Для других ракет эти перегрузки численно совпадают."
"Исправлена ошибка, из-за которой в карточке ПТУР могла отображаться не вся информация."
]}

{t="sep"}
{t="h2" v="Изменения в лётных моделях"}
{t="bullets" v = [
"A-4B — исправлена ошибка, из-за которой в карточке самолёта были указаны неверные значения максимальной скорости и скороподъемности."
"Ки-44 (вся линейка) — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции."
"Me-163 (вся линейка), J8M1 – исправлена ошибка, приводящая к сносу самолёта при выпуске посадочной лыжи. Исправлена ошибка, из-за которой замедлялся разгон на разбеге при взлёте с использованием опорной тележки (разгон стал быстрее)."
"Arado-234 B-2 — исправлена ошибка, из-за которой взлёт самолёта с полной загрузкой вызывал трудности. Добавлены реактивные ускорители для облегчения взлёта."
"F1M2 — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Улучшена мореходность."
"SAAB A21-RB — исправлена ошибка, приводящая к повышенному паразитному сопротивлению пусковой установки ракет."
"A6M2-N — улучшена мореходность. Улучшена управляемость на воде при взлёте и посадке."
"И-15 (вся линейка) — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Самолётам И-15 М-22 и И-15К добавлен взлётный режим (WEP) и модуль «Впрыск». Подробные характеристики можно узнать из паспорта самолётов на форуме игры."
"Ta-152-H — добавлено ограничение на выпуск закрылков во взлётное положение согласно паспорту. Уменьшена инерция винтомоторной установки (остановка/раскрутка пропеллёра). Ускорен набор высоты на длительном режиме двигателя в 90% тяги. Увеличена эффективность тормозов, что требует более аккуратного их использования на взлёте и посадке. Значительно уменьшена эффективность элеронов на предельно малых (менее 140 км/ч) скоростях."
"Firefly Mk.5 — уменьшен максимальный объём топлива."
"F-4C — добавлен баллистический вычислитель для применения пушки, НУРСов и бомб по наземным целям."
"F-4EJ — увеличена максимальная скорость на средних высотах, исправлена анимация носка крыла."
"F-4E/EJ, Phantom FGR.2 — добавлен режим навигационного бомбометания по произвольно выбранной точке на земле или по базам противника."
"Ki-61 (вся линейка), Ki-100 (вся линейка), Ki-96, Ki-102 — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам."
"Ил-2 с двигателями АМ-38Ф (вся линейка) — исправлена ошибка в термодинамике, из-за которой было возможно использовать форсажный режим (WEP) без ограничений."
"Ил-2 (вся линейка) — изменена работа посадочных щитков. Теперь щитки не могут быть выпущены на скоростях выше 260 км/ч по прибору (IAS). Со снижением скорости ниже 245 км/ч по прибору (IAS) щитки отклоняются на положенные углы полностью."
"Hunter (вся линейка) — исправлена ошибка, из-за которой было возможно использовать воздушный тормоз при выпущенных шасси. Теперь в случае выпуска шасси при включённом воздушном тормозе тормоз автоматически убирается, а выпуск тормоза при выпущенных шасси более невозможен."
"P-51 (вся линейка) — скорректировано освещение приборной панели при ночном полёте."
"Re.2005 serie 0 — скороподъемность самолёта изменена до значений серийных машин (6000 метров за 6 минут и 30 секунд). Время выполнения устоявшегося виража на высоте 1000 м увеличено на 1 секунду (WEP — 19 с, 100% — 20 c). Боевой рейтинг снижен до 5.0."
]}
{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения флота"}
{t="emphasis" v="Вооружение:"}
{t="bullets" v = [
"HMS Southampton — убраны снаряды первой очереди для орудий ГК."
"SGB 309 — исправлено максимальное количество 40-мм боеприпасов в бою."
"HMS Kent (54) — исправлены углы наведения у 102-мм орудий."
"28mm Mk.1 Chicago piano — исправлена дистанция самоликвидации ОФ снаряда."
"37-мм/67 автоматическое орудие 70-К — скорострельность повышена до теоретической и составляет теперь 180 выстрелов в минуту."
]}
{t="bullets" v = [
{t="vertical" v = [
"Исправлены ТТХ снарядов (вес и количество ВВ) 25-мм/60 автоматического орудия Type 96:"
{t="bullets" v = [
"25-мм ОФ: 250 г, 17 г тетрила;"
"25-мм ОФ-Т (с самоликвидатором): 243 г, 8,5 г ТНТ;"
"25-мм ОФ-З: 255 г, 5,52 г ТНТ;"
"25-мм БТ: 283 г."
]}
]}
{t="vertical" v = [
"Уточнены дистанции открытия огня автопушек ИИ-стрелками в зависимости от калибра вооружения:"
{t="bullets" v = [
"7 мм — 1000 м;"
"12,7 мм — 2000 м;"
"20-25 мм — 3500 м;"
"30 мм — 4000 м;"
"40 мм — 5000 м."
]}
]}
"Тротиловый эквивалент взрывчатого вещества Лиддит исправлен на 110%."
{t="vertical" v = [
"Jaguar-Klasse (140), Köln F220 — заменены снаряды для 40-мм/70 установки MEL58:"
{t="bullets" v = [
"удалены бронебойные и осколочно-фугасные снаряды;"
"добавлен осколочно-фугасный трассирующий снаряд M-DN51;"
"добавлен осколочно-фугасный трассирующий снаряд с радиовзрывателем;"
"игровая валюта и опыт за уже изученные удалённые модификаций возвращены на аккаунты игроков."
"40-мм орудие Bofors Flak 28 — английский ОФ снаряд заменён на немецкий 40-мм ОФ-Т Sprgr. Patr."
"283-мм Spgr L/4,4 Bdz ПБ — скорректировано бронепробитие."
"152-мм ОФ-РВ снаряд HMS Belfast — исправлена работа радиовзрывателя, ранее срабатывающего на неправильной дистанции."
"IJN Tone — скорректированы углы горизонтального наведения установок ПМК"
"Leipzig — откорректирована точность стрельбы 37мм артиллерии."
"HMS York (90), Nürnberg — решена проблема с некорректным вращением 20мм орудий на башне главного калибра."
"Тип 4 Модель 4 — исправлено отображение глубинных бомб."
]}
]}
]}
{t="emphasis" v="Модификации и навыки экипажа:"}
{t="bullets" v = [
"Тип 1924 Jaguar — исправлена ошибка, из-за которой модификация скорости наведения вспомогательной артиллерии называлась зенитной."
]}
{t="emphasis" v="ТТХ, физика и модель повреждений флота"}
{t="bullets" v = [
"Разлом корпуса — пересмотрены параметры разлома корпуса корабля, его могут осуществить снаряды с достаточной силой взрыва. Таким образом, для самых малых катеров становятся опасными попадания ОФ снарядов калибром от 100 мм и больше. Параметры разлома корпуса напрямую зависят от размеров катера, поэтому, чем больше корпус, тем больший нужен снаряд для его разлома. Отметим также, что наиболее слабые 100-мм ОФ снаряды могут с этим не справиться."
"USS Helena (CL-50) — численность экипажа увеличена с 868 до 1188 человек."
"Осколки — исправлена модель повреждения осколками. Переработаны диаграммы разлёта осколков всех корабельных снарядов, пересмотрен расчёт бронепробития, урона и радиуса поражения осколков в сторону большего реализма. Исправлено общее количество осколков, которое может дать один снаряд."
"ОФ снаряды — исправлена ошибка, при которой ОФ снарядом было возможно взорвать погреб БК у почти любого неповреждённого корабля. Воздействие фугасного снаряда на корабль переработано в сторону большего реализма. Зажигательное свойство ОФ снарядов увеличено, также скорректирован их осколочный урон."
"Конструкция корабля — в связи с вышеописанным были внесены изменения в характеристики конструкции кораблей. Толщины небронированных бортов, надстроек, переборок и внутренних перегородок исправлены таким образом, чтобы взрывы и осколки взаимодействовали с ними корректно, т.е. пробивали в соответствии со своей поражающей силой и наносили адекватный урон."
"Красный Крым, Красный Кавказ — исправлена ошибка, из-за которой все оснащённые щитами или башнями установки могли быть повреждены фугасами, не имеющими достаточного бронепробития."
"IJN Mogami, IJN Suzuya, IJN Mikuma — скорости наведения 25-мм установок с электродвигателями исправлены на 12-18 градусов в секунду."
"USS Atlanta — исправлена ошибка, из-за которой у бортовых башен ГК отсутствовало бронирование."
"HMS Kent (54) и HMS London (69) — добавлено бронирование рулевого механизма."
"IJN Ayanami — экипаж увеличен до 221 человека."
"USS Brooklyn (CL-40) — добавлены бронированные маски орудий главного калибра."
"IJN Mogami, IJN Suzuya, IJN Mikuma — кораблям добавлены небронированные переборки внутренних булей."
"Admiral Hipper — детализирован главный бронепояс."
"МБК пр. 186 — бронирование башен ГК теперь соответствует аналогичной на Т-34-85."
"USS Phelps (DD-360) — уточнена модель повреждения счетверенных зенитных орудий Bofors."
"IJN Kako — полностью переработана броня корабля, на основе новых исторических данных."
"USS Portland (CA-33) — корпусу корабля назначен новый материал 19мм брони, изменена толщина брони главного бронепояса, изменена модель верхней боковой брони."
"IJN Furutaka — уточнена толщина бронепалубы."
"Isuzu — скорректирован масштаб модели повреждения дымовой трубы."
"VS-10 — скорректирован масштаб модели повреждения водоотливных помп."
"Type T-14 (Mod. 01) — скорректирован масштаб модели повреждения водоотливных помп."
"МБК-161 (1943), МБК-161 (1944), МБК пр. 186, МБК пр. 186 (МК 85), Пр.191М, Пр.191 — уточнено расположение отсеков, отделены фальшборты."
"Пр. 1204 Поздний — исправлен размер элементов бронирования, несоответствующий визуальной части."
"HMS Belfast — уточнено размещение погребов снарядов."
"PGH-2, PG 02 — изменена физика поведения кораблей на воде на подводных крыльях."
"HMS Tiger — добавлена РЛС."
]}

{t="emphasis" v="Модели кораблей, визуальная часть"}
{t="bullets" v = [
"Для орудий крупного калибра добавлена анимация автоматического выброса гильз, если она была реализована в турели на историческом прототипе: Albatros-Klasse (143), Köln F220, Chikugo, Ikazuchi, HMS Tiger, Asheville (PGM-84), USS Brooklyn (CL-40), USS Helena (CL-50), USS Atlanta (CL-51), USS Pensacola (CA-24), USS Portland (CA-33), USS Phelps (DD-360), Porter (DD-356), Bennion (DD-662), Cowell (DD-547), Fletcher (DD-445), Somers (DD-381), Sumner (DD-692), Чапаев, Свердлов, Пр. 41 Неустрашимый, Пр. 56 Спокойный, Пр. 35, Пр. 159."
"Ikazuchi — улучшена текстура корабля."
"Köln F220 — улучшена текстура корабля."
"HMS Kent (54) — исправлено отображение погребов боезапаса при наведении курсора. Исправлено отображение текстуры торпед."
"HMS London (69) — исправлена ошибка, из-за которой различные элементы 102-мм орудия и его экипажа могли вращаться отдельно друг от друга. Также исправлено отображение торпед в торпедных аппаратах."
"MPK Pr.122bis, MPK-163, MPK pr. 122A — исправлена ошибка, из-за которой различные элементы орудий и их экипажа могли вращаться отдельно друг от друга."
"SGB (S309) — исправлена рентген-модель."
"Ya-5M и G-5 TKA 106 — исправлено отображение материалов на ракетной установке."
"Prinz Eugen — исправлены ошибки анимации флага."
"HMS London (69) — исправлена ошибка лодирования с висящими в воздухе объектами возле корабля."
"Albatros-Klasse (143) — поправлена ось вращения радара. "
"МО-4 — исправлено неверное положение рук комендора, уточнена ось вертикального наведения 12.7мм пулемета ДШК в рентгене."
"Elco 80 ft PT-556 — исправлено неверное положение ступней стрелка на носу катера во время горизонтального наведения."
"Класс Isles (T-285) — исправлена ошибка лодирования трубы."
"Пр. 41 Неустрашимый — исправлено несоответствие между визуальным видом торпед и рентгеном во втором торпедном аппарате."
"Köln F220 — рентген модель глубинных бомб выставлена в соответствии с визуальной моделью."
"Albatros-Klasse (143) — улучшена анимация отката ствола при выстреле."
]}
{t="h2" v="Внешний вид и достижения"}
{t="bullets" v = [
"Для Китая и Швеции добавлены декораторы «Шлем». Их можно получить, выполняя задания, или купить за Золотые орлы."
"Добавлены достижения для флота Италии."
"Добавлены декали для авиации и наземной техники Швеции. Их можно получить, выполняя задания, или купить за Золотые орлы."
"Добавлены иконки игрока для экипажей Швеции с возможностью получения за выполнение заданий."
]}
{t="sep"}
{t="h2" v="Интерфейс"}
{t="bullets" v = [
"Переработано меню подвесного вооружения авиации."
"В подсказке для большинства ракет «воздух — воздух» исправлена максимальная скорость."
"В главном меню в разделе «Помощь» теперь можно посмотреть историю обновлений."
{t="vertical" v = [
"Для Windows и Mac OS:"
{t="bullets" v = [
"При активном «Многофункциональном меню» стало доступно полное управление техникой."
"Во «Многофункциональном меню» пункты, неприменимые к текущей модели техники игрока, теперь отображаются недоступными (т.е. серыми)."
]}
]}
]}
{t="sep"}
{t="h2" v="Игровая механика"}
{t="bullets" v = [
"Добавлена новая игровая механика — целеуказание внутри отряда. Вы можете указать точку на местности для членов своего отряда через вид от третьего лица, прицел или бинокль. Это целеуказание также будет продублировано на миникарте. Производить целеуказание можно при игре на наземной или воздушной технике. Для использования целеуказания необходимо назначить соответствующую клавишу в настройках «Управление → Общее». Точка целеуказания отображается у членов вашего отряда с небольшой случайной погрешностью, зависящей от расстояния до точки. Максимальная величина ошибки составляет 15 м."
"Добавлена возможность отстрела ЛТЦ периодами, с возможностью настройки для одного периода количества отстреливаемых ЛТЦ, длительности отстрела ЛТЦ в одном периоде и перерывов между периодами."
"Добавлена возможность включать и отключать отстрел ЛТЦ в режиме БКО (бортового комплекса обороны)."
"В Авиационных реалистичных боях добавлена новая механика для поиска последнего противника, которая активируется спустя 15 минут после начала миссии в случае, если в одной из команд остался последний игрок. Она подсвечивает для противоположной команды сектор на карте, соответствующий его местоположению. Индикация местонахождения последнего противника обновляется раз в 20 секунд."
"Отключён сброс неуязвимости на точке возрождения при использовании артиллерийского удара."
{t="vertical" v = [
"В Танковых реалистичных боях изменены параметры активной разведки:"
{t="bullets" v = [
"Задержка между удачными использованиями: 10 > 6 секунд."
"Задержка между неудачными использованиями: 60 > 45 секунд."
"Продолжительность подсветки разведанного противника: 30 > 45 секунд."
]}
]}

{t="vertical" v = [
"В Танковых реалистичных боях изменена базовая стоимость возрождения в ОВ для следующей техники:"
{t="bullets" v = [
"OTOMATIC: 220 > 150"
"ADATS: 220 > 130"
"WZ305: 110 > 150"
"M24 Chaffee (все варианты и страны): 90 > 110"
"ПТ-76Б: 90 > 110"
"БМП-3: 150 > 110"
"Объект 685: 150 > 110"
"Type 89: 150 > 110"
"PT-76 (Китай): 150 > 110"
"Type 63-I: 150 > 110"
"Type 62: 150 > 110"
"ZBD86: 150 > 110"
"AMX-13 (FL11): 150 > 110"
"Ikv 91: 150 > 110"
"Strf 90C: 150 > 110"
"CV90120: 150 > 110"
"Strv 74: 150 > 110"
"CV90105 TML: 150 > 110"
"Strv m/31: 150 > 80"
"Strv m/38: 150 > 80"
"Ho.229 V3: 750 > 600"
]}
]}
]}

{t="sep"}
{t="h2" v="Примеры ошибок, исправленных по баг-репортам игроков"}
"В этом списке представлены примеры исправлений, сделанных благодаря правильно оформленным багрепортам игроков. Спасибо за то, что делаете War Thunder лучше!"

{t="bullets" v = [
"Исправлено зацикливание звука перезарядки ракеты на Begleitpanzer 57."
"Исправлено расхождение в нескольких показателях Лётно-технических характеристик Ki-100-1 относительно паспорта ЛТХ на официальном форуме."
"Повышена эффективность воздушного тормоза на истребителях Saab: B18A, B18B, T18B-1"
"Исправлена модель бронирования Caernarvon в районе механизма поворота башни."
"Исправлена некорректная дистанция отрисовки наземной техники при обзоре с самолёта на картах Моздок, Джунгли, 38я параллель, Карелия."
"Исправлена толщина брони за маской Strv 101 с 152мм на 139мм согласно Centurion Mk.10 for Sweden, Acceptance of first production vehicle at Messrs. Vickers-Amstrongs, Ltd., Newcastle, November 1959."
"Исправлена модель бронирования люка для вывода стрелянных гильз C1 Ariete, которая не генерировала сопутствующие осколки при пробитии."
"Убрано зенитное орудие с взлётно-посадочной полосы Финляндии."
"Исправлена толщина лобовой брони Nb.Fz. с 13мм на 20мм согласно Tanks of the Second World War. P 61. Panzer Tracts No.4."
"Исправлены параметры самоликвидации 28мм снаряда на Somers (DD-381), Porter (DD-356), USS Atlanta (CL-51), USS Trenton (CL-11)."
"Исправлена скоростроельность советского флотского 37мм орудия 70-К  согласно внутренней документации."
"Угол наклона бронепояса IJN Tone приведён к 20 градусам."

]}

{t="sep" platform="ps4"}
{t="h2" v="Изменения для версии игры на PlayStation®4" platform="ps4"}
{t="bullets" v = [
"Добавлена первичная поддержка жестов: в настройках управления можно назначить жесты «смахнуть вверх/вниз/влево/вправо» и «касание сенсорной панели» на действия в бою."
"Тап по сенсорной панели более не дублируется как левая кнопка мыши (т.е. это отдельное независимое действие). Для активации объектов в меню используется двойной тап по сенсорной панели."
"Добавлена возможность приближения в ангаре с помощью жеста «щипок» (“pinch to zoom”)."
"В общие настройки управления добавлен переключатель «Использовать сенсорную панель для прицеливания», который возвращает старый режим работы сенсорной панели и отключает распознавание «смахиваний»."
"Добавлена опция «Игра с другими платформами», при выключении которой матчмейкинг будет ограничен только игроками на PlayStation®4."
"Добавлена опция отключения кроссплатформенного общения. Пользователи, выбравшие данную опцию, будут видеть текстовые сообщения только от других пользователей PlayStation®4. Внутриигровой голосовой чат будет отключен — такие игроки могут использовать функционал «Тусовки» PlayStation®4."
"Игроки PlayStation®4, привязавшие e-mail к своему аккаунту, больше не могут тратить Золотые орлы в PC-версии игры. Премиум-аккаунт, входящий в состав наборов в PlayStation Store, также не переносится в PC-версию. Однако Премиум-аккаунт, приобретённый внутри игры, а также все другие покупки за Золотые орлы, сделанные в версии для PlayStation®4, переносятся на PC, как и раньше."
"Добавлена опция «Только PlayStation®4 игроки в таблице рекордов»."

] platform="ps4"}

{t="sep" platform="xboxOne"}
{t="h2" v="Изменения для версии игры на Xbox One" platform="xboxOne"}
{t="bullets" v = [
"Игроки на PlayStation®4 и Xbox One теперь могут встретиться в боях."
"Игрокам Xbox One стали доступны режимы «Симуляторные бои» и «Мировая война» (во время действующего сезона)."

] platform="xboxOne"}

{t="sep"}
{t="h2" v="Графика"}
{t="bullets" v = [
"Улучшен механизм отрисовки индикации на ИЛС современных боевых вертолётов. Теперь индикация отображается в соответствии с физическими принципами работы подобных устройств."
]}

{t="sep"}
{t="h2" v="Звук"}
{t="bullets" v = [
"Созданы новые звуковые события для всех пулемётов наземной и морской техники. Изменен принцип формирования звука стрельбы очередями, теперь это последовательность одиночных выстрелов, тогда как ранее это был пререндер очереди целиком."
"Внесены изменения в звуковые события двигателей наземной техники в сторону большей целостности звучания и увеличения динамики."
"Добавлен аутентичный звук для двигателей и траков линейки танков Т-34."
"Добавлен аутентичный звук для двигателей и траков линейки танков Т-72."
"Ударная волна от пролёта сверхзвукового самолёта теперь звучит более явно, ранее она недостаточно выделялась среди других звуковых событий двигателя."
"Создано новое звуковое событие для подвески колесной техники."
"Реализована динамическая система звука трения колёс/траков наземной техники о поверхность в зависимости от её типа (грязь, песок, снег, бетон, вода)."
"Получили новое звуковое оформление авиационные пушки M61, M61A1 и JM61A1."
]}
{t="sep"}
{t="h2" v="Управление"}
{t="bullets" v = [
"Из раздела «Настройки геймпада» удалена настройка «Скорость управления курсором», как нефункциональная (опция некоторое время не имела никакого эффекта, но оставалась видимой в интерфейсе)."
"Переключатель «Сглаживание мыши» перенесён из раздела «Самолёт» в раздел «Общее управления», поскольку влияет на все виды техники."
"Исправлена ошибка, из-за которой при загрузке ранее сохранённого пресета всегда выбирался режим управления “Прицеливание мышью”."
]}
{t="sep"}
{t="h2" v="Другое"}
{t="bullets" v = [
"Игроки на PlayStation®4 и XBox One теперь могут встретиться в боях."
]}
]
