return [
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}

{t="bullets" v = [
"Для ЗРК реализовано обнаружение, захват и сопровождение авиационных средств поражения. Теперь ЗРК может обнаруживать, захватывать и обстреливать атакующие их ракеты или бомбы. Также на индикаторе отображаются собственные пущенные ракеты."
"Максимальная дальность замера для всех лазерных дальномеров увеличена до 9999 м."
"Увеличена дальность шкал прицела по умолчанию для всей наземной техники. Максимальная дальность нарезки шкал составляет теперь 6000 м."
"Для следующих машин добавлена модификация Ostketten («Восточные гусеницы»), меняющая тип установленных гусениц со стандартных на специальные с увеличенной шириной: Jagdpanzer IV, Nashorn, Panzer IV/70(V), Pz.IV Ausf.E, Pz.IV Ausf.F, Pz.IV Ausf.F2, Pz.IV Ausf.G, Pz.IV Ausf.H, Pz.IV Ausf.J, StuG.III Ausf.F, StuG.III Ausf.G, StuH.III Ausf.G. Модификация увеличивает общую подвижность и незначительно увеличивает стойкость гусеницы к урону."
"БМП-3 — время перезарядки ПТУР снижено с 2 до 3 выстрелов в минуту. Источник: Вестник бронетанковой техники, 1991, Комплекс вооружения БМП-3."
"Т-10М — скорострельность орудия увеличена с 3,9 до 4 выстрелов в минуту. Источник: Руководство по материальной части и эксплуатации танка Т-10М, 1960."
"Объект 268 — начальная скорость бронебойного снаряда БР-540Б увеличена с 750 до 760 м/с. Источник: Отечественные бронированные машины. XX век. Том 3. 1946-1965, Солянкин А.Г, Желтов И.Г., Кудряшов К.Н."
"БМП-1, Spz BMP-1, Type 86 — угол склонения орудия снижен с -5° до -4°. Источник: Боевая Машина Пехоты БМП-1 Техническое описание и инструкция по эксплуатации."
"Type 60 SPRG — добавлена механика разрушения корпуса."
"Type 89 — размер боекомплекта для пулемёта снижен с 2000 до 1000 патронов."
"Type 61 — размер боекомплекта снижен с 4900 до 4000 патронов для 7,62-мм пулемёта, и с 2175 до 500 — для пулемёта 12,7 мм."
"Type 74, Type 74G — размер боекомплекта снижен с 5500 до 4500 патронов для 7,62-мм пулемёта, и с 1000 до 600 — для пулемёта 12,7 мм."
"Leopard 2A5, Strv 122 — исправлен пресет тепловизионного оборудования.Теперь наводчик использует тепловизор первого поколения, а командир — второго. Ранее оба использовали тепловизоры второго поколения. Источник: 12 cm kanon strv 121/122. Skjuttabeller. // PRZEGLĄD SIŁ ZBROJNYCH nr 6/ 2014 // Vehicle Optronics, HENSOLDT brochure."
"Pz.V Ausf.D/A/G/F, Panther II, T-V, Ersatz-M10, Tiger H1, Tiger E, Heavy Tank No.6, M4A3E2, M4A3E2 Kobra King, M4A3E2 76 (W) — уточнено бронирование орудийных масок. Бронирование масок переведено в объемную броню."
"M1A2 — исправлен пресет поколения тепловизионного оборудования. Ранее ошибочного использовался пресет второго поколения, теперь он заменён на первое поколение. Источник: Center for Night Vision and Electro-Optic, Common Modules, A Success Story, June 1988, AD-A195 937 // The M1A2: Current and Future Program Plans, 1997."
"КВ-1С — масса танка увеличена с 41400 до 42500 кг. Источник: Инструкция по эксплуатации танка КВ-1С, издание завода, 1943."
"XM-803, MBT-70 — скорострельность при стрельбе снарядами увеличена с 6 до 8 выстрелов в минуту. Источник: HEARINGS before COMMITTEE ON APPROPRIATIONS, HOUSE OF REPRESENTATIVES, part 5 RESEARCH, DEVELOPMENT, TEST AND EVALUATION December 1969 // ARMOR magazine july-august 1970 // HEARINGS on MILITARY POSTURE AND HR 3818 and HR 8687 July 1977."
"QF Ram AA — материал конструкции корпуса (за исключением элементов, оставшихся от базового шасси) исправлен с катанной гомогенной брони на конструкционную сталь толщиной 19,05 мм. Источник: Canadian Microfilms, Project 14 SP 3.7 on Ram chassis."
"Sd.Kfz.234/1 — уточнено положение камеры для режима СБ."
"Lvkv 42 — добавлен функционал управляемой подвески. Добавлена возможность разворота на нейтральной передаче. Толщина бронирования увеличена с 8 до 10 мм. Источник: Blad nr 39, Upprattat 29/08 1955."
"M3 Bradley — скорость, при которой возможно использование ПТУР, снижена с 11 до 5 км/ч. Угол склонения орудия над МТО ограничен значением -1°. Источник: TECHNICAL MANUAL TM 9-2350-252-10-2."
"Type 90, Type 90B — масса танка снижена с 51600 до 50200 кг. Источник: Japan Defense Agency (August 6, 1990) Format Outline, Type 90 Tank, D9003 // Japan Defense Agency (August 6, 1990) (Modified March 12, 1993) Format Outline, Type 90 Tank (B), D9003B."
"Strv 74 — класс техники изменён со «Среднего танка» на «Лёгкий танк». Добавлен функционал лёгких танков «Разведка», а также модификации «Улучшенная оптика» и «Авиаудар»."
"Chieftain Marksman — добавлена модификация «ПНВ» для мехвода."
"100 мм ОФ-412 (Д-10Т) — начальная скорость увеличена с 880 до 900 м/с. Источник: Наставление по стрельбе из танков. Основы стрельбы из танков. Издание второе, стереотипное. 1984 // 100-мм танковые пушки Д10-Т, Д10-ТГ и Д10-Т2С. Руководство службы. 1971."
"БМП-1, ZBD86, SPz BMP-1 — значение оборотов двигателя уменьшено с 2880 до 2600. Источник: БМП-1 — Техническое описание и инструкция по эксплуатации. 1979."
"T29, T30, T34 — добавлена механика боеукладки первой очереди."
"T14 (США) — добавлен дымовой снаряд M89."
"Ru 251 — тип действия дымовых гранат изменён на мгновенный."
"Stormer HVM — разрешение тепловизионного прицела приведено в соответствие ТВП третьего поколения."
"АСУ-57 — уточнены углы наведения орудия: по вертикали: от -4° до +12° → от -5° до +12°; по горизонтали: ±7° → ±8° Источник: 57-мм самоходные пушки Ч-51М и Ч-51П. Руководство службы. 1956."
]}
{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v = [
"J35D — добавлены ракеты воздух-воздух RB 24J."
"B17A, B17B — исправлены углы наведения оборонительной турели, убрана возможность прострела киля."
"B-17 (все модификации) — угол наведения по вертикали для верхней оборонительной турели исправлен до 85°."
"Swordfish Mk.I — для оборонительной турели исправлены углы наведения по вертикали и горизонтали."
"B17A, B17B, B3C — обозначение лент боекомплекта в окне исследования модификаций исправлено с курсовых на турельные."
"A21RB — добавлен раздельный пуск подвесного ракетного вооружения."
"Hornet Mk.III — в окне исследования модификаций исправлена информация о возможности установки ракет RP-3."
"Як-4 — боекомплект турели увеличен до 1000 выстрелов, угол наведения по вертикали увеличен до 70°."
"Су-2 ТСС-1 — исправлены углы наведения турели: по горизонтали: до ±90°, по вертикали: от -32° до +50° → -30° до +70°."
"B5N2 — исправлены углы наведения турели: по горизонтали: до ±50°, по вертикали: от -40° до +80°."
"P-39Q-5, P-39Q-15 — боекомплект крыльевых пулемётов увеличен до 300 выстрелов."
"P-39N — боекомплект крыльевых пулемётов уменьшен до 300 выстрелов."
"F-100D — запуск AGM-12B Bullpup исправлен на клавишу запуска управляемых ракет «воздух — поверхность» в пресете AGM12b bullpup x2+750lbs m117 cone 45 bomb x4 аналогично пресету AGM12b bullpup x2."
"Ki-100, Ki-100-II — исправлена ошибочная информация об отсутствии протектированных топливных баков."
"Sea Fury FB.11 — модификации 20-мм пушек перераспределены на 1 и 3 уровни исследования модификаций. Добавлены ракеты Triplex R.P. Модификация GRC mk8 перенесена на 3 уровень исследования."
"Avenger Mk.II — добавлены ракеты Uncle Tom."
"Firebrand TF.Mk.IV — модификации 20-мм пушек перераспределены на 1 и 3 уровни исследования модификаций. Добавлены ракеты Uncle Tom. Модификации ракетно-бомбового вооружения перераспределены с 1 по 4 уровни исследования."
"Mosquito FB.Mk.VI — модификации 7-мм пулемётов перераспределены на 1 и 3 уровни исследования модификаций. Добавлены ракеты Uncle Tom."
"P-51K (Китай) — исправлена ошибка, из-за которой самолёт появлялся на авианосцах."
"S.O.4050 Vautour IIA — ракеты T10 121 в некоторых пресетах исправлены на T10 140."
"SA.341F Gazelle — исправлены ошибка, из-за которой запускалось по две ракеты Mighty Mouse за раз."
"UH-1C — исправлено визуальное отображение дополнительного 40-мм гранатомёта, а также его визуализация в режиме рентгена."
"BO 105 CB-2 — в прицел стрелка добавлен режим ночного видения."
"H-34 — боекомплект пушечного контейнера Mk 4 Mod 0 увеличен до 750 выстрелов."
"AH-64A, AH-64A Peten — УРВВ AIM-92 Stinger перенесены на законцовки крыла, вместо них на пилоны добавлены различные типы подвесного вооружения."
"BGM-71 TOW, BGM-71 TOW-2 — минимальная дальность пуска исправлена с 30 до 65 метров."
"Торпеда Mk.13 — обозначение торпеды исправлено на Mk.13-1, уточнены её вес и дальность хода."
"Торпеда Mk.XII — уточнены вес и дальность хода."
"210-мм ракеты Wrf.Gr.21 — исправлена ошибка, из-за которой самоликвидатор ракеты на расстояниях до 500 метров срабатывал неверно."
"40-мм граната M430 — исправлена ошибка, из-за которой попадание данной гранаты вызывало разрушение корпуса у ряда моделей наземной техники."
"13-мм пулемёт Type 2 — скорострельность увеличена до 936 выстрелов в минуту."
"20-мм пушка Ho-5 — скорострельность увеличена до 950 выстрелов в минуту."
"Пушечный контейнер Mk 4 Mod 0 — скорострельность уменьшена до 4000 выстрелов в минуту, добавлен дополнительный режим стрельбы со скорострельностью в 700 выстрелов в минуту. Исправлены характеристики боеприпасов."
"37-мм пушка Ho-203 — скорострельность увеличена до 300 выстрелов в минуту."
"30-мм пушка DEFA 552 — вес пушки скорректирован до 81 кг."
"Исправлена точка прицеливания ракет, самонаводящихся на самолёты и вертолёты. теперь она всегда находится в середине фюзеляжа. Раньше она могла располагаться чуть выше, из-за чего не оснащённые неконтактным взрывателем ракеты «воздух-воздух» (например, AIM-92 «Стингер») часто промахивались."
"Переработан автопилот и работа рулевых поверхностей всех самонаводящихся ракет (УРВВ, самонаводящиеся ПТУРы). Ракеты стали управляться более точно, без лишний метаний из стороны в сторону, а также стали точнее выдерживать заданную перегрузку на всех скоростях полёта."
"Исправлено отображение макс. скорости и перегрузки в карточках ракет Р-60/Р-60М и AIM-9L. Максимальная скорость ракет дана для большей скорости пуска (M=1.0). В качестве максимальной перегрузки теперь указана предельно достижимая на больших скоростях (M=2.0 и выше), а не средняя за время управляемого полёта до цели при пуске сзади на скорости M=1.0 при скорости цели M=1.0 на уровне моря на предельную дальность. Для других ракет эти перегрузки численно совпадают."
"Исправлена ошибка, из-за которой в карточке ПТУР могла отображаться не вся информация."
]}

{t="sep"}
{t="h2" v="Изменения в лётных моделях"}
{t="bullets" v = [
"A-4B — исправлена ошибка, из-за которой в карточке самолёта были указаны неверные значения максимальной скорости и скороподъемности."
"Ки-44 (вся линейка) — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции."
"Me-163 (вся линейка), J8M1 – исправлена ошибка, приводящая к сносу самолёта при выпуске посадочной лыжи. Исправлена ошибка, из-за которой замедлялся разгон на разбеге при взлёте с использованием опорной тележки (разгон стал быстрее)."
"Arado-234 B-2 — исправлена ошибка, из-за которой взлёт самолёта с полной загрузкой вызывал трудности. Добавлены реактивные ускорители для облегчения взлёта."
"F1M2 — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Улучшена мореходность."
"SAAB A21-RB — исправлена ошибка, приводящая к повышенному паразитному сопротивлению пусковой установки ракет."
"A6M2-N — улучшена мореходность. Улучшена управляемость на воде при взлёте и посадке."
"И-15 (вся линейка) — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Самолётам И-15 М-22 и И-15К добавлен взлётный режим (WEP) и модуль «Впрыск». Подробные характеристики можно узнать из паспорта самолётов на форуме игры."
"Ta-152-H — добавлено ограничение на выпуск закрылков во взлётное положение согласно паспорту. Уменьшена инерция винтомоторной установки (остановка/раскрутка пропеллёра). Ускорен набор высоты на длительном режиме двигателя в 90% тяги. Увеличена эффективность тормозов, что требует более аккуратного их использования на взлёте и посадке. Значительно уменьшена эффективность элеронов на предельно малых (менее 140 км/ч) скоростях."
"Firefly Mk.5 — уменьшен максимальный объём топлива."
"F-4C — добавлен баллистический вычислитель для применения пушки, НУРСов и бомб по наземным целям."
"F-4EJ — увеличена максимальная скорость на средних высотах, исправлена анимация носка крыла."
"F-4E/EJ, Phantom FGR.2 — добавлен режим навигационного бомбометания по произвольно выбранной точке на земле или по базам противника."
"Ki-61 (вся линейка), Ki-100 (вся линейка), Ki-96, Ki-102 — полностью обновлена лётная модель согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам."
"Ил-2 с двигателями АМ-38Ф (вся линейка) — исправлена ошибка в термодинамике, из-за которой было возможно использовать форсажный режим (WEP) без ограничений."
"Ил-2 (вся линейка) — изменена работа посадочных щитков. Теперь щитки не могут быть выпущены на скоростях выше 260 км/ч по прибору (IAS). Со снижением скорости ниже 245 км/ч по прибору (IAS) щитки отклоняются на положенные углы полностью."
"Hunter (вся линейка) — исправлена ошибка, из-за которой было возможно использовать воздушный тормоз при выпущенных шасси. Теперь в случае выпуска шасси при включённом воздушном тормозе тормоз автоматически убирается, а выпуск тормоза при выпущенных шасси более невозможен."
"P-51 (вся линейка) — скорректировано освещение приборной панели при ночном полёте."
"Re.2005 serie 0 — скороподъемность самолёта изменена до значений серийных машин (6000 метров за 6 минут и 30 секунд). Время выполнения устоявшегося виража на высоте 1000 м увеличено на 1 секунду (WEP — 19 с, 100% — 20 c). Боевой рейтинг снижен до 5.0."
]}
{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения флота"}
{t="emphasis" v="Вооружение:"}
{t="bullets" v = [
"HMS Southampton — убраны снаряды первой очереди для орудий ГК."
"SGB 309 — исправлено максимальное количество 40-мм боеприпасов в бою."
"HMS Kent (54) — исправлены углы наведения у 102-мм орудий."
"28mm Mk.1 Chicago piano — исправлена дистанция самоликвидации ОФ снаряда."
"37-мм/67 автоматическое орудие 70-К — скорострельность повышена до теоретической и составляет теперь 180 выстрелов в минуту."
]}
{t="bullets" v = [
{t="vertical" v = [
"Исправлены ТТХ снарядов (вес и количество ВВ) 25-мм/60 автоматического орудия Type 96:"
{t="bullets" v = [
"25-мм ОФ: 250 г, 17 г тетрила;"
"25-мм ОФ-Т (с самоликвидатором): 243 г, 8,5 г ТНТ;"
"25-мм ОФ-З: 255 г, 5,52 г ТНТ;"
"25-мм БТ: 283 г."
]}
]}
{t="vertical" v = [
"Уточнены дистанции открытия огня автопушек ИИ-стрелками в зависимости от калибра вооружения:"
{t="bullets" v = [
"7 мм — 1000 м;"
"12,7 мм — 2000 м;"
"20-25 мм — 3500 м;"
"30 мм — 4000 м;"
"40 мм — 5000 м."
]}
]}
"Тротиловый эквивалент взрывчатого вещества Лиддит исправлен на 110%."
{t="vertical" v = [
"Jaguar-Klasse (140), Köln F220 — заменены снаряды для 40-мм/70 установки MEL58:"
{t="bullets" v = [
"удалены бронебойные и осколочно-фугасные снаряды;"
"добавлен осколочно-фугасный трассирующий снаряд M-DN51;"
"добавлен осколочно-фугасный трассирующий снаряд с радиовзрывателем;"
"игровая валюта и опыт за уже изученные удалённые модификаций возвращены на аккаунты игроков."
"40-мм орудие Bofors Flak 28 — английский ОФ снаряд заменён на немецкий 40-мм ОФ-Т Sprgr. Patr."
"283-мм Spgr L/4,4 Bdz ПБ — скорректировано бронепробитие."
"152-мм ОФ-РВ снаряд HMS Belfast — исправлена работа радиовзрывателя, ранее срабатывающего на неправильной дистанции."
"IJN Tone — скорректированы углы горизонтального наведения установок ПМК"
"Leipzig — откорректирована точность стрельбы 37мм артиллерии."
"HMS York (90), Nürnberg — решена проблема с некорректным вращением 20мм орудий на башне главного калибра."
"Тип 4 Модель 4 — исправлено отображение глубинных бомб."
]}
]}
]}
{t="emphasis" v="Модификации и навыки экипажа:"}
{t="bullets" v = [
"Тип 1924 Jaguar — исправлена ошибка, из-за которой модификация скорости наведения вспомогательной артиллерии называлась зенитной."
]}
{t="emphasis" v="ТТХ, физика и модель повреждений флота"}
{t="bullets" v = [
"Разлом корпуса — пересмотрены параметры разлома корпуса корабля, его могут осуществить снаряды с достаточной силой взрыва. Таким образом, для самых малых катеров становятся опасными попадания ОФ снарядов калибром от 100 мм и больше. Параметры разлома корпуса напрямую зависят от размеров катера, поэтому, чем больше корпус, тем больший нужен снаряд для его разлома. Отметим также, что наиболее слабые 100-мм ОФ снаряды могут с этим не справиться."
"USS Helena (CL-50) — численность экипажа увеличена с 868 до 1188 человек."
"Осколки — исправлена модель повреждения осколками. Переработаны диаграммы разлёта осколков всех корабельных снарядов, пересмотрен расчёт бронепробития, урона и радиуса поражения осколков в сторону большего реализма. Исправлено общее количество осколков, которое может дать один снаряд."
"ОФ снаряды — исправлена ошибка, при которой ОФ снарядом было возможно взорвать погреб БК у почти любого неповреждённого корабля. Воздействие фугасного снаряда на корабль переработано в сторону большего реализма. Зажигательное свойство ОФ снарядов увеличено, также скорректирован их осколочный урон."
"Конструкция корабля — в связи с вышеописанным были внесены изменения в характеристики конструкции кораблей. Толщины небронированных бортов, надстроек, переборок и внутренних перегородок исправлены таким образом, чтобы взрывы и осколки взаимодействовали с ними корректно, т.е. пробивали в соответствии со своей поражающей силой и наносили адекватный урон."
"Красный Крым, Красный Кавказ — исправлена ошибка, из-за которой все оснащённые щитами или башнями установки могли быть повреждены фугасами, не имеющими достаточного бронепробития."
"IJN Mogami, IJN Suzuya, IJN Mikuma — скорости наведения 25-мм установок с электродвигателями исправлены на 12-18 градусов в секунду."
"USS Atlanta — исправлена ошибка, из-за которой у бортовых башен ГК отсутствовало бронирование."
"HMS Kent (54) и HMS London (69) — добавлено бронирование рулевого механизма."
"IJN Ayanami — экипаж увеличен до 221 человека."
"USS Brooklyn (CL-40) — добавлены бронированные маски орудий главного калибра."
"IJN Mogami, IJN Suzuya, IJN Mikuma — кораблям добавлены небронированные переборки внутренних булей."
"Admiral Hipper — детализирован главный бронепояс."
"МБК пр. 186 — бронирование башен ГК теперь соответствует аналогичной на Т-34-85."
"USS Phelps (DD-360) — уточнена модель повреждения счетверенных зенитных орудий Bofors."
"IJN Kako — полностью переработана броня корабля, на основе новых исторических данных."
"USS Portland (CA-33) — корпусу корабля назначен новый материал 19мм брони, изменена толщина брони главного бронепояса, изменена модель верхней боковой брони."
"IJN Furutaka — уточнена толщина бронепалубы."
"Isuzu — скорректирован масштаб модели повреждения дымовой трубы."
"VS-10 — скорректирован масштаб модели повреждения водоотливных помп."
"Type T-14 (Mod. 01) — скорректирован масштаб модели повреждения водоотливных помп."
"МБК-161 (1943), МБК-161 (1944), МБК пр. 186, МБК пр. 186 (МК 85), Пр.191М, Пр.191 — уточнено расположение отсеков, отделены фальшборты."
"Пр. 1204 Поздний — исправлен размер элементов бронирования, несоответствующий визуальной части."
"HMS Belfast — уточнено размещение погребов снарядов."
"PGH-2, PG 02 — изменена физика поведения кораблей на воде на подводных крыльях."
"HMS Tiger — добавлена РЛС."
]}

{t="emphasis" v="Модели кораблей, визуальная часть"}
{t="bullets" v = [
"Для орудий крупного калибра добавлена анимация автоматического выброса гильз, если она была реализована в турели на историческом прототипе: Albatros-Klasse (143), Köln F220, Chikugo, Ikazuchi, HMS Tiger, Asheville (PGM-84), USS Brooklyn (CL-40), USS Helena (CL-50), USS Atlanta (CL-51), USS Pensacola (CA-24), USS Portland (CA-33), USS Phelps (DD-360), Porter (DD-356), Bennion (DD-662), Cowell (DD-547), Fletcher (DD-445), Somers (DD-381), Sumner (DD-692), Чапаев, Свердлов, Пр. 41 Неустрашимый, Пр. 56 Спокойный, Пр. 35, Пр. 159."
"Ikazuchi — улучшена текстура корабля."
"Köln F220 — улучшена текстура корабля."
"HMS Kent (54) — исправлено отображение погребов боезапаса при наведении курсора. Исправлено отображение текстуры торпед."
"HMS London (69) — исправлена ошибка, из-за которой различные элементы 102-мм орудия и его экипажа могли вращаться отдельно друг от друга. Также исправлено отображение торпед в торпедных аппаратах."
"MPK Pr.122bis, MPK-163, MPK pr. 122A — исправлена ошибка, из-за которой различные элементы орудий и их экипажа могли вращаться отдельно друг от друга."
"SGB (S309) — исправлена рентген-модель."
"Ya-5M и G-5 TKA 106 — исправлено отображение материалов на ракетной установке."
"Prinz Eugen — исправлены ошибки анимации флага."
"HMS London (69) — исправлена ошибка лодирования с висящими в воздухе объектами возле корабля."
"Albatros-Klasse (143) — поправлена ось вращения радара. "
"МО-4 — исправлено неверное положение рук комендора, уточнена ось вертикального наведения 12.7мм пулемета ДШК в рентгене."
"Elco 80 ft PT-556 — исправлено неверное положение ступней стрелка на носу катера во время горизонтального наведения."
"Класс Isles (T-285) — исправлена ошибка лодирования трубы."
"Пр. 41 Неустрашимый — исправлено несоответствие между визуальным видом торпед и рентгеном во втором торпедном аппарате."
"Köln F220 — рентген модель глубинных бомб выставлена в соответствии с визуальной моделью."
"Albatros-Klasse (143) — улучшена анимация отката ствола при выстреле."
]}
]
