return [
{t="h2" v="Внешний вид и достижения"}
{t="bullets" v = [
"Для Китая и Швеции добавлены декораторы «Шлем». Их можно получить, выполняя задания, или купить за Золотые орлы."
"Добавлены достижения для флота Италии."
"Добавлены декали для авиации и наземной техники Швеции. Их можно получить, выполняя задания, или купить за Золотые орлы."
"Добавлены иконки игрока для экипажей Швеции с возможностью получения за выполнение заданий."
]}
{t="sep"}
{t="h2" v="Интерфейс"}
{t="bullets" v = [
"Переработано меню подвесного вооружения авиации."
"В подсказке для большинства ракет «воздух — воздух» исправлена максимальная скорость."
"В главном меню в разделе «Помощь» теперь можно посмотреть историю обновлений."
{t="vertical" v = [
"Для Windows и Mac OS:"
{t="bullets" v = [
"При активном «Многофункциональном меню» стало доступно полное управление техникой."
"Во «Многофункциональном меню» пункты, неприменимые к текущей модели техники игрока, теперь отображаются недоступными (т.е. серыми)."
]}
]}
]}
{t="sep"}
{t="h2" v="Игровая механика"}
{t="bullets" v = [
"Добавлена новая игровая механика — целеуказание внутри отряда. Вы можете указать точку на местности для членов своего отряда через вид от третьего лица, прицел или бинокль. Это целеуказание также будет продублировано на миникарте. Производить целеуказание можно при игре на наземной или воздушной технике. Для использования целеуказания необходимо назначить соответствующую клавишу в настройках «Управление → Общее». Точка целеуказания отображается у членов вашего отряда с небольшой случайной погрешностью, зависящей от расстояния до точки. Максимальная величина ошибки составляет 15 м."
"Добавлена возможность отстрела ЛТЦ периодами, с возможностью настройки для одного периода количества отстреливаемых ЛТЦ, длительности отстрела ЛТЦ в одном периоде и перерывов между периодами."
"Добавлена возможность включать и отключать отстрел ЛТЦ в режиме БКО (бортового комплекса обороны)."
"В Авиационных реалистичных боях добавлена новая механика для поиска последнего противника, которая активируется спустя 15 минут после начала миссии в случае, если в одной из команд остался последний игрок. Она подсвечивает для противоположной команды сектор на карте, соответствующий его местоположению. Индикация местонахождения последнего противника обновляется раз в 20 секунд."
"Отключён сброс неуязвимости на точке возрождения при использовании артиллерийского удара."
{t="vertical" v = [
"В Танковых реалистичных боях изменены параметры активной разведки:"
{t="bullets" v = [
"Задержка между удачными использованиями: 10 > 6 секунд."
"Задержка между неудачными использованиями: 60 > 45 секунд."
"Продолжительность подсветки разведанного противника: 30 > 45 секунд."
]}
]}

{t="vertical" v = [
"В Танковых реалистичных боях изменена базовая стоимость возрождения в ОВ для следующей техники:"
{t="bullets" v = [
"OTOMATIC: 220 > 150"
"ADATS: 220 > 130"
"WZ305: 110 > 150"
"M24 Chaffee (все варианты и страны): 90 > 110"
"ПТ-76Б: 90 > 110"
"БМП-3: 150 > 110"
"Объект 685: 150 > 110"
"Type 89: 150 > 110"
"PT-76 (Китай): 150 > 110"
"Type 63-I: 150 > 110"
"Type 62: 150 > 110"
"ZBD86: 150 > 110"
"AMX-13 (FL11): 150 > 110"
"Ikv 91: 150 > 110"
"Strf 90C: 150 > 110"
"CV90120: 150 > 110"
"Strv 74: 150 > 110"
"CV90105 TML: 150 > 110"
"Strv m/31: 150 > 80"
"Strv m/38: 150 > 80"
"Ho.229 V3: 750 > 600"
]}
]}
]}

{t="sep"}
{t="h2" v="Примеры ошибок, исправленных по баг-репортам игроков"}
"В этом списке представлены примеры исправлений, сделанных благодаря правильно оформленным багрепортам игроков. Спасибо за то, что делаете War Thunder лучше!"

{t="bullets" v = [
"Исправлено зацикливание звука перезарядки ракеты на Begleitpanzer 57."
"Исправлено расхождение в нескольких показателях Лётно-технических характеристик Ki-100-1 относительно паспорта ЛТХ на официальном форуме."
"Повышена эффективность воздушного тормоза на истребителях Saab: B18A, B18B, T18B-1"
"Исправлена модель бронирования Caernarvon в районе механизма поворота башни."
"Исправлена некорректная дистанция отрисовки наземной техники при обзоре с самолёта на картах Моздок, Джунгли, 38я параллель, Карелия."
"Исправлена толщина брони за маской Strv 101 с 152мм на 139мм согласно Centurion Mk.10 for Sweden, Acceptance of first production vehicle at Messrs. Vickers-Amstrongs, Ltd., Newcastle, November 1959."
"Исправлена модель бронирования люка для вывода стрелянных гильз C1 Ariete, которая не генерировала сопутствующие осколки при пробитии."
"Убрано зенитное орудие с взлётно-посадочной полосы Финляндии."
"Исправлена толщина лобовой брони Nb.Fz. с 13мм на 20мм согласно Tanks of the Second World War. P 61. Panzer Tracts No.4."
"Исправлены параметры самоликвидации 28мм снаряда на Somers (DD-381), Porter (DD-356), USS Atlanta (CL-51), USS Trenton (CL-11)."
"Исправлена скоростроельность советского флотского 37мм орудия 70-К  согласно внутренней документации."
"Угол наклона бронепояса IJN Tone приведён к 20 градусам."

]}

{t="sep" platform="ps4"}
{t="h2" v="Изменения для версии игры на PlayStation®4" platform="ps4"}
{t="bullets" v = [
"Добавлена первичная поддержка жестов: в настройках управления можно назначить жесты «смахнуть вверх/вниз/влево/вправо» и «касание сенсорной панели» на действия в бою."
"Тап по сенсорной панели более не дублируется как левая кнопка мыши (т.е. это отдельное независимое действие). Для активации объектов в меню используется двойной тап по сенсорной панели."
"Добавлена возможность приближения в ангаре с помощью жеста «щипок» (“pinch to zoom”)."
"В общие настройки управления добавлен переключатель «Использовать сенсорную панель для прицеливания», который возвращает старый режим работы сенсорной панели и отключает распознавание «смахиваний»."
"Добавлена опция «Игра с другими платформами», при выключении которой матчмейкинг будет ограничен только игроками на PlayStation®4."
"Добавлена опция отключения кроссплатформенного общения. Пользователи, выбравшие данную опцию, будут видеть текстовые сообщения только от других пользователей PlayStation®4. Внутриигровой голосовой чат будет отключен — такие игроки могут использовать функционал «Тусовки» PlayStation®4."
"Игроки PlayStation®4, привязавшие e-mail к своему аккаунту, больше не могут тратить Золотые орлы в PC-версии игры. Премиум-аккаунт, входящий в состав наборов в PlayStation Store, также не переносится в PC-версию. Однако Премиум-аккаунт, приобретённый внутри игры, а также все другие покупки за Золотые орлы, сделанные в версии для PlayStation®4, переносятся на PC, как и раньше."
"Добавлена опция «Только PlayStation®4 игроки в таблице рекордов»."

] platform="ps4"}

{t="sep" platform="xboxOne"}
{t="h2" v="Изменения для версии игры на Xbox One" platform="xboxOne"}
{t="bullets" v = [
"Игроки на PlayStation®4 и Xbox One теперь могут встретиться в боях."
"Игрокам Xbox One стали доступны режимы «Симуляторные бои» и «Мировая война» (во время действующего сезона)."

] platform="xboxOne"}

{t="sep"}
{t="h2" v="Графика"}
{t="bullets" v = [
"Улучшен механизм отрисовки индикации на ИЛС современных боевых вертолётов. Теперь индикация отображается в соответствии с физическими принципами работы подобных устройств."
]}

{t="sep"}
{t="h2" v="Звук"}
{t="bullets" v = [
"Созданы новые звуковые события для всех пулемётов наземной и морской техники. Изменен принцип формирования звука стрельбы очередями, теперь это последовательность одиночных выстрелов, тогда как ранее это был пререндер очереди целиком."
"Внесены изменения в звуковые события двигателей наземной техники в сторону большей целостности звучания и увеличения динамики."
"Добавлен аутентичный звук для двигателей и траков линейки танков Т-34."
"Добавлен аутентичный звук для двигателей и траков линейки танков Т-72."
"Ударная волна от пролёта сверхзвукового самолёта теперь звучит более явно, ранее она недостаточно выделялась среди других звуковых событий двигателя."
"Создано новое звуковое событие для подвески колесной техники."
"Реализована динамическая система звука трения колёс/траков наземной техники о поверхность в зависимости от её типа (грязь, песок, снег, бетон, вода)."
"Получили новое звуковое оформление авиационные пушки M61, M61A1 и JM61A1."
]}
{t="sep"}
{t="h2" v="Управление"}
{t="bullets" v = [
"Из раздела «Настройки геймпада» удалена настройка «Скорость управления курсором», как нефункциональная (опция некоторое время не имела никакого эффекта, но оставалась видимой в интерфейсе)."
"Переключатель «Сглаживание мыши» перенесён из раздела «Самолёт» в раздел «Общее управления», поскольку влияет на все виды техники."
"Исправлена ошибка, из-за которой при загрузке ранее сохранённого пресета всегда выбирался режим управления “Прицеливание мышью”."
]}
{t="sep"}
{t="h2" v="Другое"}
{t="bullets" v = [
"Игроки на PlayStation®4 и XBox One теперь могут встретиться в боях."
]}
]
