return [
{t="h1" v="Флот Италии"}
{t="bullets" v = [
"Итальянская линейка развития флота стала доступна для исследования и покупки всем игрокам!"
]}
{t="sep"}
{t="h2" v="Бронетехника"}
{t="bullets" v = [
"Britain — Crusader II “The Saint” (Премиум)"
"Japan — Chi-He (5th Regiment) (Премиум)"
"Italy — M14/41 (47/40) (Премиум)"
]}

{t="sep"}
{t="h2" v="Изменения в локациях и миссиях"}
{t="bullets" v = [
"Противостояние. Линия фронта теперь строго повторяет форму секторов (теперь она рисуется не кривой линией, а прямоугольными линиями по границам секторов)."
"Морское противостояние. Исправлены известные нам ошибки с отрисовкой линии фронта на Мальте и Сайпане при захватах и перезахватах портов."
"Морское противостояние. Исправлена ошибка, из-за которой база для бомбардировки, находящаяся в одном квадрате с портом противника, не исчезала после захвата порта."
"Морское противостояние. Теперь возможность возрождения в каждом конкретном порту при наличии в нём вражеской техники отключается только в случае численного превосходства противника (учитывается только вся морская техника, а также севшие/приводнившиеся самолёты под управлением игроков). Благодаря этому одинокий катер больше не сможет блокировать возрождение противоположной команды."
"Исправлена ошибка, которая могла приводить к падению пользовательской миссии с участием пехоты."
"Исправлены дороги на следующих локациях: Ладога, Кубань, Хюртгенский лес, Сталинград, Моздок, Москва."
"Исправлены визуальные ошибки на следующих локациях: Заброшенный завод, Крепость «Белая Скала», Тропический остров, Императорские сады, Побережье Франции, Новозеландский мыс, Южный Кваркен, Карелия, Кубань — танковое сражение, Американская пустыня, Новороссийск."
]}

{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v = [
"Т-72А — исправлены параметры защищённости ВЛД от кинетического и кумулятивного воздействия. Эквивалент защиты от кинетического воздействия установлен равным 405 мм, от кумулятивного — 500-510 мм. Ранее показатель защиты от кумулятивных средств поражения был ошибочно завышен."
"Т-80Б — исправлены параметры защищённости ВЛД от кинетического и кумулятивного воздействия. Эквивалент защиты от кинетического воздействия установлен равным 420 мм, от кумулятивного — 520-530 мм."
"Т-64Б — исправлены параметры защищённости ВЛД от кинетического воздействия. Эквивалент защиты от кинетического воздействия установлен равным 440 мм."
"M3 Bradley — уменьшено время раскладывания пусковой установки TOW."
"9П149 Штурм-С — исправлена ошибка, позволявшая произвести выстрел на ходу в момент окончания перезарядки."
"Исправлена ошибка с боковым трением гусениц, из-за которой танки могли взбираться на крутые горы и холмы, двигаясь параллельно склону."
"Исправлена ошибка, из-за которой переключение типов снарядов могло не фиксироваться на повторах."
"Centauro MGS — добавлено бронирование оптики."
"P40, P40 'G.C. Leoncello' — убраны лишние элементы, возникающие в снайперском прицеле."
"M60A1 RISE (P) — убраны элементы, мешающие обзору в снайперском прицеле."
"CV 90120 — исправлена анимация наведения орудия."
"Strv 122 — исправлена ошибка, из-за которой некоторые детали бронирования с элементами NERA не являлись объёмной бронёй."
"SPz BMP-1 — исправлена анимация выстрела орудия."
"Т-34 (1 Гв. Т. Бр.) — для основного орудия добавлен дымовой снаряд."
]}

{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v = [
"Пуск ракет «воздух-воздух» Игла, Stinger и Mistral из пусковой установки теперь производится с превышением над целью вместо выполнения горки уже после пуска — т.е. именно так, как происходит пуск в реальности."
"Firebrand TF.Mk.IV — исправлена ошибка, из-за которой у модели самолёта присутствовали ракетные пилоны даже в модификации без ракет."
"Ми-35М — убран защитный колпак у СОЭП."
"SB2U-2, SB2U-3 — исправлена ошибка, из-за которой подвесное вооружение могло «съезжать» с креплений."
"AH-1S Kisarazu — исправлена текстура хвостового винта."
"UH-1B, UH-1C, UH-1C XM-30 — исправлены углы наведения подвижных 7,62 пулемётов."
"F-104A, F-104C — исправлена ошибка, из-за которой модель повреждения в рентгене не совпадала с визуальной."
"F-104G — исправлены текстуры кокпита на внешней модели."
"Phantom FGR.2 — исправлено отсутствие анимации подвесных пушечных контейнеров."
"J22-A, J22-B — исправлено отсутствие анимации правого элерона."
"P-40E (все модели) — исправлена внешняя модель шасси."
"P-51K — исправлена ошибка, из-за которой отсутствовала анимация выстрелов из крыльевого вооружения."
"Vautour (все модели) — исправлено отображение скорости на приборах кокпита."
"Hs 123 A-1 — исправлена ошибка, из-за которой у самолёта присутствовал невидимый тормозной гак."
"Gladiator (вся линейка) — исправлено отображение скорости на приборах кокпита."
"B6N (вся линейка) — исправлено положение камеры пилота в кабине."
]}

{t="sep"}
{t="h2" v="Изменения в лётных моделях"}
{t="bullets" v = [
"F-104 (вся линейка) — исправлен вес двигателей при просмотре в режиме рентгена, увеличена максимальная скорость на 100% режиме двигателя."
"F4U7/AU-1 — исправлена ошибка, приводящая к ухудшению управляемости на всех типах управления."
"Hunter (вся линейка) — исправлена ошибка, приводящая к неверному расходу топлива."
"Ki-100 — исправлена ошибка, приводящая к долгому набору оборотов двигателем."
"Ki-45 (вся линейка) — полностью обновлена лётная модель самолёта согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам."
"Mirage IIIC — исправлена ошибка в термодинамике двигателя на форсажном режиме. Скорректирован характер сваливания на больших высотах."
"P-47N-15 — исправлена ошибка, приводящая к увеличенному расходу антидетонационной жидкости в режиме WEP."
"PBM-3 — исправлена ошибка, приводящая с подпрыгиванию самолёта при переключнении на него в ангаре."
"J35D — максимальная скорость на высоте увеличена до паспортного значения."
"Sea Hawk (вся линейка) — исправлена ошибка в работе механизации и воздушного тормоза."
"Scimitar F Mk.1 — исправлено падение угловой скорости крена на дозвуковых скоростях, связанное с неверной работой усилителей элеронов."
"Swift (вся линейка) — исправлен неверный расход топлива."
"B-17G — исправлена ошибка, приводящая к некорректному перегреву двигателей."
"SBD-3 — полностью обновлена лётная модель самолёта согласно актуальным возможностям физической модели. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнены моменты инерции. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам."
]}

{t="sep"}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения флота"}
{t="vertical" v = [
"Вооружение:"
{t="bullets" v = [
"Поднято бронепробитие носовых частей осколков ОФ снарядов относительно фугасного пробития самого снаряда."
"Vosper 70' GIS 811 — увеличены углы вертикального и горизонтального наведения счетверённой кормовой установки."
]}
]}

{t="vertical" v = [ "ТТХ, физика и модель повреждений флота:"
{t="bullets" v = [
"Admiral Graf Spee, Admiral Hipper, Prinz Eugen, Leipzig, Nurnberg, IJN Furutaka, IJN Mogami, IJN Suzuya, IJN Mikuma, IJN Tone, HMS Belfast, HMS Hawkins, HMS Kent — введена экспериментальная система функционирования противоторпедных булей. Були на лёгких крейсерах способны защитить от попадания торпед с количеством взрывчатого вещества, не превышающим 200 кг в ТНТ-эквиваленте. Були тяжёлых крейсеров защищают от торпед с 250 кг ВВ в ТНТ-эквиваленте. В случае уничтожения буля любая торпеда наносит корпусу корабля полный урон."
"PGH-2, PG 02, Sparviero — уточнена геометрия коллизии на дне корабля."
"Siebelfähre 40 Leichte Flakkampffähre, Siebelfähre 40 Schwere Flakkampffähre — экипаж перераспределён по отсекам, что дает им большую живучесть к урону от огня крупнокалиберных пулемётов. Боезапас вынесен на палубу. Непотопляемость баржи сильно выросла за счёт переустройства конструкции понтонов."
"AF D3, AF D1 — экипаж перераспределён по отсекам, что даёт им большую живучесть к урону от огня крупнокалиберных пулемётов. Увеличен объём радиорубки. Уточнено бетонное ограждение."
"LCS(L)(3) — экипаж перераспределён по отсекам, что даёт им большую живучесть к урону от огня крупнокалиберных пулемётов. Уменьшен объём ходовой рубки."
"Admiral Graf Spee, Admiral Hipper, Prinz Eugen — объём погребов боезапаса уточнён, исключён объём перегрузочных отделений."
"Leipzig, Nurnberg, IJN Mogami, IJN Mikuma, IJN Suzuya — исправлены размеры и расположение отсеков с экипажем. Вырез в палубе внутри барбета сделан более узким."
"IJN Tone — исправлено расположение погребов боезапаса, добавлены погреба доп. вооружения, добавлены снаряды первой очереди для 127-мм зенитной артиллерии. Исправлен рентген погребов и элеваторов. Исправлены толщины корпуса и надстроек. Полностью переделаны топливные баки. Показано сужение пояса у погребов от 145 мм у верхней кромки до 55 к нижней. Толщина носового траверса изменена со 175 до 140 мм. Толщина основания у барбетов изменена, теперь она составляет 75-100 мм для башни номер 2, и 75 мм — для остальных башен."
"Prinz Eugen — уровень листов бронирования на палубе выставлен в соответствии с визуальной моделью."
]}
]}

{t="vertical" v = [ "Модели кораблей, визуальная часть:"
{t="bullets" v = [
"IJN Tone — радар заменён с mk21 на mk22. Гидросамолёты убраны с палубы. Добавлены декоративные пластины под 25-мм зенитные орудия. Добавлены визуальные конструкции-ограничители для 120-мм орудий."
"IJN Furutaka — добавлены визуальные модели бомбосбрасывателей глубинных бомб на корме корабля."
]}
]}

{t="sep"}
{t="h2" v="Экономика и развитие"}
{t="bullets" v = [
"Количество необходимой техники на 4 ранге для открытия 5-го ранга в дереве исследования Итальянского флота изменено с 2 до 3."
]}

{t="sep"}
{t="h2" v="Внешний вид и достижения"}
{t="bullets" v = [
"Для техники Швеции добавлены новые декали «цифры»."
"Strv m/39 TD — изменён стандартный камуфляж. Камуфляж “Twitch” добавлен бесплатно как дополнительный с условием использования «вымышленный»."
"Для следующей техники исправлены ошибки, возникающие при создании темплейта пользовательского камуфляжа: Bf 109 F-4, Bf 109 F-4 (США), Bf 109 G-6, Do 217 E-2, Do 217 E-4, F9F-2, F9F-5, He 111 H-16, He 111 H-3, He 51 B-1, Ju 87 D-3, C.200 серия 7, P-38J-15, P-38J-15 Бонга, PBY-5a 'Catalina', Catalina Mk. IIIa, PBY-5a 'Каталина' (СССР), SPz BMP-1, Pz.Kpfw. Churchill, KV-IB (Германия), leKPz M41, mKPz M47 G, Tiger II (H) Sla.16, Tiger (animal), M60A1 'D.C.Ariete', M43 'G.C.Leoncello', Strv m/39 TD, LVT(A)(4) ZIS-2 (США), M4 748 (a), T-III (СССР)."
]}

{t="sep"}
{t="h2" v="Игровая механика"}
{t="bullets" v = [
"Изменён интерфейс навигационного бомбометания (Continuously Computed Release Point, CCRP) — добавлена вертикальная линия для более удобного прицеливания при пикировании / кабрировании."
"Улучшена точность навигационного бомбометания (CCRP) при пикировании / кабрировании."
"На HUD добавлена индикация работы прицелов для всех видов вооружения самолёта / вертолёта."
"Теперь при захвате цели телеавтоматом вертолёта сразу же включается режим коррекции. Игроку больше не нужно включать его вручную и нажимать клавишу захвата цели дважды, чтобы снять цель с сопровождения."
]}

{t="sep"}
{t="h2" v="Звук"}
{t="bullets" v = [
"Исправлена ошибка, из-за которой игроки могли не слышать звук выстрела танка в том случае, если этот танк не отображался у них на карте."
]}

{t="sep"}
{t="h2" v="Другое"}
{t="bullets" v = [
"Добавлена возможность приближения в видах от первого лица при использовании шлемов виртуальной реальности."
"Добавлены визуальные эффекты перегрузок при использовании шлемов виртуальной реальности."
]}

]
