return [
{t="h2" v="Новые локации и миссии"}
{t="bullets" v = [
"Локация «Курск — Огненная дуга» — улучшена в соответствии с отзывами пользователей."
"Локация «Италия» — улучшена в соответствии с отзывами пользователей. Название изменено на «Кампания» чтобы избежать путаницы с предыдущей версией локации."
]}
{t="sep"}
{t="emphasis" v="Изменения в локациях и миссиях"}
{t="bullets" v = [
"Исправлена коллизия камней на танковой локации «Финляндия»."
"Локации «Пепельная река», «Карпаты», «38 параллель» — закрыты известные кемперские позиции, не предусмотренные дизайном локаций."
"Локация «Польша» — уменьшена высота камней на утёсе с западной стороны озера."
]}

{t="emphasis" v="Изменения в авиационных миссиях для Реалистичных боёв:"}
{t="bullets" v = [
"[Операция] Смоленск — миссия удалена."
"[Операция] Смоленск. 1941 — новая миссия."
"[Операция] Смоленск. 1943 — новая миссия."
"[Операция] Битва за Бастонь."
"[Операция] Берлин — миссия полностью переделана."
"[Операция] Сражение при Эль-Аламейне."
"[Операция] Гуадалканал — миссия полностью переделана."
"[Операция] Хуртген."
]}
{t="emphasis" v="Список изменений, характерных только для этих миссий:"}
{t="bullets" v = [
"Модели баз для бомбардировки заменены на актуальные, а их функционал теперь соответствует таковому в миссиях «Противостояния». Базы после их уничтожения будут появляться снова в случайных местах из перечня заранее определённых для каждой из миссий позиций."
"Из списка целей для бомбометания убраны аэродромы, теперь их нельзя уничтожить."
"Модели аэродромов и их расстояние до центра карты стандартизированы. На низких рангах аэродромы располагаются в 12 км от центра карты, на средних — в 20 км, на высоких — в 26 км. До этого все ранги начинали бой на аэродромах, удалённых от центра карты на 20 км."
"Размер аэродрома теперь зависит от ранга боёв."
"На средних рангах появился аэродром подскока, расположенный на расстоянии 12 км от центра карты."
]}
{t="emphasis" v="Изменения в авиационных миссиях для Аркадных боёв:"}
{t="bullets" v = [
"[Штурмовка] Моздок."
"[Штурмовка] Порт-Морсби."
"[Штурмовка] Рур."
"[Штурмовка] Сицилия."
"[Штурмовка] Корсунь."
"[Штурмовка] Заброшенный завод."
"[Штурмовка] Ледяной перевал."
"[Штурмовка] Горный кряж, Китай."
"[Штурмовка] Утёсы чёрных копателей."
]}
{t="emphasis" v="Список изменений, характерных только для этих миссий:"}
{t="bullets" v = [
"Модели баз для бомбардировки заменены на актуальные."
"Модели аэродромов заменены на новые с длиной взлётной полосы 1700 метров."
]}
{t="emphasis" v="Список изменений, общий для всех вышеуказанных миссий Реалистичных и Аркадных боёв:"}
{t="bullets" v = [
"Сбитие самолётов под управлением игроков теперь приносит очки победы."
"Отключены счётчики техники. По сути они дублировали полоску очков в верхней части экрана, но в некоторых случаях могли не отражать реального количества техники, необходимой для победы — например, при уничтожении зон для бомбардировки. Теперь ориентироваться следует на шкалу индикации очков победы."
"Вся наземная техника теперь влияет на очки победы (ранее уничтожение лёгкой техники не влияло на очки победы), а её количество увеличено. Игрокам для уничтожения доступна как лёгкая наземная техника (артиллерия, грузовики, зенитки), так и тяжёлая (доты и танки)."
"Отключён механизм автоматического уничтожения наземных целей под управлением ИИ. Вместо него добавлен новый тип целей — ИИ-штурмовики, которые появляются за каждую из команд и атакуют наземную технику."
"Улучшено распределение наземной техники. Теперь она либо равномерно распределена по всей линии фронта протяжённостью порядка 10 км, либо сфокусирована в 3-4 зонах, расположенных вдоль той же линии фронта. Ранее в миссиях бывали ситуации, при которых вся наземка либо базировалась в одной области протяжённостью 2-4 км, либо же расстояние между местами её дислокации было слишком большим."
]}
{t="emphasis" v="Изменения и исправления в танковых миссиях:"}
{t="bullets" v = [
"[Сражение] Аляска — исправлена ошибка, из-за которой зоны возрождения южной команды отображались одной иконкой."
"[Захват] Карелия — удалены лишние зоны возрождения из брифинга миссии; исправлена позиция зоны возрождения, которая была расположена перед деревом."
"[Захват] Фульда — исправлен размер боевой зоны в брифинге миссии для Реалистичных боёв."
"[Захват] Польша — исправлено расположение точек захвата и возрождения в брифинге миссии для Реалистичных и Симуляторных боёв."
"[Захват] Вьетнам — в Реалистичных и Симуляторных боях зоны возрождения перенесены ближе к точке захвата."
"[Захват] Второе сражение за Эль-Аламейн — убраны лишние зоны возрождения; увеличен размер зон захвата."
"[Захват] Поля Польши — в Реалистичных и Симуляторных боях зоны возрождения перенесены ближе к точке захвата."
"[Сражение] Поля Польши — исправлено расположение точек захвата в брифинге миссии."
]}
{t="emphasis" v="Изменения и исправления в морских миссиях:"}
{t="bullets" v = [
"«[Превосходство] Огненная земля» — исправлено расположение защиты зон возрождений."
]}
]
