return [
"Новая версия игрового движка Dagor, первые линкоры, новые авианосцы, новое небо, самолёты вертикального взлёта и множество других важных изменений."
{t="h2" v="Dagor 6.0"}
"Обновлены эффекты выстрелов и  взрывов, физика пожаров и разрушения воздушной техники. Реализованы достоверные следы попадания снарядов по объектам игрового мира. Добавлены визуально достоверные эффекты неба, облаков разных типов, туман, рассеяние солнечного света и многое другое."
{t="bullets" v=[
  "Новое небо"
  "Dagor Engine 6.0"
  "Новые визуальные эффекты для авиации"
]}
{t="h2" v="Авиация"}
"В игре появились самолёты вертикального взлёта и посадки: британский штурмовик инновационной технологией отклонения вектора тяги Harrier и советский палубный штурмовик Як-38."
"СССР"
{t="bullets" v=[
  "МиГ-21 бис"
  "Як-38 — премиумный"
  "Як-38М"
  "Ка-50 (обновленный кокпит)"
]}
"Британия"
{t="bullets" v=[
  "AV-8A Harrier — премиумный"
  "AV-8C Harrier"
]}
"Франция"
{t="bullets" v=[
  "P-47D-22 RE — премиумный"
]}
"Германия"
{t="bullets" v=[
  "Bf 110 G-4"
  "P-47D-16 RE — премиумный"
]}
"США"
{t="bullets" v=[
  "AV-8A Harrier — премиумный"
  "AV-8C Harrier"
]}
"Япония"
{t="bullets" v=[
  "Mitsubishi F-1"
]}
"Италия"
{t="bullets" v=[
  "F.C.20 Bis"
]}
"Китай"
{t="bullets" v=[
  "Q-5A/B"
  "P-47D-23 RE"
]}
"Швеция"
{t="bullets" v=[
  "SK60B"
]}
{t="h2" v="Бронетехника"}
"14 новых и обновлённых моделей техники, среди которых — долгожданный Т-90А."
"США"
{t="bullets" v=[
  "M1128"
]}
"Германия"
{t="bullets" v=[
  "Leopard 1A5"
  "FlaRakRad"
  "Leopard 2A6"
]}
"СССР"
{t="bullets" v=[
  "T-72AВ (TURMS-T) — премиумный, в составе набора"
  "T-90А"
]}
"Британия"
{t="bullets" v=[
  "VFM5"
]}
"Китай"
{t="bullets" v=[
  "PTZ89"
]}
"Япония"
{t="bullets" v=[
  "Type 74 F"
]}
"Швеция"
{t="bullets" v=[
  "Strv 122B PLSS"
]}
"Италия"
{t="bullets" v=[
  "Leopard 1A5"
  "Celere Sahariano — премиумный"
]}
"Франция"
{t="bullets" v=[
  "Lorraine 37L"
  "Leclerc S2"
]}
{t="h2" v="Флот"}
"Боевые корабли всех игровых наций разделены на две отдельные ветки с традиционным вертикальным исследованием — большой и малый флот. В игру пришли первые линкоры, а также долгожданные авианосцы HMS Ark Royal и USS Forrestal и авианесущий крейсер “Баку”."
"США"
{t="bullets" v=[
  "USS North Dakota (BB-29)"
  "USS New Orleans (CA-32)"
  "USS Welborn (DD-195) — премиумный"
  "USS Moffett (DD-362) — премиумный"
]}
"СССР"
{t="bullets" v=[
  "«Императрица Мария»"
  "«Полтава»"
  "«Керчь»  — премиумный"
  "«Железняков» — премиумный"
]}
"Британия"
{t="bullets" v=[
  "HMS Dreadnought"
  "HMS Colossus"
  "Montgomery (G95) — премиумный"
  "Класс J (лидер)  — премиумный"
]}
"Германия"
{t="bullets" v=[
  "SMS Westfalen"
  "SMS Helgoland"
  "Type 1924 Luchs — премиумный"
]}
"Япония"
{t="bullets" v=[
  "IJN Ikoma"
  "IJN Settsu"
  "IJN Satsuki (премиум)"
]}
"Италия"
{t="bullets" v=[
  "Aquilone — премиумный"
]}
{t="h2" v="Новые локации и миссии"}
{t="bullets" v=[
  "Авиационная локация «Мегаполис». "
  "Авиационная аркадная миссия на локации «Мегаполис»: «Штурмовка: Мегаполис»."
  "Авиационная РБ миссия на локации «Мегаполис»: «Операция: Мегаполис»."
  "Новый ангар."
]}
{t="h2" v="Изменения в локациях и миссиях"}
{t="bullets" v=[
  "Авиационная РБ миссия на аркадной локации “Рисовые террасы” была переделана."
]}
"Изменения в пробных миссиях"
{t="bullets" v=[
  "Новая пробная миссия для реактивных самолётов палубного базирования США, Британии и СССР."
  "Заменены модели авианосцев в пробных миссиях современной реактивной авиации США и Британии."
  "Новая пробная миссия для Ка-29."
  "Новые мишени в пробных миссиях кораблей с большим тоннажем."
]}
"Размер следующих морских локаций был увеличен до 128 км (за счёт добавления моря по краям локации):"
{t="bullets" v=[
  "«Гонолулу» — ранее остров стоял вплотную с границами локации и его нельзя было обогнуть. Теперь это возможно."
  "«Сайпан»."
  "«Пелелиу» — большая часть островов находилась на краю карты и их нельзя было огибать или же размещать на них объекты миссии."
]}
"Изменения в миссиях авиационных Аркадных боёв (третья и финальная волна)"
{t="bullets" v=[
  "«Штурмовка: Железный хребет»"
  "«Штурмовка: Фьорды»"
  "«Штурмовка: Ирландия»"
  "«Штурмовка: Греция»"
  "«Штурмовка: Москва»"
  "«Штурмовка: Нормандия»"
  "«Штурмовка: Зелёный хребет»"
  "«Штурмовка: Норвегия»"
  "«Штурмовка: Польша»"
  "«Штурмовка: Рисовые террасы»"
  "«Штурмовка: Вершина мира»"
  "«Штурмовка: Испания»"
  "«Штурмовка: Гвианское плоскогорье»"
]}
"В части этих миссий аэродромы были перенесены на новые места, чтобы отдалить их от центра миссии и уменьшить влияние аэродромного ПВО на её ход."
"Общий список изменений"
{t="bullets" v=[
  "Отключён механизм автоматического уничтожения наземных целей под управлением ИИ “барабашка”. Вместо него добавлен новый тип целей — ИИ-штурмовики, которые появляются за каждую из команд и атакуют наземную технику. Также в этих миссиях увеличено количество наземной техники, а в зачёт Очков победы идёт как тяжёлая техника (доты и танки), так и лёгкая (артиллерия, грузовики, зенитки). "
  "Ранее уничтожение лёгкой техники не влияло на очки победы."
  "Модели аэродромов заменены на новые с длиной взлётной полосы 1700 метров."
  "Отключены счётчики техники. По сути они дублировали полоску очков в верхней части экрана, но в некоторых случаях могли не отражать реального количества техники, необходимой для победы — например, при уничтожении зон для бомбардировки."
  "Сбитие самолётов игроков теперь влияет на количество Очков победы у его команды (ранее сбитие самолётов не влияло на очки)."
  "Уменьшено количество ПВО."
  "Перераспределены войска чтобы миссия была более 'равномерной' без излишней скученности."
]}
{t="h2" v="Противостояние"}
{t="bullets" v=[
  "Новая миссия на авиационной локации «Пелелиу» с 4-мя портами на каждую сторону. С большой долей вероятности из-за особенностей ландшафта она будет комфортна для катеров."
  "У кораблей под управлением ИИ в морском противостоянии изменено количество ПВО мелких и средних калибров с целью сократить падения быстродействия в портах или на конвоях (корабли под управлением игроков не затронуты). У грузовых кораблей и эсминцев осталось по 2 ПВО малого и среднего калибров, у крейсеров — по 4. Количество ПВО крупного калибра не менялось. Тесты показали значительное увеличение быстродействия по сравнению с текущей версией игры."
  "Теперь порты в морском противостоянии защищены противоторпедными сетями: любая торпеда будет взрываться при пересечении границы порта."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v=[
  "Для прицелов ЗСУ и прицела по-умолчанию для наземной техники уменьшен размер виньетки."
  "M1A2 — в боекомплект добавлен снаряд M829A1."
  "Challenger 2 (2F) — в боекомплект добавлен снаряд L27A1. "
  "Pz.II C — уточнена схема бронирования корпуса и башни. Схема бронирования стала подробнее. Источники: Die Panzer-Kampfwagen I und II und ihre Abarten // Panzerkampfwagen II Ausf.a/1, a/2, a/3, b, c, A, B and C: Development and Production From 1934 to 1940"
  "2С6 — в боекомплект добавлена ракета 9М311-1М."
  "Maus, E100 — в боекомплект добавлен снаряд 12,8/8,8 Pzgr.-TS."
  "ARL44 — уточнены значения толщины бронирования корпуса и башни. Источник: Notice technique du char de transition ARL-44 France 1944."
  "FlaRakPz.1, AMX-30 Roland — скорости наведения увеличены: по горизонту — с 45 до 85 градусов в секунду, по вертикали — с 25 до 40 градусов в секунду."
  "Скорость перезарядки уменьшена с 10 до 5 секунд."
  "Источник: Flugabwehrpanzer, Geschichte und heutiger Stand."
  "Следующие снаряды наземной техники переведены на более реалистичную схему образования осколков:  Осколочно-фугасные — HE, Кумулятивные — HEAT, Бронебойно-фугасные/пластитные — HESH."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v=[
  "Як-9 (вся линейка), И-16 (вся линейка), МиГ-3 (вся линейка), Як-3 (вся линейка), Mosquito (вся линейка), ЛаГГ-3 (вся линейка), Ла-7 (вся линейка), Ла-5 (вся линейка), И-185 (вся линейка), И-225 — уточнены конструкционные материалы планера и оперения. Улучшена модель повреждения при попадании различных типов и боеприпасов."
  "BF-109K — уточнены конструкционные материалы крыла."
  "He-162 (вся линейка) — уточнены конструкционные материалы оперения."
  "Поршневые двигатели (все типы и модели) — уточнены и улучшены характеристики прочности (живучести) при попадании в них боеприпасов различных типов и калибров."
  "Ка-50, Ка-52 — пилон АПУ-6 для ПТУР Вихрь, реализована система отклонения вниз на 12 градусов."
  "Ка-50 — добавлен детальный кокпит."
  "МиГ-21 СМТ — обновлён кокпит."
  "Для большинства авиационных ракет из тех, где это предусмотрено штатно, реализована система раскладывания оперения."
  "Для ПТУР с наведением по лучу реализована возможность запуска нескольких ракет одновременно."
  "Для ПТУР уточнены позиционные углы для возможности пуска и маневренные характеристики ракет."
  "Для селектора вооружения добавлена возможность изменять кол-во применяемого за один раз подвесного оружия."
  "Для авиации добавлена возможность скрывать в интерфейсе индикаторы радаров при выключенном РЛС и не активном СПО."
  "Р-60 — масса ВВ изменена на 1,150 кг. "
  "Р-60М — масса ВВ изменена на 1,350 кг. "
  "ФАБ-50 — 1000, используемые на самолётах, заменены на версию СВ."
  "Добавлены новые иконки модификаций для минного вооружения и управляемых ракет «воздух — поверхность»."
  "Добавлен новый эффект пилотажных дымов."
  "A-4B — исправлены пушки на Colt Mk 12 Mod 0."
  "T2 — убран ошибочно установленный баллистический вычислитель."
  "T2 — уменьшено до пяти единиц количество носимого бомбового вооружения для бомб массой 250 — 500 фн."
  "F-4E — исправлена ошибка в наборе подвесного вооружения, в подвес-дубликат с 750-фн бомбами М117 (10 шт.) и ракетами AIM-9E (4 шт.) добавлены AIM-7E (4 шт.)."
  "F-4C — исправлена ошибка в наборе подвесного вооружения, в подвес-дубликат с ракетами AIM-9E (4 шт.) и AIM-7D (4 шт.) добавлена пушка M61."
  "Исправлено меню подвесного вооружения. Для следующих самолётов в меню теперь заданы верные изображения, соответствующие типу и количеству вооружения: He 111 H-2/H-6/H-16, He 177 A-5, F.222.2, Me 262 A-1A, Do 17 E-1/Z-2/Z-7, Ju 288 C, BV.238, F3H-2, Meteor F Mk.8 Reaper."
]}
{t="emphasis" v="Изменения в лётных моделях"}
{t="bullets" v=[
  "Ju-87 (вся линейка) — обновлена лётная модель. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолёта при выпуске механизации. Улучшено поведение при пикировании на больших углах."
  "Ju-88А-1/4/C-6 — обновлена лётная модель. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолёта при выпуске механизации и шасси. Улучшено поведение при пикировании на больших углах."
  "D-371-HS9, DB-7 — исправлена ошибка, приводящая к неверному отображению бонусов от установки модуля «обшивка» (при выборе Реалистичных боёв отображался штраф к скорости)."
  "B17BS — исправлена ошибка, приводящая к невозможности управления рулями поплавков для маневрирования на воде."
  "F3F-2 — обновлена лётная модель. Уточнены режимы работы двигателя. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолёта при выпуске шасси."
  "P-63 (вся линейка) — обновлена лётная модель. Уточнены режимы работы двигателя. Обновлена термодинамика (большая зависимость от скорости и высоты полёта). Увеличено влияние сдвига фокуса при выпуске шасси и закрылков. Уточнено поведение на взлёте и посадке. Скорректировано время набора высоты и максимальные скорости согласно паспорту, уточнено поведение в штопоре."
  "Sea Fury FB11 — предельные скорости и число М скорректированы с учётом запаса прочности в 5%. Скорректированы время набора высоты и максимальные скорости согласно паспорту. Уточнены поляры крыла, фюзеляжа и оперения на высоких числах М. Обновлена термодинамика (большая зависимость от скорости и высоты полёта). Увеличено влияние сдвига фокуса при выпуске шасси и закрылков."
  "Т2 — переработана работа силовой установки (немного снижена эффективность при 100% тяги на высоких скоростях и немного увеличена скороподьёмность на форсаже). Исправлена завышенная эффективность рулей на малых скоростях."
  "БИ — скорректирована работа двигателя на малом газу."
  "Swordfish (вся линейка) — улучшено управление на ПМ."
  "AM-1 Mauler — уточнена лётная модель. Снижена скорость сваливания, увеличена скорость на длительном боевом режиме мотора, значительно увеличена скороподъёмность, улучшена управляемость."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения флота"}
"Вооружение"
{t="bullets" v=[
  "Исправлены дистанция и бронепробитие итальянских 120-мм снарядов."
  "IJN Chidori, IJN Mutsuki — добавлен 120-мм ОФ снаряд с донным взрывателем."
  "IJN Tone — добавлены недостающие снаряды первых выстрелов для двух 127-мм установок."
  "S-38b, Type 1939 (T31) — торпеды заменены с G5e G7e на G7a."
  "Type 1939 (T22) — исправлены углы горизонтального наведения носовой 20-мм установки с левого борта."
  "IJN Shimakaze — модель торпед исправлена с Type 93 model 1 на Type 93 model 3."
  "Admiral Graf Spee — исправлена баллистика орудий ГК, увеличена точность и кучность. Исправлены маркировки снарядов ГК."
  "127-мм/40 орудие Тип 89 (IJN Mogami) — исправлены начальная скорость, вес и тип взрывчатого вещества в зенитном снаряде."
  "Isuzu — торпеды заменены на 533-мм Тип 54."
  "HMS London, HMS York, HMS Kent — исправлена ошибка, из-за которой в Аркадных боях у кораблей не перезаряжались торпеды."
  "Type 1924 Leopard — исправлена подсказка в рентгене для двух кормовых орудий ГК."
  "IJN Mutsuki, Chidori — скорострельность 120-мм/45 орудия Тип 3 увеличена до 10 выстр./мин."
  "МО-4 — исправлены максимальные углы вертикального наведения для пушек 21-КМ."
  "Bartolomeo Colleoni, Raimondo Montecuccoli — добавлены запасные торпеды."
  "S-38, S-38b — исправлено максимальное количество 20-мм боеприпасов, которые можно взять в бой."
  "Глубина хода торпед. Для режима Реалистичных боёв всем торпедам перед выходом в бой можно выбрать глубину хода 1 м или 4 м."
  "В АБ торпеды автоматически выбирают оптимальную для поражения цели глубину хода, если это позволяет рельеф дна."
]}
"Модификации и навыки экипажа:"
{t="bullets" v=[
  "Переработана система экипажа. Для всех крупных кораблей, начиная с лёгких крейсеров, отсеки с экипажем были перераспределены по незанятым прочими модулями внутренним объёмам корабля. Такие модули, как котельные отделения, трансмиссии, погреба боезапаса, артиллерийские установки, многоуровневые элеваторы и торпедные аппараты получили свой собственный экипаж."
  "При повреждении или уничтожении такого модуля, выбывший экипаж пополняется из отсеков по мере ремонта модуля. При уничтожении отсека, его экипаж теряется безвозвратно."
  "Количество водоотливных помп теперь имеет значение. При выходе из строя каждой из них вода начинает откачиваться медленнее. Максимальный штраф на скорость откачки воды при выходе из строя всех помп составляет 25% от максимальной."
]}
"ТТХ, физика и модель повреждений флота"
{t="bullets" v=[
  "Угольные бункера сделаны объёмной бронёй и предоставляют дополнительную защиту примерно в следующей пропорции: 1 м угля = 27 мм конструкционной стали. Бункера добавлены в просмотр бронирования, где можно узнать их фактическую толщину в указанной точке."
  "Уменьшена раскачка кораблей от влияния ударной волны при близких взрывах и попаданиях крупными снарядами."
  "Zara — исправлен угол крена в циркуляции."
  "HMS Peacock — исправлен угол крена в циркуляции."
  "HMS London (69) — угол крена в циркуляции увеличен в соответствии с другими кораблями данного класса."
  "Тип 1939 (T31), Jaguar-Klasse (140), HMNZS Leander — добавлены водоотливные помпы."
  "HMS Southampton — исправлен чрезмерный крен в циркуляции."
  "Koln F220, Lubeck F224 — исправлено некорректное отображение 375-мм реактивных бомб в погребах."
  "IJN Shimakaze — количество экипажа исправлено с 267 на 282 человека."
  "Пр.1204 Поздний — исправлена ошибка, при которой в рентгене отображались мины без выбора необходимой модификации."
  "Kanonenboot K-2 — исправлена уязвимость отсеков в центральной части корабля."
  "USS Brooklyn, USS Helena, Clemson (DD-366), Clemson (DD-213) — в анализатор защищённости добавлены ранее отсутствовавшие снаряды с донным взрывателем."
]}
"Модели кораблей, визуальная часть"
{t="bullets" v=[
  "HMS Peacock — добавлена анимация выброса гильз у башни главного калибра."
  "MS-53 — добавлено ограждение на кормовой турели."
  "Chikugo — исправлена ошибка, из-за которой ракетная установка отображалась висящей в воздухе."
  "Класс J (лидер) — исправлена ошибка, из-за которой находящиеся на палубе объекты отображались висящими в воздухе."
  "Köln F220, Lübeck F224 — визуальный эффект выхлопа из трубы заменён с угольного на газовый."
  "Красный Кавказ — исправлена неверная осадка корабля в ангаре."
  "165 ft PC-466 Carmi — исправлена ошибка, из-за которой не отображалось вращение турелей главного калибра."
]}
"Интерфейс"
{t="bullets" v=[
  "Индикатор режима огня ИИ-стрелков (по умолчанию кнопка “E”) перенесён в экшн-панель."
]}
{t="emphasis" v="Экономика и развитие"}
{t="bullets" v=[
  "Дерево исследования флота разделено на два отдельных вертикальных дерева малого и большого флота. Исследование большого флота начинается с резервных эсминцев, которые теперь доступны всем игрокам в начале игры. Смотрите подробности на нашем сайте."
  "Pz.III E — переведен в категорию «резерва» и добавлен в группу вместе с Pz.III B."
  "T2 — БР во всех режимах cнижен до 10.0."
]}
{t="emphasis" v="Внешний вид и достижения"}
{t="bullets" v=[
  "Добавлены декали опознавательных знаков."
  "Jaguar GR.1, Jaguar A — добавлены дополнительные схемы окраски, доступные за выполнение заданий и при покупке за ЗО."
  "Добавлены новые коллекции: декораторы «Амуниция» и декали «Обновления игры»."
  "Добавлена новая схема окраски для топовых танков Японии."
  "Добавлена новая камуфляжная схема окраски для танков Германии."
  "Для следующих танков обновлены наборы камуфляжей, пересчитаны условия их получения: M551, M163, M247, M60A1 (AOS), M60A2, Tiger II (P), Tiger II (H) Sla.16, Panther D, Ferdinand, Nashorn, Waffenträger, Brummbär, Jagdpanther, Bfw. Jagdpanther, Sd.Kfz.234/1, Sd.Kfz.234/2, Sd.Kfz.234/3, Flakpanzer 341."
]}
{t="emphasis" v="Интерфейс"}
{t="bullets" v=[
  "Обновлен визуальный стиль интерфейса. Фон интерфейса стал более прозрачным. Добавлено размытие фона."
  "Улучшена навигация по интерфейсу с помощью геймпада и клавиатуры. Теперь D-pad на геймпаде и стрелки на клавиатуре перемещают курсор мыши по элементам интерфейса."
]}
{t="emphasis" v="Игровая механика"}
{t="bullets" v=[
  "В танковых боях уничтоженная наземная техника игроков теперь остаётся на поле боя до конца миссии. При этом любой игрок может зацепить трос к любой уничтоженной единице техники и отбуксировать её в другое место, чтобы освободить проезд или использовать как укрытие."
  "Добавлен никнейм игрока, дающего целеуказание, над маркером целеуказания для отрядов из трёх и более игроков."
  "В танковых и морских миссиях отключена дымовая индикация точек захвата."
  "В танковых и морских миссиях маркера точек захвата перенесены из мира (игрового пространства) в HUD. Добавлена дистанция до границы точки захвата, находящейся в поле зрения."
  "Для танковых и морских миссий стандартизовано число ячеек сетки миникарты. В миссиях с шириной зоны боевых действий менее 5000 м число полных ячеек равно 7, с шириной зоны 5000 м и более — 10."
  "Для танковых и морских миссий добавлено отображение размера ячейки сетки миникарты."
  "«Эталонная» модификации техники в пробном выезде теперь использует все модификации (кроме взаимоисключающих), а не только те, что влияют на ЛТХ/ТТХ."
  "В танковых Реалистичных и Симуляторных боях изменены правила расчёта стоимости авиации и её вооружения в Очках возрождения:"
  "Добавлен множитель стоимости возрождения для бронебойных прокачиваемых лент. Бронебойной считается лента с пробитием под прямым углом от 40 мм на дистанции 500 м. Стоимость такой ленты составит 20% от стоимости техники."
  "Фиксированный множитель стоимости подвесного вооружения заменён на расчётный от суммарной массы подвесного вооружения (кроме УРВП). Множитель рассчитывается интерполяцией от 3 до 25% от стоимости техники при массе вооружения от 50 до 1000 кг, выходящие за границы интерполяции значения используют крайние значения коэффициентов."
  "Для подвесов с УРВП используется фиксированный множитель 25% от стоимости самолёта."
  "Базовая стоимость возрождения на штурмовиках уменьшена до стоимости возрождения на истребителях."
  "Подвесное вооружение штурмовиков теперь имеет стоимость в ОВ по аналогии с истребителями."
  "В танковых Симуляторных боях уменьшена стоимость возрождения вертолётов: базовая: 300 → 250 ОВ с ПТУР: 450 → 430 ОВ."
  "В ночные танковые бои добавлена автоматическая стрельба осветительным снарядом. От начала миссии с заданной периодичностью на пути от зон возрождения к точкам захвата будет производиться стрельба четырьмя такими снарядами — по два со стороны каждой из команд. Механика реализована как в случайных боях, так и в миссиях полигона для режимов «Захват», «Превосходство» и «Сражение»."
]}
{t="emphasis" v="Графика"}
{t="bullets" v=[
  "Обновление графического игрового движка Dagor Engine до версии 6.0."
  "Обновление атмосферных и погодных явлений, облаков, тумана и обработки света. "
  "Новые визуальные эффекты для авиации: переработка вспышек выстрелов, эффектов работы реактивных двигателей, эффектов попаданий авиа-снарядов и бомб, эффектов пожаров и разрушений авиационной техники. Подробнее читайте в дневнике разработки."
  "Доработаны и улучшены следы от попаданий снарядов на наземной технике. Через пробоины на уничтоженных и горящих танках теперь виден внутренний пожар. Форма пробоин теперь зависит от угла попадания. Для калиберных бронебойных снарядов реализовано застревание модели снаряда в броне танка при непробитии. "
  "Новые эффекты выстрелов для пулемётов и автопушек наземной техники калибров от 7.5 до 30 мм включительно."
  "Для видеокарт NVidia серий 2000 и 3000 добавлена поддержка DLSS."
]}
{t="emphasis" v="Звук"}
{t="bullets" v=[
  "Создано новое аутентичное звуковое оформление для двигателей следующей шведской техники: CV 90120, Lvkv 9040C, CV 90105 TML, Ikv 91, Ikv 103, Ikv 72."
  "Создано новое звуковое оформление для двигателя, присвоенного ряду моделей колёсной техники со схожей компоновкой двигателя: Type 16, R3 T20, Fiat 6614, Fiat 6616, Aubl 74, R3 T106 FA, Centauro ROMOR, Centauro, Centauro MGS."
  "Танки Leclerc и Leopard 2A5 получили новые, улучшенные звуки двигателей."
  "Доработано звучание двигателя танка Т-80 и его модификаций."
  "Исправлено звучание падений гильз для танковых пушек с внешней экстракцией (танки Strv 103А, Strv 103С, Strv 103-0, Lvkv 9040C, Strf 9056, Т-72А, Т-72Б, Т-72Б3)."
  "Двигатели наземной техники противников/союзников теперь звучат так же разнообразно, как и техника игрока (не реализовано для x86 версий Windows из-за технических ограничений платформы). Машины противников/союзников получили столь же богатый набор аутентичных звуков двигателей, что и бронетехника игрока."
  "Механизм озвучания близких пролётов самолётов отредактирован и теперь работает стабильнее."
  "Самолёт F-104 (и его модификации) получил новые звуки турбины и более точно отраженные в звуке фазы работы двигателя."
  "Звуки стрельбы наземной техники и взрывов теперь более естественно меняются с изменением расстояния до их источника."
  "Звуки стрельбы танковых и корабельных пушек доработаны в сторону более естественного баланса частот и слышимости всех элементов выстрела."
  "Создан механизм озвучания ударов волн о нос корабля. Характер звука зависит от размера корабля, его скорости, и волнения моря. "
  "Создано звуковое оформление для волнения моря в зависимости от силы ветра."
  "В игру добавлен новый музыкальный контент. Новая музыка воспроизводится в Авиационных (V-VI ранги) и Танковых (VI-VII ранги) боях. Также обновлена музыкальная тема при старте игры."
  "В настройках звука параметры «Громкость эффектов», «Громкость своего двигателя» и «Громкость стрельбы» теперь нельзя выставить тише 50% от максимальной громкости."
]}
]