// warning disable: -file:const-never-declared
return [
"Серьёзные графические улучшения и эффекты, линейка развития итальянских вертолётов, новые корабли, самолёты и бронетехника."
{t="h1" v="Графика"}
{t="h2" v="Новые визуальные эффекты"}
"Значительно переработаны и улучшены эффекты выстрелов и взрывов орудий танковых и корабельных пушек всех калибров, гусеницы теперь физически достоверные, а на локации танковых боёв добавлены GPU-объекты."
{t="bullets" v=[
  "Обновлены визуальные эффекты выстрелов всей наземной и морской техники."
  "Физически достоверные гусеницы. Теперь каждый из траков имеет физически достоверные свойства. При движении гусеничная лента имеет собственные массу и инерцию. При прохождении неровностей гусеница подскакивает на катках, при разгоне и торможении натягивается или ослабляется, а также какое-то время раскачивается после полной остановки машины."
  "Для новых траков наземной техники добавлены эффекты искр при резком торможении на большой скорости на твердых типах поверхностей (бетон, асфальт, брусчатка), а также при ударах гусеницы о надгусеничную полку. "
  "Локации в игре получили свой набор GPU-объектов: мелкие камешки, обломки, растения, мох, грибы и так далее."
]}
{t="h2" v="Бронетехника"}
{t="horizontal" halign=ALIGN_CENTER padding=[fpx(8), fpx(10)] v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "Sd.Kfz.251/21"
      "Class 3 (P) (акционный)"
    ]}
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "ЗСУ-37-2"
    ]}
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "ADATS (M113A3)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "ST-A3"
    ]}
    {t="emphasis" v="Китай"}
    {t="bullets" v=[
      "CCKW 353 (M45)"
      "ZTZ99"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "E.B.R. (1954) (акционный)"
    ]}
    {t="emphasis" v="Швеция"}
    {t="bullets" v=[
      "ASRAD-R"
    ]}
  ]}
]}
{t="h1" v="Авиация"}
{t="h2" v="Вертолёты"}
"Первые машины новой линейки исследования Италии."
{t="bullets" v=[
  "A129CBT Mangusta"
  "AB 205 A-1"
  "A109 EOA-2"
]}
{t="h2" v="Самолёты"}
"14 новых и обновлённых моделей крылатых машин."
{t="horizontal" halign=ALIGN_CENTER padding=[fpx(8), fpx(10)] v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="США"}
    {t="bullets" v=[
      "A-7D"
      "PBM-1"
      "F-84F"
    ]}
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "F-84F"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Buccaneer S2"
      "Hornet Mk.1 (премиумный)"
    ]}
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "Миг-21ПФМ (акционный)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Китай"}
    {t="bullets" v=[
      "V-11G"
    ]}
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "F-84F"
      "Ro.57 Quadriarma (акционный)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "F-84FF-84F (IAF) (премиумный)"
    ]}
    {t="emphasis" v="Швеция"}
    {t="bullets" v=[
      "Saab 105G"
      "Saab 105ÖE (премиумный)"
    ]}
  ]}
]}
{t="h2" v="Флот"}
"Линейные крейсера и другие новые корабли."
{t="horizontal" halign=ALIGN_CENTER padding=[fpx(8), fpx(10)] v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="США"}
    {t="bullets" v=[
      "USS Baltimore (CA-68) (акционный)"
    ]}
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "SMS Von der Tann"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "МПК пр.12412"
    ]}
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "HMS Invincible"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "Тип K-8 (1942) (акционный)"
      "IJN Hyuga"
    ]}
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "Pola (премиумный)"
    ]}
  ]}
]}
{t="h1" v="Новые локации и миссии"}
{t="bullets" v=[
  "Включён новогодний ангар."
]}
{t="h2" v="«Противостояние»"}
{t="bullets" v=[
  "Вертолётное противостояние на авиационной локации «Мегаполис»."
  "Шаблон с авианосцами доработан и добавлен во все противостояния — как морские, так и самолётные (там, где есть море). Шаблон авианосца отвечает за появление союзного авианосца под охраной ИИ кораблей, предоставляя дополнительный аэродром для самолётов палубного базирования. При обнаружении (подлёте на некоторое расстояние, которое зависит от наличия активного ИИ самолёта-разведчика) авианосца противником у команды противника появляется задание на уничтожение авианосца. В случае гибели авианосца он появляется через некоторое время, но количество его появлений ограничено пятью."
]}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v=[
  "Физически достоверные траки для бронетехники. Новые гусеницы моделируются как физический объект, состоящий из отдельных траков; разрыв ленты происходит в месте попадания снаряда, а анимация падения зависит от длины освободившей ветви гусеницы. Новые гусеницы получили следующие танки и САУ: Т-34-76 (за исключением версии 40 и 41 года, а также прототипа) и САУ на их базе; Т-34-85 и САУ на их базе; Танки серии КВ и САУ на их базе; Танки ИС-1/2 и САУ на их базе; Т-80У, Т-80Б; Т-10А, Т-10М, Об. 268; M3 Lee, все танки M4 «Шерман» и САУ на их базе за исключением штурмовых версий «Джамбо»; T-20; Все танки серии M1 Abrams; A.C.IV Thunderbolt; B1 bis, B1 ter, ARL 44 обоих версий; Ram II и САУ QF 3.7 Ram; Challenger II всех версий; Strv 103 всех версий; Leopard 2A4-2A6 и шведские варианты танков; Type 90/90B; Leclerc S1/S2; Все модификации C1 Ariete; ZTZ-96A; Танки серии Chi-Ha, Chi-He и САУ на их базе."
  "Для юнитов с функционалом раскладывания/складывания пусковой установки ПТУР добавлена скорость (20 км/ч), в пределах которой нельзя стрелять, но пусковая не складывается и остаётся в боевом положении: M901, 9П149, M3 Bradley, Strf 9040 BILL."
]}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v=[
  "F-104G (Германия) — добавлены ЛТЦ."
  "G.91 YS — добавлен баллистический вычислитель."
  "Исправлены ошибки в материалах элементов бронирования для следующих самолётов: Whirlwind Mk I, Swift F.1, Swift F.7, B-17E/L, B-17G, J5N1, Ju 288 C, Q-5A, Q-5 early."
]}
{t="h2" v="Изменения в лётных моделях"}
{t="bullets" v=[
  "МиГ-21 (все) - скорректированы углы отклонения руля высоты и маневренность на больших скоростях, улучшена балансировка и управляемость на посадке, МиГ-21бис, МиГ-21СМТ, МиГ-21ПФМ - сделана симуляция закрылка со сдувом пограничного слоя, подъемная сила крыла дополнительно увеличивается при полном отклонении закрылка и тяге 30-50% для обеспечения меньших скоростей на посадке."
  "Вертолеты (все) - улучшен эффект воздушной подушки, воздушная подушка теперь оценивается по кольцу для более реалистичного влияния формы поверхности под несущим винтом."
]}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения флота"}
{t="emphasis" v="Вооружение"}
{t="bullets" v=[
  "Исправлена стрельба автоматических стрелков из орудий с перегревом (ранее ИИ не учитывал перегрев)."
  "Dardo, Bartolomeo Colleoni — установлены корректные версии 40-мм орудий."
  "Повышена точность стрельбы ИИ стрелков по надводным целям."
  "Скорректированы максимальные дистанции открытия огня ИИ стрелками в зависимости от калибра. Теперь ИИ не открывает огонь на дистанциях, превышающих прицельную дальность своих орудий."
  "HMS Dreadnought, HMS Colossus — скорость заряжания орудий 305мм/45 mark X/XI увеличена до двух выстрелов в минуту."
  "Chidori — убрана отсутствующая в реальности перезарядка торпед."
  "80-мм/60 орудие Тип 98 (IJN Agano) — исправлен калибр снарядов в карточке"
  "127-мм/50 орудие 3rd Year Type — исправлена начальная скорость и количество ВВ в зенитном снаряде"
]}
{t="emphasis" v="ТТХ, физика и модель повреждений флота"}
{t="bullets" v=[
  "SMS Westfalen — главный 290-мм бронепояс продлён до концов цитадели."
  "Admiral Graf Spee, Admiral Hipper, Prinz Eugen, Leipzig, Raimondo Montecuccoli, USS Pensacola (CA-24), Красный Кавказ — добавлены бронированные крышки барбетов."
  "Тяжёлые крейсеры — исправлены параметры крена и затопления. Снижена скорость поступления воды через крупные пробоины. Снижена скорость возрастания крена."
  "Dardo — леерные опоры сложены на палубу, благодаря чему увеличены углы наведения носовой башни корабля."
  "Geniere — исправлены углы наведения орудий."
  "Zara — в бою убраны кормовые лодки для беспрепятственной стрельбы кормовой башни в этих секторах."
  "HMS Dreadnought — исправлены углы горизонтального наведения бортовых башен ГК."
  "Freccia P-493, Saetta P-494 — уменьшен крен в циркуляции."
  "Hunt (L79) — исправлены углы наведения орудий главного калибра для предотвращения стрельбы через надстройки корабля."
  "Пр. 35 — исправлена ошибка с бронированными частями корабля."
  "Чапаев, Железняков — исправлены ошибки бронирования: исправлена толщина носового и кормового траверсов, исправлена толщина бронепалубы в районе кормовых помп."
  "Leipzig — удалена часть котельных отделений в рентгене корабля."
  "Zara — исправлено несоответствие вектора выстрела с точкой прицеливания у 13,2-мм пулемётов."
]}
{t="emphasis" v="Модели кораблей, визуальная часть"}
{t="bullets" v=[
  "Porter (DD-356), Москва (лидер), Ташкент (лидер), IJN Kako, IJN Yuudachi, Тип K-8 (1942), HMS Arethusa, S-100 (1944), Aquilone — добавлена анимация флага."
  "HMS Peacock — исправлено расположения буя в ангаре."
  "IJN Tone, Тип 4 Модель 4 — исправлено визуальное отображение орудий."
  "HMS Colossus — уменьшена высота конструктивных рёбер угольных ям в рентгене."
  "IJN Ikoma, Admiral Hipper — исправлено положение стрелков орудий вспомогательного калибра."
  "Ташкент (лидер) — исправлено отображение надстроек корабля в разрушенном состоянии (на дальних дистанциях надстройка исчезала)."
  "MS-53 — исправлена визуальная ошибка с тенями на надстройке корабля."
  "Akebono — спрятана нода глубинной бомбы в тех модификациях, где глубинных бомб нет."
  "IJN Kiyoshimo — убраны артефакты масок орудий ГК."
  "SMS Helgoland — убраны артефакты на флаге корабля."
  "Полтава — исправлено визуальное отображения маски орудия главного калибра."
  "SMS Westfalen — исправлено направление изображения герба на носу корабля."
  "Fairmile D (5001), Fairmile D (697), Fairmile C (332) — убраны артефакты мешков для гильз 20-мм орудий Oerlikon."
  "IJN Shimakaze — исправлена ошибка инверсии навигационных огней на рубке."
  "IJN Ikoma — на место лишнего дальномера на рубке добавлены приборы навигации и управления."
]}
{t="emphasis" v="Другое"}
{t="bullets" v=[
  "Для линкоров исправлена критическая глубина и глубина, при которой игрок получает предупреждение о приближающейся мели."
]}
{t="h2" v="Экономика и развитие"}
{t="bullets" v=[
  "AH-1S Kisarazu, G-Lynx, Tigre HAP — стали доступны для покупки за Золотые орлы."
]}
{t="h2" v="Внешний вид и достижения"}
{t="bullets" v=[
  "Опознавательные знаки и декали на нижеперечисленных машинах перенесены на слой стандартного камуфляжа. Ранее выданные декали также остались доступны: Achilles (65 Rg.), ИС-2 'Месть', Т-34-85Э, T-III (СССР)."
  "МиГ-21БИС — добавлены дополнительные камуфляжи, которые можно получить за выполнение заданий или покупку за Золотые орлы."
]}
{t="h2" v="Награды"}
{t="bullets" v=[
  "Награда за все базовые обучающие миссии изменена со 100 ЗО на уникальные декали для каждого типа техники. Полученные за ранее пройденные обучения Золотые орлы останутся у игроков, а для получения уникальной декали нужно будет пройти обучение заново."
  "Вместо награды в Золотых орлах за каждое базовое обучение добавлена единоразовая награда за прохождение первого базового обучения для аккаунта. Для игроков, ранее прошедших любое базовое обучение, получение этой награды невозможно."
]}
{t="h2" v="Интерфейс"}
"Улучшено меню Коллекции."
{t="bullets" v=[
  "Добавлен фильтр для полученных коллекций."
  "Добавлена ссылка на коллекции из меню внешнего вида."
  "Улучшены иконки для коллекционных декораторов."
]}
{t="h2" v="Игровая механика"}
{t="bullets" v=[
  "Число очков, требуемое для вылета на бомбардировщике с ядерным вооружением в Танковых аркадных боях, уменьшено с 20 до 15."
]}
{t="h2" v="Изменения для версии игры на PlayStation"}
{t="bullets" v=[
  "Добавлена поддержка Thrustmaster Hotas 4 на PlayStation 5."
  "На PlayStation 5 теперь доступен внутриигровой голосовой чат с другими игроками."
]}
{t="h2" v="Изменения для версии игры на Xbox"}
{t="bullets" v=[
  "Игроки без подписки Xbox Live Gold теперь смогут заходить в игру, но им будут доступны только одиночные активности (без мультиплеера)."
  "Исправлена ошибка, из-за которой на Xbox Series S/X при подключении беспроводных клавиатуры и мыши через отдельные ресиверы могло работать только одно из устройств."
  "Устранена задержка в срабатывании некоторых клавиш клавиатуры на Xbox Series S/X."
]}
{t="h2" v="Графика"}
{t="bullets" v=[
  "Обновлены визуальные эффекты выстрелов всей наземной и морской техники."
  "Физически достоверные гусеницы. Теперь каждый из траков имеет физически достоверные свойства. При движении гусеничная лента имеет собственные массу и инерцию. При прохождении неровностей гусеница подскакивает на катках, при разгоне и торможении натягивается или ослабляется, а также какое-то время раскачивается после полной остановки машины."
  "Для новых траков наземной техники добавлены эффекты искр при резком торможении на большой скорости на твердых типах поверхностей (бетон, асфальт, брусчатка), а также при ударах гусеницы о надгусеничную полку."
  "Локации в игре получили свой набор GPU-объектов: мелкие камешки, обломки, растения, мох, грибы и так далее."
]}
{t="h2" v="Звук"}
{t="bullets" v=[
  "Звуки скорострельных орудий наземной и морской техники теперь фактически привязаны к каждому отдельному выстрелу очереди. Ранее серия звуков стрельбы запускалась с частотой, примерно соответствующий частоте очереди."
  "Падения гильз наземных орудий теперь озвучены в соответствии с физикой."
  "На локацию «Вьетнам» добавлена агитационная речь, воспроизводящаяся через громкоговорители."
  "Небольшие корректировки громкости некоторых двигателей техники игрока."
]}
]