// warning disable: -file:const-never-declared
return [
"Новые эффекты попаданий, тактические ракеты «воздух-поверхность», дипольные отражатели, африканская бронетехника и множество других интересных изменений."
{t="h2" v="Бронетехника"}
{t="horizontal" halign=ALIGN_CENTER padding=[fpx(8), fpx(10)] v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Великобритания"}
    {t="bullets" v=[
      "SARC MkVI (2pdr)"
      "SARC MkVI (6pdr)"
      "Eland 90 Mk.7"
      "Ratel 20"
      "Ratel 90"
      "ZT3A2"
      "TTD"
      "ZA-35"
      "Rooikat MTTD"
      "Olifant Mk.1A"
      "Olifant Mk.2"
    ]}
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "Hiro-Sha"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "Pz.III N"
      "Pz.IV G (премиумный)"
      "StuG III G"
    ]}
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "SK-105A2"
      "Leopard 2 PL (полковой)"
    ]}
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "БТ-7М"
      "Т-28 (1938)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Китай"}
    {t="bullets" v=[
      "PTL02"
    ]}
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "JaPz.K A2"
      "MARS 15"
    ]}
  {t="emphasis" v="Швеция"}
    {t="bullets" v=[
      "Ikv 91-105"
    ]}
  {t="emphasis" v="США"}
  {t="bullets" v=[
      "M3A3 Bradley"
    ]}
  ]}
]}
{t="h2" v="Самолёты"}
"В игре появились сразу несколько моделей тактических ракет «воздух — поверхность» и новая система ИЛС."
{t="horizontal" halign=ALIGN_CENTER padding=[fpx(8), fpx(10)] v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "Су-9"
      "Су-11 (премиумный)"
      "Су-17М2"
    ]}
    {t="emphasis" v="США"}
    {t="bullets" v=[
      "F8U-2"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Attacker FB.2 (премиумный)"
    ]}
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "A6M5 Hei"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Китай"}
    {t="bullets" v=[
      "F-5A"
    ]}
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "Mirage 3E"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Швеция"}
    {t="bullets" v=[
      "Fokker D.XXI (премиумный)"
    ]}
  ]}
]}
{t="h2" v="Вертолёт"}
{t="bullets" v=[
  "Wasp HAS.Mk.1 — добавлен детальный кокпит"
]}
{t="h2" v="Флот"}
{t="horizontal" halign=ALIGN_CENTER padding=[fpx(8), fpx(10)] v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "SMS Kaiser"
    ]}
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "Пр. 50 «Росомаха» (премиумный)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Класс Whitby (F-77)"
    ]}
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "IJN Isuzu"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "Etna"
    ]}
  ]}
]}
{t="h2" v="Графика"}
{t="bullets" v=[
  "Улучшены эффекты попаданий всех снарядов по твердым поверхностям (металл, грунт, песок, бетон и т.д.)."
  "Увеличен радиус и уменьшена насыщенность взрывной волны на эффектах выстрелов."
  "В корабельном ангаре модель буя заменена на бочку."
  "Улучшено свечение эффектов пламени."
]}
{t="h2" v="Новые локации и миссии"}
{t="bullets" v=[
  "Локация для совместных боёв «Северск-13»."
]}
{t="emphasis" v="Изменения в локациях и миссиях"}
{t="bullets" v=[
  "В некоторых миссиях модели аэродромов заменены на идентичные, но имеющие большую площадь подложки (чтобы скрыть эффект холма на подлёте к аэродрому)."
  "Глубина воды на большинстве локаций увеличена или приведена к исторической для корабельного геймплея."
  "Остовы танков, которые нельзя двигать, визуально изменены так, чтобы их нельзя было перепутать со  свежеподбитым танком, который двигать можно."
]}
{t="emphasis" v="«Противостояние»"}
{t="bullets" v=[
  "Исправлена ошибка, из-за которой одно и то же наземное сражение могло начаться сразу в нескольких квадратах, при этом техника распределялась между ними."
  "Исправлена ошибка, из-за которой в одних и тех же квадратах одновременно могло проходить несколько наземных сражений (обычно два встречных)."
  "ИИ-бомбардировщики теперь спавнятся на разной высоте в зависимости от ранга боев."
  "«Противостояние: Халхин-Гол». Изменены позиции некоторых аэродромов, добавлена ещё одна возможная позиция базы для бомбардировок."
  "Исправлена ошибка, из-за которой на некоторых миссиях часть аэродромов оставалась без прикрытия ПВО."
  "Исправлена ошибка, из-за которой перезашедший в сессию игрок увеличивал количество победных очков своей команды."
  "Исправлена ошибка, из-за которой в миссии «Противостояние: Тунис» аэродромы находились слишком близко к центру карты, из-за чего на высоких рангах время подлета к линии фронта от дальних аэродромов было слишком мало."
  "Ускорено появление ПВО на аэродромах (ранее оно могло задерживаться на несколько минут после старта миссии)."
  "Исправлена ошибка, из-за которой переставали появляться наземные конвои."
  "Максимальное количество одновременно действующих конвоев увеличено с одного до трёх."
  "Исправлены некоторые ошибки в появлении конвоев, приводившие к периодическому застреванию или сильному растягиванию колонны. Теперь техника конвоев должна будет двигаться более равномерно."
  "При появлении наземного конвоя в Аркадном режиме миссии, задание на его уничтожение и подсветка машин конвоя на карте теперь будут выдаваться после появления всех машин, а не первой из них."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v=[
  "Пересмотрены и уточнены параметры перегрева автоматических орудий наземной техники. Автоматические пушки с питанием через магазины ограниченной вместимости (например, 4-20 снарядов) теперь будут перегреваться медленнее. "
  "Автоматические пушки с ленточным питанием теперь при непрерывной стрельбе будут перегреваться быстрее."
  "Снижена стойкость к повреждениям у гусеничных траков. Теперь гусеница у танков должна «рваться» от одного попадания снаряда калибром от 75 мм."
  "M3A3 (Китай, Франция, Италия) — добавлена модификация дымовых гранатомётов. "
  "Merkava Mk.1, Merkava Mk.2b — добавлена модификация ТДА."
  "Type 90, Type 90B — скорострельность изменена с 12 до 15 выстрелов в минуту. Боевой рейтинг во всех режимах увеличен с 10.3 до 10.7."
  "105mm M774 — длина пенетратора увеличена с 347 до 375 мм, соответственно с чем пересчитано пробитие."
]}
"Увеличена толщина материала орудийных стволов для орудий калибром от 40 мм:"
{t="bullets" v=[
  "Калибр 40 — 70 мм: 15 → 20"
  "Калибр 75 — 90 мм: 20 → 30"
  "Калибр 100 — 130 мм: 25 → 35"
  "Калибр 150 — 183 мм: 30 → 40"
]}
"Новые физически достоверные гусеницы получили следующие танки и САУ:"
{t="bullets" v=[
  "Италия: M13/40 (I, II, III), M11/39, M41 75/18, M41 75/32, M43 75/34, M43 105/25, M41M 90/53, M43 75/46, M42 75/34, M14/41 47/40, Semovente M42 Contraereo, Pz.III N, Pz.IV G, StuG III G, M60A1 D.C.Ariete."
  "Германия: Dicker Max, Nashorn, Brummbär, Pz.IV H, Pz.IV J, Pz.IV G, Pz.IV E, Pz.IV F, Pz.IV F2, Jagdpanzer IV, Panzer IV/70(V), Panzer IV/70(A), Pz.Bef.Wg.IV J, Wirbelwind, Ostwind, Ostwind II, Kugelblitz,  StuH 42 G, StuG III F, StuG III G, Pz.III J, Pz.III J1, Pz.III L, Pz.III M, M48A2 C, M48A2 G A2, M48 Super."
  "СССР: T-III, T-54 47, T-54 49, T-54 51, T-62, T-62-М1, ИТ-1, СУ-122-54, ЗСУ-57-2, Т-72А, Т-72Б, Т-72Б (1989), Т-72АВ (TURMS-T)."
  "Британия: Cromwell I, Cromwell V, Cromwell V (RP-3), Archer, Valentine XI, Valentine IX, Centurion Mk.1, Centurion Mk.3, Centurion Mk.10, Centurion Action X, Centurion Mk.5 AVRE, Centurion Mk.5 RAAC, Olifant Mk1A, Olifant Mk2."
  "США: M48A1, T54E1, M60, M60 AMBT, M60A2, M60A1(AOS), M60A1 RISE (P), M103, M60A3 TTS"
  "Китай: M48A1, M60A3 TTS"
  "Франция: AMX-30, AMX-30B2, AMX-32, AMX-30 DCA, AMX-30 ACRA, Roland 1."
  "Швеция: Strv 81, Strv 101."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v=[
  "UH-1C — исправлено отображение подвесного 40-мм гранатомёта при установке блоков с ракетами FFAR."
  "A-129 International — исправлен материал бронирования кабины."
  "F6F-5 — добавлен раздельный сброс для бомб калибром 1000 фунтов."
  "F4U-7 — добавлен раздельный сброс для бомб калибром 1000 фунтов."
  "Brigand B 1 — расширена номенклатура вариантов бомбового вооружения."
  "SA.342M Gazelle — исправлена ошибка с отображением в одном из пресетов в меню вооружения подвесного контейнера."
  "A32A — добавлен баллистический вычислитель."
  "SBD-3 — исправлены элементы бронирования."
  "A-26B-10 — исправлены элементы бронирования и отрывы частей самолёта при повреждениях."
  "Для части самолётов исправлен отрыв крыла в местах крепления подвесного вооружения, чтобы исключить появление в воздухе этого подвесного вооружения в месте обрыва элементов."
  "Исправлена ошибка, из-за которой в подвесном пушечном контейнере УПК-23-250 в некоторых случаях отображалась пушка ГШ-23."
  "A-7D — добавлены новые ракеты класса «воздух — поверхность» AGM-65A. В кокпит добавлены ИЛС и СПО. "
  "AV-8A, AV-8C, Harrier GR.1, Harrier GR.3, Buccaneer S.2, F-4E Phantom II, F-4EJ Phantom II, Phantom FGR.2, Phantom FG.1, F-104G, F-104J, F-104G, F-104S — добавлены ИЛС."
  "Z.1007 bis серия 3, серия 5 — добавлено бронирование."
  "F-104J — количество используемых ракет AIM-9 увеличено до четырёх. Добавлены ракеты AIM-9P"
  "Ка-52 — добавлена система комплекса СОЭП Л370 Витебск."
  "I-16 Chung 28, I-16 type 5 — в локализацию добавлен знак Китайской республики."
  "F-104G, F-104S — добавлен баллистический вычислитель."
  "Jaguar GR.1 — добавлен баллистический вычислитель для бомб (CCRP)."
  "Ракета Х-23М — режим управления изменён на ручное (по трём точкам), для реализации системы радиокомандной линии наведения «Дельта-НГ»."
  "Для ракет Р-3Р, Р-3С, PL-2 ограничение по перегрузке на пуск увеличено до 4G."
  "AGM-71 TOW / AGM-71 TOW 2 — исправлено наименование, для всех вертолётов-носителей AGM-71 TOW изменена на AGM-71 ITOW, исправлены характеристики, масса ВВ, дальность полёта для AGM-71 ITOW увеличена до 3750 м."
  "Добавлены дипольные отражатели (ДО) для всех самолётов и вертолётов, где были установлены ложные тепловые цели (ЛТЦ); добавлен различный выбор соотношения ЛТЦ и ДО, только ДО или только ЛТЦ."
]}
{t="emphasis" v="Изменения в лётных моделях"}
{t="bullets" v=[
  "Saab Sk.60b — исправлена ошибка с некорректным расчётом паразитного сопротивления пушечных контейнеров. Добавлено реверсирование тяги."
  "SB2U-2/3, Wirraway, IAR-81c, Ki-32 — обновлена лётная модель. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолёта при выпуске механизации. Улучшено поведение самолёта при пикировании на больших углах."
  "CW-21 — уменьшено капотирование при агрессивном торможении. Уточнено обтекание стабилизатора, более правильное сваливание на малых скоростях. Уточнена (незначительно уменьшена) скороподъемность."
  "Ta-152H1 — уменьшено капотирование при агрессивном торможении. Уточнено обтекание стабилизатора, более правильное сваливание на малых скоростях."
  "Do-335 (вся линейка) — все тяги управления заменены с тросовых на трубчатые, дающие более чёткое и отзывчивое управление. Уменьшено волновое сопротивление профиля крыла для более тонкого профиля (улучшена динамика на высоких скоростях). Увеличена эффективность механизации за счёт включения флаперонов. Настроена различная инерция винтомоторной группы для переднего и заднего моторов."
  "FW-190 (вся линейка) — уменьшена вероятность капотирования при агрессивном торможении."
  "Hurricane (вся линейка) — исправлена ошибка, из-за которой разрушение закрылков происходило на неверной скорости (посадочное положение допустимо на скоростях не выше 200 км/ч или 120 миль/ч)."
  "P-61 (вся линейка) — исправлена ошибка, из-за которой было возможно вести огонь из курсового вооружения при выпущенных шасси."
  "F-104 (вся линейка) — для улучшения посадочных свойств самолёта добавлено управление пограничным слоем при полном выпуске механизации и работающем двигателе."
  "A-7D — исправлена ошибка, приводящая к неверным значениям добавленной массы и сопротивления при  использовании пушечных контейнеров GAU-13/a (вес и паразитное сопротивление увеличены)."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения флота"}
{t="emphasis" v="Вооружение"}
{t="bullets" v=[
  "ИИ-стрелки больше не открывают огонь по целям, которым они заведомо не могут нанести урон. Например, стрелки орудий калибра 37, 40, 76 мм и т.д. больше не будут стрелять по линейному кораблю."
  "100-мм/70 СМ-5-1 — исправлены масса и тип ВВ в снарядах Ф-55 и ОФ-55."
  "356-мм/45 орудие 41 Year Type (IJN Hyuga) — Исправлены вес, тип и скорость бронебойного снаряда. Снаряд ОФ по-умолчанию заменён на полубронебойный."
  "USS North Dakota (BB-29) — ББ снаряд по умолчанию Mk.17 заменён на ОФ Cl.B. Добавлен новый прокачиваемый ББ снаряд Mk.7."
  "SMS Helgoland — добавлен полубронебойный снаряд на первый уровень модификаций. Бронебойный сдвинут на второй уровень, его нужно изучить заново. Опыт и игровая валюта, ранее потраченные на изучение ББ снаряда, возвращены на аккаунты игроков."
  "На кораблях Британии исправлена скорость наведения орудий 102-мм/45 орудие Mark XVI и 102-мм скорострельное орудие Mark V в зависимости от установки, на которой монтировалось орудие."
  "135-мм/45 орудие O.T.O. Mod. 1938 — скорострельность увеличена до 7,5 выстр/мин."
  "100-мм морское орудие Минизини — скорострельность снижена до 12 выстр/мин."
  "Leipzig, Nurnberg, Koln, Чапаев, Свердлов, Железняков, Красный Кавказ — у орудий ГК убраны снаряды первых выстрелов. Скорострельность орудий теперь постоянная."
  "IJN Suzuya, IJN Mikuma, IJN Mogami, IJN Isudzu — добавлены снаряды первых выстрелов для 127-мм/40 орудия Тип 89. Скорострельность орудия для этих снарядов исправлена на 14 выстр/мин."
]}
{t="emphasis" v="ТТХ, физика и модель повреждений флота"}
{t="bullets" v=[
  "Для линкоров, крейсеров и эсминцев изменена модель повреждения погребов боезапаса. Пожар и детонация зарядных погребов фатальны для корабля. Взрыв и детонация снарядных погребов не означают безусловной гибели корабля, но приводят к сильным разрушениям вокруг себя, пробоинам и пожарам."
  "Для линкоров и крейсеров переработаны некоторые пожары — пожары башен главного калибра, элеваторов подачи боезапаса и некоторых внутренних помещений стали опаснее. Огонь из боевого отделения башни может распространиться вниз внутри барбета, охватить элеватор и добраться до погребов боезапаса."
  "Снарядные погреба более стойкие к пожару, чем зарядные, и могут дольше находиться под его воздействием. Но и те и другие имеют шансы сдетонировать, если огонь не тушить. Кроме того, если пожар уничтожит погреб, тот неизбежно взорвётся."
  "Исправлены дистанции хода снарядов под водой. Попав в воду, снаряд может преодолеть расстояние, равное примерно 80-100 своим калибрам, после чего потеряет всякую убойную силу."
  "Исправлена модель повреждения дымовых труб, они стали выбиваться реже и сложнее: от 2-3 попаданий ББ снарядами кораблей своего класса, и от 1-2 ОФ снарядов. Скорректировано падение максимальной скорости корабля при повреждении и уничтожении дымовых труб."
  "USS Atlanta (CL-51) — исправлено бронирование корпуса и палубы. На бортах появились накладные листы противоосколочной брони."
  "МБК пр.186, МБК пр.186 (МК 85), МБК-161 (1943) МБК-161 (1944) — исправлено расположение экипажа в отсеках и артиллерийских установках для избежания ситуации с «последним выжившим», когда уничтожены все отсеки, но катера остаются на плаву."
  "USS Baltimore (CA-68) — количество экипажа увеличено до 1560 человек. Исправлены толщина и форма бронепоясов, добавлено бронирование боевой рубки, бронирование корпуса и верхней палубы. Исправлено бронирование элеваторов орудий главного калибра. В районе кормовых погребов добавлена топливная цистерна. Классификация брони внутренних бронепоясов изменена с внешней на внутреннюю."
  "USS New Orleans (CA-32) — количество экипажа увеличено до 1183 человек. Исправлены форма и толщина бронепоясов, бронирование погребов и бронепалуб. Добавлена противоосколочная броня на борта. Добавлены бронещитки для 20-мм автопушек Oerlikon. Исправлены материалы брони."
  "USS Northampton (CA-26) — количество экипажа увеличено до 872 человек."
  "USS Pensacola (CA-24) — количество экипажа увеличено до 923 человек."
  "USS Portland (CA-33) — количество экипажа увеличено до 1033 человек."
  "IJN Ikoma — исправлено бронирование корабля и орудий главного калибра, скорость увеличена до 21,91 узлов, экипаж уменьшен до 820 человек."
  "IJN Shimakaze — полная переработка внутренних модулей корабля, приведение в соответствие с материалами из библиотеки Yasukuni Shrine Kaiko."
  "Класс J (лидер), Класс K (F37), Класс N (G25), Чапаев, Железняков — уменьшен крен в циркуляции."
  "HMS Hawkins (D86) — исправлена проблема самопроизвольного уничтожения торпедных аппаратов."
  "Leipzig, Nürnberg, Admiral Hipper, Admiral Graf Spee, Красный Кавказ, Чапаев, Свердлов — убраны щели между бронированными элементами."
  "IJN Settsu — исправлено бронирование. Изменена толщина носового и кормового бронепоясов, нижней части главного бронепояса, бортовой детали бортовых башен, верхней детали барбета носовой и кормовой башен, крыш обеих бронерубок, бронепалубы в кормовой оконечности."
  "IJN Tone — исправлено бронирование. Изменена форма брони винто-рулевой системы, толщина бокового бронирования погребов боезапаса, форма бронированной переборки."
  "Pola — исправлена проблема с прицельной стрельбой 13,2-мм пулемётов."
  "Класс J (лидер) — добавлено бронирование щитов 20-мм орудий на корме."
  "Киров — исправлена ошибка с отсутствием погреба вспомогательного калибра."
  "SMS Helgoland — исправлена ошибка с уничтожением боеукладки без попадания в неё и отсутствием её уничтожения при попадании."
]}
"Исправлена модель повреждения бронебойных, полубронебойных и ОФ снарядов с донным взрывателем:"
{t="bullets" v=[
  "Параметры кинетического урона увеличены в соответствии с энергией снаряда."
  "Исправлены секторы разлёта, урон и бронепробитие осколков снарядов. Основной урон осколками наносится в более концентрированных конусах по ходу движения снаряда и в стороны от него. В хвостовой части оставлены наиболее слабые осколки."
  "Параметры взведения и задержки взрывателей изменены таким образом, чтобы снаряды взводились на определённых модулях и толщинах в зависимости от калибра снаряда и класса корабля, по которому ведётся огонь. Задержки взрывателей подобраны так, чтобы снаряд взрывался ближе к середине ширины корабля (при средних её значениях, углах вхождения снаряда и проч.)."
  "Для многих снарядов уточнены параметры потери скорости в полёте, сопротивления воздуха и времени полёта, что, соответственно, также привело к некоторым изменениям в бронепробитии."
]}
{t="emphasis" v="Модели кораблей, визуальная часть"}
{t="bullets" v=[
  "IJN Mikuma — добавлена стойка тросовой опоры на третью башню главного калибра."
  "IJN Mikuma, IJN Mogami, IJN Suzuya — исправлено отображение реек плинтусов линолеума на палубе."
  "IJN Kako — исправлена анимация флага. Исправлено неверное расположение некоторых объектов на палубе разрушенной модели корабля."
  "Pola — исправлена неверная осадка корабля в ангаре."
  "R-boot R-130 — в рентгене корабля спрятаны мины, которые показывались в стоковом состоянии."
  "МПК пр.12412 — поправлено положение торпедных аппаратов при отображении корабля на расстоянии."
  "Porter (DD-356) — исправлена ошибка отсутствия палубы на надстройках."
  "Fairmile D (697) — исправлены проблемы с отображением мешка для гильз у автопушки Oerlikon."
  "БМО — исправлена проблема пропадания надстройки на дальнем расстоянии."
  "МПК пр.12412 — исправлено пропадание моделей реактивных бомб RGB 12 на корабле."
  "IJN Settsu — исправлено некорректное расположение торпедных аппаратов."
  "MS-53 — исправлено положение кормовой надстройки на неповреждённом корабле."
  "IJN Yuudachi — исправлено некорректное отображение надстройки."
  "Freccia P-493 — флаг Regia Marina заменён на послевоенный Marina Militare."
  "Garland (H37) — добавлена эмблема корабля и недостающие краны. На палубе добавлены следы от снятой кормовой башни. Удалён щит с 76-мм орудия."
  "Turbine — исправлено название корабля на спасательных кругах."
  "Bartolomeo Colleoni, Trento, Raimondo Montecuccoli, Zara, Pola — убран циферблат со 100-мм орудий."
  "SMS Von der Tann — добавлена анимация экстракции гильз у кормовой башни."
  "Тип 1939 (T31) — максимальный угол вертикального наведения орудий главного калибра увеличен с 30° до 70°."
  "HMS Southampton — исправлена форма башен главного калибра."
  "USS Helena (CL-50) — исправлена модель радара."
  "IJN Hyuga — исправлена неверная компоновка торпедных аппаратов."
  "Класс J (лидер) — отображаемые в рентгене снаряды первой очереди кормовой башни перенесены в коробки."
  "HBM Tiger II — исправлено расположение кормового боезапаса."
]}
{t="emphasis" v="Другое"}
{t="bullets" v=[
  "Clemson (DD-213) — исправлена ошибка с наличием многоразовых возрождений, поскольку корабль не является резервным."
]}
{t="h1" v="Экономика и развитие"}
"Авиационный класс техники «Штурмовик» переименован в «Ударный самолёт» и расширен за счёт добавления в него большого количества техники. Определение «штурмовик» использовалось преимущественно советской и американской школами самолётостроения, но в рамках игры техника данного класса получает ряд преимуществ в сравнении с ударными истребителями (увеличенную награду за уничтожение наземных и надводных целей; уменьшенное время перезарядки подвесного вооружения в Аркадных боях; отдельный от истребителей множитель очков возрождения в Танковых реалистичных боях), даже если близка им по своей сути. Ниже следует список машин, перенесённых в класс «Ударный самолёт» ввиду совокупности их ЛТХ, вооружения и основного типа целей в боях:"
{t="bullets" v=[
  "США: FJ-4B, AV-8C, FJ-4B VMF-232, AV-8A, F3D-1, F-84B-26, F-84G-21-RE, F-84F."
  "Германия: Bf 110 C-6, Bf 110 C-7, Bf 110 F-2, Bf 110 G-2, Bf 110 G-4, Me 410 A-1, Me 410 B-1, Me 410 B-6/R3, Do 335 A-0, Me 410 A-1/U4, Me 410 B-2/U4, Do 335 A-1, Me 262 A-1/U4, Me 262 A-1a/U1, He 219 A-7, Fw 190 F-8, F-84F (Германия)."
  "СССР: Пе-3 (р), Пе-3, Пе-3бис, ТИС МА, Як-38, Як-38М, Су-7Б, Су-7БКЛ."
  "Британия: Beaufighter Mk.VIc, Beaufighter Mk.X, Mosquito FB.Mk.VI, Mosquito FB.Mk.XVIII, Beaufighter Mk.21, Harrier GR.3, Harrier GR.1, Firecrest, Tempest Mk.V (Vickers P), Hurricane Mk.IV, Wyvern S.4, Firefly F.Mk.I, Firefly FR.Mk.V, Firebrand TF.Mk.IV, Jaguar GR.1."
  "Япония: Ki-109."
  "Китай: Mosquito FB.Mk.26, Q-5 early, Q-5A, F-84G-21-RE (Китай)."
  "Италия: Ro.57 Quadriarma, Bf 110 G-4 (Венгрия), F-84F (Италия), F-84G-21-RE (Италия)."
  "Франция: F-84F (Франция), F-84G-26-RE (Франция), F-84F (Израиль), Etendard IVM, Jaguar A."
  "Швеция: A32A"
]}
"Во избежание путаницы у класса «истребитель» удалён тип «ударный истребитель»."
{t="bullets" v=[
  "Rooikat Mk.1D — перемещён в подветку техники ЮАР."
  "PG 02 — стал доступен для покупки за Золотые орлы."
  "Sparviero — стал доступен для покупки за Золотые орлы."
]}
{t="emphasis" v="Внешний вид и достижения"}
{t="bullets" v=[
  "Rooikat 105, Rooikat Mk.1D — исправлен стандартный камуфляж. Добавлен новый трехцветный каменистый камуфляж, доступный для получения за ЗО."
  "Class 3 (P) — «Пустынный поздний» камуфляж исправлен на «Пустынный камуфляж вооруженных сил ЮАР»."
  "Опознавательные знаки и декали для следующих машин перенесены на слой стандартного камуфляжа. Ранее выданные декали остались доступны только тем, кто приобрёл технику до выхода обновления «Удар копья»: PG 02, Haida (G63), USS Bennion (DD-662), USS Cowell (DD-547), Пр. 7У Стройный."
  "Для следующих машин ранее выдаваемые декали, перенесённые в прошлых обновлениях на слой стандартного камуфляжа, остались доступны только тем, кто приобрел технику до выхода обновления «Удар копья»: СУ-76М (5гв.Кав.Корп), T-III (СССР), Grant I, КВ-220, Comet I Iron Duke IV, T-V (СССР), ИС-2 «Месть»."
  "Добавлен «Поздний однотонный камуфляж» для следующих танков Японии: M24, M4A3 (76) W, M41A1, M42."
  "Добавлены новые декораторы для Большого и Малого флота, доступные для получения за выполнение заданий и для покупки за Золотые орлы."
]}
{t="emphasis" v="Награды"}
{t="bullets" v=[
  "Медали и ордена в карточке игрока теперь показываются в виде орденских планок для тех наград, где это было предусмотрено."
]}
{t="emphasis" v="Интерфейс"}
{t="bullets" v=[
  "Опции настроек пилотажного дыма перенесены из самолётных боевых настроек в окно пробного вылета и окно возрождения многопользовательских сессий."
  "В основные параметры настроек добавлен фильтр загрузочных экранов, позволяющий исключать из ротации нежелательные загрузочные экраны (доступно с премиум-аккаунтом). Фильтр применяется только после авторизации в игре и не влияет на начальный экран в окне логина."
]}
{t="emphasis" v="Игровая механика"}
"В Танковые реалистичные бои добавлены предустановленные самолёты-носители ядерного оружия. При возрождении игрока на таком самолёте на точках захвата запускается сигнал воздушной тревоги. Бомбу можно сбросить только на танковую часть карты, поэтому у команды противника будет шанс на перехват. После успешного сброса и взрыва команде засчитывается мгновенная победа. Самолёты-носители ЯО доступны для возрождения всем игрокам при накоплении достаточного количества очков возрождения (3000 вне зависимости от БР сессии, количества возрождений на других самолётах и успешных разведок) и разделены по рангам сессии:"
{t="bullets" v=[
  "БР 6.7 — 7.7: Ту-4 / B-29A-BN;"
  "БР 8.0 — 9.0: Ил-28 / Canberra B.Mk.6;"
  "БР 9.3+: Су-7БКЛ / Jaguar A."
]}
"Таймер активности критического урона в системе зачёта уничтожения авиации разделён по уровням сложности и вместо 90 секунд теперь составляет:"
{t="bullets" v=[
  "АБ — 75 секунд;"
  "РБ — 120 секунд;"
  "СБ — 150 секунд."
]}
"Изменена механика учёта серьёзного урона в системе зачёта уничтожения авиации. Теперь по окончании таймера серьёзный урон не будет сбрасываться, а останется на цели до её уничтожения или ремонта на аэродроме, но будет иметь наименьший приоритет среди всех типов урона. Приоритет теперь выглядит следующим образом:"
{t="bullets" v=[
  "активный критический урон;"
  "активный серьёзный урон;"
  "активный простой урон;"
  "истёкший критический урон;"
  "истёкший серьёзный урон (новое)."
]}
{t="sep" v="undefined"}
{t="bullets" v=[
  "В Танковых реалистичных боях добавлена новая иконка для обозначения разведанного игрока (ранее использовалась иконка маркера попадания)."
  "В Танковых и Морских реалистичных боях для игроков на авиации добавлен маркер в мире (игровом пространстве) радиокоманды «Внимание на карту»."
  "Опции настроек отображения контента в бою «Исторический» и «Полуисторический» объединены в одну — «Кроме вымышленного». Метки исторической достоверности предметов остались без изменений и по-прежнему включают в себя три отдельных: исторический, полуисторический, вымышленный. Рекомендуется зайти в настройки внешнего вида техники и удостовериться в том, что у вас выбраны желаемые параметры."
]}
{t="h1" v="Звук"}
{t="bullets" v=[
  "Создано новое звуковое оформление для всего авиационного вооружения."
  "Создано новое звуковое оформление для орудий ПВО на авиационных картах."
  "Созданы новые звуки для разрывов снарядов ПВО в воздухе."
  "Созданы новые звуки взрывов для поддержки новых визуальных эффектов попадания снарядов по различным поверхностям (металл, грунт, песок, бетон и т.д.)."
  "Бомбы разной массы получили разные звуки взрывов. Они делятся на три группы — малые, средние, большие."
  "Теперь характер звука взрывов и выстрелов орудий зависит не только от расстояния источника звука до слушателя, но и от высоты слушателя над поверхностью земли/воды."
  "В настройках громкости звука изменён функционал регуляторов «Громкость радиопереговоров» и «Громкость диалогов и видео». «Громкость радиопереговоров» теперь отвечает только за громкость Радиосообщений команде. «Громкость диалогов и видео» отвечает за все остальные голосовые сообщения (переговоры экипажа, брифинги, туториалы и т.д.)."
  "В турнирных боях введён механизм ограничения использования пользовательских звуковых модификаций. При попытке участия в турнире с включённой звуковой модификацией будет выводиться диалоговое окно с сообщением: «Звуковые моды запрещены в выбранном режиме игры. Для выключения модов требуется перезапуск игры. Перезапустить игру ?»."
  "Двигатели танков на базе Т-34 получили аутентичный звук дизеля оригинального танка."
  "Танки Leopard 1 получили собственный звук двигателя."
  "Для ряда танков изменены привязки звуков двигателей на более соответствующие им исторически."
]}
]