;
// warning disable: -file:const-never-declared
return [
"VII ранг исследования авиации для самых современных боевых самолетов, две новые локации, пополнение техники, эффектов и другие важные и интересные изменений."
{t="h2" v="Бронетехника"}
"Встречайте пополнение из десятка новых машин! Также в игру добавлены командирские прицелы с сеткой прицела и кратностью, которая соответствует кратности прибора на реальных машинах."
{t="horizontal" halign=ALIGN_CENTER v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "Marder A1-"
      "TAM 2IP (премиумный)"
    ]}
    {t="emphasis" v="Китай"}
    {t="bullets" v=[
      "PGZ09"
      "PGZ04A"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "M47"
    ]}
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "ItO 90M"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "Т-80БВМ"
    ]}
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Concept 3 (P)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "Dardo"
    ]}
    {t="emphasis" v="Швеция"}
    {t="bullets" v=[
      "IiO 90M"
    ]}
  ]}
]}
{t="h2" v="Авиация"}
"Добавлен VII ранг исследования авиации, куда войдут наиболее современные боевые самолёты, максимальный боевой рейтинг увеличился до 11.0."
"В распоряжении пилотов появляется ещё дюжина новых крылатых машин, среди которых реактивный истребитель МиГ-23М и премиумный F-5C в камуфляже 'красной угрозы'."
{t="horizontal" halign=ALIGN_CENTER v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "МиГ-23М"
      "Су-7БМК (в составе набора)"
      "Як-28Б"
    ]}
    {t="emphasis" v="США"}
    {t="bullets" v=[
      "F-5C (в составе набора)"
      "F-5E"
    ]}
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Sea Vixen F.A.W. Mk.2 (премиумный)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "F-4F (поздний)"
    ]}
    {t="emphasis" v="Швеция"}
    {t="bullets" v=[
      "Bf 109 G-6 (премиумный)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Япония"}
    {t="bullets" v=[
      "P-51C-11-NT (премиумный)"
    ]}
    {t="emphasis" v="Китай"}
    {t="bullets" v=[
      "J-7E"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "Sagittario 2"
    ]}
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "M.D.454 Mystere IVa"
    ]}
  ]}
]}
{t="h2" v="Вертолёты"}
{t="horizontal" halign=ALIGN_CENTER v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Scout AH.Mk.1 (добавлен детальный кокпит)"
      "Lynx AH.Mk.1 (добавлен детальный кокпит)"
      "G-LYNX (добавлен детальный кокпит)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Франция"}
    {t="bullets" v=[
      "SA.316B Alouette III (добавлен детальный кокпит)"
      "IAR 316B (добавлен детальный кокпит)"
    ]}
  ]}
]}
{t="h2" v="Флот"}
"Для морских боёв прибыли 6 новых кораблей и камера слежения за полётом и падением морских снарядов."
{t="horizontal" halign=ALIGN_CENTER v=[
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="США"}
    {t="bullets" v=[
      "USS Wyoming (BB-32)"
      "USS Candid (AM-154)"
    ]}
    {t="emphasis" v="Германия"}
    {t="bullets" v=[
      "VS-8 Schell I (премиумный)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="СССР"}
    {t="bullets" v=[
      "Пр.30-бис Безупречный"
    ]}
    {t="emphasis" v="Британия"}
    {t="bullets" v=[
      "Класс Leopard (F-14)"
    ]}
  ]}
  {t="vertical" margin=[0, fpx(50)] v=[
    {t="emphasis" v="Италия"}
    {t="bullets" v=[
      "Dante Alighieri"
    ]}
  ]}
]}
{t="h2" v="Новые локации и миссии"}
{t="bullets" v=[
  "Новая локация для смешанных боёв: «Красные пески»."
  "Новая локация для малого флота: «Затонувший город»."
]}
"Локации и миссии"
{t="h2" v="Изменения в локациях и миссиях"}
{t="bullets" v=[
  "Добавлена анимация работы мельниц и нефтекачек, находящихся вдали от игрока (ранее анимация работала только на ближних и средних дистанциях)."
  "Исправлены визуальные недостатки снега на локации «Сталинград — танковое сражение»."
  "В миссиях авиационных РБ, в которых в предыдущих обновлениях была добавлена зависимость аэродромов от ранга боёв, в качестве аэродромного ПВО на высоких рангах теперь используются современные зенитные установки, включая ракетные."
  "Зависимость аэродромов от ранга боёв добавлена в следующие миссии: Операция «Сицилия», Операция «Корея», Операция «Рур», Операция «Тунис», Операция «Чжэнчжоу», Операция «Гражданская война в Китае 1946»."
  "Глобальная переделка визуальной части локации «Тихоокеанская секретная база»."
]}
{t="h2" v="«Противостояние»"}
{t="bullets" v=[
  "Перевод существующих миссий Противостояния на новую логику будет происходить поэтапно в рамках обновления «Красные небеса», по мере выхода минорных обновлений."
  "В миссиях «Линия Мажино», «Тунис», «Чжэнчжоу» и «Гражданская война в Китае 1946» была добавлена зависимость аэродромов от ранга боёв. В качестве аэродромного ПВО на высоких рангах теперь используются современные зенитные установки, включая ракетные."
]}
"«Сицилия» — миссия возвращена в ротацию. Она основывается на сильно измененной логике «Противостояния», на которую со временем будут переведены остальные миссии. Полный список изменений (очень большой) был привёден в перечнях изменений предыдущих обновлений, когда проходило тестирование новой логики. Дополнительные изменения в миссии:"
{t="bullets" v=[
  "Карта миссии теперь развернута на 90 градусов, чтобы у каждой команды был участок с морем и участок с сушей."
  "Каждая команда теперь обладает собственным авианосцем."
  "Размер карты миссии увеличен и составляет теперь 8x8 секторов (ранее был 7x7). Размер рёбер (сторон) секторов остался прежним и равен 8192 метра."
  "В качестве аэродромного ПВО на высоких рангах теперь используются современные зенитные установки, включая ракетные."
]}
"В тестовый режим (доступен только для создания в пользовательских комнатах) добавлено новое противостояние «Дания» с размерами 128x128 км."
{t="bullets" v=[
  "Известная ошибка: из-за проблем в корабельном ИИ, исправление которых зависит от внесения изменений в код игры, корабли, участвующие в морских сражениях или идущие по маршрутам, могут сталкиваться и застревать."
]}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения наземной техники"}
{t="bullets" v=[
  "Улучшен алгоритм наведения управляемых ракет с полуавтоматической системой наведения. Новый алгоритм гораздо лучше учитывает движение цели или носителя, наводит точнее и не приводит к раскачке траектории некоторых ракет как при автоматическом, так и при ручном слежении за целью. Алгоритм работает для всех ЗУР с полуавтоматическим наведением, а также для запускаемых с земли и с вертолётов ПТУРов."
  "Убрано ограничение на возможность пуска ракет с ходу для ЗСУ Sidam Mistral."
  "В анализатор защиты и в камеру попаданий в игре добавлено отображение воздействия повышенного давления."
  "Новые физически достоверные гусеницы получили следующие танки и САУ: Германия: Panther A, Panther D, Panther F, Panther G, Jagdpanther, Bfw.Jagdpanther, Tiger H1, Tiger E. Франция: Panther 'Dauphine'. Китай: CM11. Япония: Heavy Tank No.6. СССР: T-V."
  "T-90А — снаряд I уровня модификаций 3БМ22 заменён на снаряд 3БМ42. Снаряд IV уровня модификаций 3БМ42М заменён на 3БМ46."
  "Т-80У — снаряд I уровня модификаций 3БМ22 заменён на снаряд 3БМ42. Снаряд IV уровня модификаций 3БМ42 заменён на 3БМ46."
  "T-72Б3 — снаряд I уровня модификаций 3БМ22 заменён на снаряд 3БМ42. Снаряд IV уровня модификаций 3БМ42 заменён на 3БМ60."
  "Leopard 2A6, Strv 122B PLSS — удалено балансное снижение скорострельности."
  "Leclerc S1, S2 — тепловизор командира заменён на ИК-прибор ночного видения. Источник: Tankograd Nr.8001, Leclerc // Editions Techniques pour l'Automobile et l'Industrie, Char Leclerc //."
  "M48 Super — временно убраны физически достоверные гусеницы."
  "Type-74, Type-74F, Type-74G — броня маски орудия переведена на объемное бронирование."
  "M60A1, M60A1 'D.C.Ariete', M60A1 RISE(P), M60A3 TTS, M60A3 TTS(Китай), M60 AMBT — броня башни переведена на объемное бронирование."
  "Leopard 2A4, Strv 121 — комбинированная броня переведена на объемное бронирование. Бронестойкость скорректирована и стала более корректной для курсовых углов. Ослабленные зоны из за конструктивных особенностей прицела наводчика стали более выраженными."
  "Challenger Mk.2, Challenger Mk.3, Challenger 2, Challenger 2 (2F) — наполнитель комбинированного бронирование переведен на объемное бронирование"
  "M1, IPM1, M1A1 — броня башни и лобовой проекции корпуса переведена на объемное бронирование."
]}
{t="emphasis" v="Исправления характеристик, моделей повреждения и вооружения авиации"}
{t="bullets" v=[
  "FJ-4B VMF-232 — добавлен пресет с четыремя AIM-9B."
  "F3H-2 — в номенклатуру вооружения добавлена ракета AIM-7C."
  "Javelin F.(A.W.) Mk.9 — в пресете 4х Firestreak убрана внешняя пара пушек."
  "T2 — удалена модификация AIM-9B, пресеты с 2х AIM-9B стали доступны без необходимости открытия этой модификации. Опыт или Золотые орлы, потраченные на открытие модификации, будут возвращены на аккаунт."
  "Mirage IIIC — удалена модификация AIM-9B, пресеты с 2х AIM-9B стали доступны без необходимости открытия этой модификации. Опыт или Золотые орлы, потраченные на открытие модификации, будут возвращены на аккаунт."
  "Mirage IIIE — удалена модификация AIM-9B, пресеты с 2х AIM-9B стали доступны без необходимости открытия этой модификации. Опыт или Золотые орлы, потраченные на открытие модификации, будут возвращены на аккаунт."
  "Lightning F.6 — удалена модификация Firestreak, пресеты с 2х Firestreak стали доступны без необходимости открытия этой модификации. Опыт или Золотые орлы, потраченные на открытие модификации, будут возвращены на аккаунт."
  "НС-45 — добавлен бронебойно-трассирующий снаряд (Источник: сравнительная таблица основных характеристик 45-мм. авиационных автоматических пушек ОКБ-15 и ОКБ-16 по результатам государственных испытаний в НИИ АВ ВВС КА)."
  "Ho 229 v.3 — в ленту «бронецели» добавлен бронебойный подкалиберный трассирующий снаряд."
  "P-63A-5, P-63C-5, P-63A-10 — 500-фунтовая бомба в номенклатуре подвесного вооружения заменена на ФАБ-250."
  "P-400 — в номенклатуру подвесного вооружения добавлена бомба 500 фунтов."
  "P-39K-1, P-39Q-15 — в номенклатуру подвесного вооружения добавлена бомба ФАБ 250."
  "P-39N-0, P-39Q-5 — в номенклатуру бомбового вооружения добавлена бомба 500 фунтов."
  "Do-217E-2, Do-217E-4 — добавлен раздельный сброс бомб калибра 250, 500 и 1000 кг."
  "F9F-8 — тип 1000-фунтовой авиационной бомбы исправлен с AN-M65 на LDGP Mk 83."
  "F-4EJ Phantom II — исправлена ошибка, из-за которой невозможно было выбрать ленту для подвесных пушек."
  "F.222.2 — исправлено несоответствие моделей пулемётов и их названий."
  "J35D — исправлена ошибка, из-за которой для комплектов вооружения с m/56d требовалось изучить модификацию m/57d."
  "Ка-29 — исправлена ошибка, из-за которой пушка 2А42 не была назначена как «дополнительная»."
  "Ми-24П (Германия) /  Mi-24P HFS 80 - в номенклатуру вооружения добавлена возможность устанавливать дополнительный комплект ПТУР 9M114."
  "A-4E Early — курсовые пушки исправлены с Mk 12 Mod 3  на Mk 12 Mod 0."
  "Buccaneer S.2 — исправлено некорректное отображение некоторых пресетов в меню выбора подвесного вооружения."
  "F-4E Phantom II — в состав вооружения добавлены AGM-65B Maverick."
  "Бомба GP 50 — масса бомбы и масса взрывчатого вещества исправлены до 59 кг при 29,2 кг тротила."
  "Browning M2 — исправлена ошибка, из-за которой скорострельность пулемёта могла различаться в зависимости от самолёта. Скорострельность везде приведена к показателю 750 выстрелов в минуту."
  "F8U-2 — исправлено название модификации для ракет ZUNI."
  "Q-5A — исправлено отсутствие выбора различных вариантов контрмер (ЛТЦ и ДО)."
  "MiG-21MF — добавлена система предупреждения об облучении."
  "F7F-3 — в состав вооружения добавлены мины 1000lb Mk12 Mod 0."
  "Phantom FGR.2 — в состав вооружения добавлены AIM-9G."
  "Phantom FG.1 — в состав вооружения добавлены AIM-9G."
  "A129CBT — исправлена ошибка, из-за которой модификации ЛТЦ/ДО или СОЭП взаимо отключали друг друга при установке."
  "Исправлено некорректное открытие пресетов вооружения при изучении модификаций FN GMP400 LCC и  FN RMP LC."
  "Для части вертолётов набивка лент пулемётного вооружения исправлена на поздний вариант."
  "AIM-9D / AIM-9G — располагаемая перегрузка увеличена до 18G."
]}
"Для большинства самолётов ранга VI и выше, имеющих в составе вооружения ракеты «воздух — воздух», добавлены пресеты с этими ракетами, не требующие открытия модификаций. Такие пресеты доступны на тех самолётах, в составе вооружения которых присутствуют ракеты различных модификаций, а также тех, что могут использовать более двух ракет одной модификации. Список самолётов, получивших пресеты с ракетами «воздух — воздух» по умолчанию без необходимости прокачивать модификации:"
{t="bullets" v=[
  "FJ-4B — добавлен пресет 2х AIM-9B"
  "FJ-4B VMF-232 — добавлен пресет 2х AIM-9B"
  "F9F-8 — добавлен пресет 2х AIM-9B"
  "F11F-1 — добавлен пресет 2х AIM-9B"
  "F3H-2 — добавлен пресет 2х AIM-9B"
  "F-100D — добавлен пресет 2х AIM-9B"
  "F8U-2 — пресет 2х AIM-9B стал доступен без необходимости открытия этой модификации"
  "A-7D — добавлен пресет 2х AIM-9B"
  "Phantom FGR.2 — добавлен пресет 2х AIM-9D и 1х SUU-23/A на центральном пилоне."
  "Phantom FG.1 — добавлен пресет 2х AIM-9D и 1х SUU-23/A на центральном пилоне."
  "F-4C — добавлен пресет 2х AIM-9B и 1х SUU-23/A на центральном пилоне."
  "F-4E — добавлен пресет 2х AIM-9B"
  "F-4F Early — добавлен пресет 2х AIM-9B FGW.2"
  "F-5С — добавлен пресет 2х AIM-9B"
  "F-104G — добавлен пресет 2х AIM-9B"
  "MiG-21MF — добавлен пресет 2х R-3S"
  "МиГ-21СМТ — добавлен пресет 2х Р-3С"
  "МиГ-21бис — добавлен пресет 2х Р-3С"
  "Су-17М2 — добавлен пресет 2х Р-60"
  "Javelin F.(A.W.) Mk.9 — добавлен пресет 2х Firestreak"
  "Scimitar F Mk.1 — добавлен пресет 2х AIM-9B"
  "Hunter F.6 — добавлен пресет 2х SRAAM"
  "Lightning F.6 — пресеты с 2х Firestreak стали доступны без необходимости открытия этой модификации"
  "F-1 — добавлен пресет 2х AIM-9B"
  "F-4EJ — добавлен пресет 2х AIM-9B"
  "F-104J — добавлен пресет 2х AIM-9B"
  "F-104G (китай) — добавлен пресет 2х AIM-9B"
  "F-104S — добавлен пресет 2х AIM-9B"
  "F-100A — добавлен пресет 2х AIM-9B"
  "F-100D (Франция) — добавлен пресет 2х AIM-9B"
  "J32B — добавлен пресет 2х RB24"
  "J35D — добавлен пресет 2х RB24"
  "T2 — пресеты с 2х AIM-9B стали доступны без необходимости открытия этой модификации"
]}
{t="emphasis" v="Другое"}
{t="bullets" v=[
  "J-4, J-2 — исправлена ошибка, из-за которой при использовании бомб ОФАБ-250 после взлета можно было включить бомбовый прицел."
  "Hornet Mk.III — добавлена модификация «Топливо 150 октан»."
  "SAAB B17B - исправлена ошибка, из-за которой на самолете дублировался комплект подвесного вооружения."
  "He-219 A-7 - исправлена ошибка, из-за которой в бронирование правого двигателя отличалось от левого на 1 мм."
  "B6N1, B6N2, B6N2a — исправлена ошибка, из-за которой восстанавливались непротектированные баки."
  "Ki-45 otsu, Ki-45 hei — исправлена ошибка, из-за которой в меню модификаций отсутствовал модуль «компрессор»."
  "P-61C-1 — исправлено визуальное отображение поломки винта на левом двигателе."
  "P-40F-5 — исправлена ошибка, из-за которой не восстанавливались протектированные баки."
  "Ми-28Н — исправлены углы наведения, захвата и сопровождения цели."
  "B6N1, B6N2, B6N2a — убрана ошибочная надпись о наличии прототипа кабины."
  "F6F-5, F6F-5n — конус захвата РЛС исправлен до 7.5 градусов."
  "Harrier GR.1 — для некоторых наборов пресетов вооружения исправлено отображение пушки в режиме рентгена."
  "Ми-28Н — переработано бронирование."
  "Исправлена ошибка, из-за которой на ряде бомбардировщиков количество точек оборонительного вооружения не соответствовало количеству стрелков."
  "Исправлена ошибка с локализацией для некоторых авиационных модификаций."
  "Установлены правильные изображения бомбовой нагрузки в меню подвесного вооружения для следующих самолетов: F.222.2, N.C.223.3, Potez 633, LeO 451 early, LeO 451 late, M.B.162."
  "Стабилизатор разделен на две части в модели повреждений для самолетов следующий стран (США, СССР, Германия, Франция, Китай) и вертолетов. Теперь при повреждении части стабилизатора будет отрываться именно она, а не обе. Оставшиеся страны (Британия, Япония, Италия, Швеция) будут добавлены позже."
]}
{t="h2" v="Изменения в лётных моделях"}
{t="bullets" v=[
  "G8N1, Ki-49 (вся линейка), P-39 (вся линейка), P-40 (вся линейка) — обновлена лётная модель. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Уточнено поведение самолёта при выпуске механизации."
  "H8K (вся линейка) — обновлена летная модель. Уточнены режимы работы двигателя. Скорректировано распределение топлива по бакам. Пересчитаны и уточнены поляры крыла, фюзеляжа, оперения и лопастей винта. Улучшена мореходность, облегчены взлёт и посадка."
]}
{t="h2" v="Исправления характеристик, моделей повреждения и вооружения флота"}
{t="emphasis" v="Вооружение:"}
{t="bullets" v=[
  "Морские мины — время жизни мин увеличено до 15 минут. Боезапас мин во всех режимах и на всех кораблях, где они имеются на вооружении, сделан непополняемым — каждый такой корабль может поставить мины один раз за выход, без возможности их пополнения."
  "Увеличена дистанция обнаружения мин и торпед. Для обнаружения вражеских торпед она зависит от размеров и высоты корабля, и примерно равна: для катеров - 100-200м для эсминцев - 400-500м для крейсеров и линкоров - 600-700м."
  "Мины обнаруживаются на дистанции, примерно в два раза меньше указанных."
  "Расстояния обнаружения союзные мин и торпед в два раза больше. "
  "Теперь при переключении группы вооружения в то время, когда орудия ещё не успели навестись в точку прицеливания, орудия продолжат наведение в данную точку. Работает при условии отключённого целеуказания для ИИ-стрелков."
  "У всех кораблей, имеющих запас глубинных бомб, были убраны погреба с бомбами. Весь запас бомб теперь находится на стеллажах возле бомбомётов."
  "100-мм/70 орудие СМ-5-1 (Чапаев, Свердлов, Железняков) — зенитный снаряд с дистанционным взрывателем ЗС-56 заменён на ЗС-55."
  "Императрица Мария, Полтава — исправлены характеристики 4500-мм торпеды обр. 1912 г."
  "IJN Agano — скорострельность 80-мм/60 орудия Type 98 увеличена до 25 выстр/мин. В соответствии с историческими данными с центральной надстройки корабля удалены два строенных 25-мм орудия."
  "RN Aquilone — исправлена стрельба ИИ по воздушным целям. Увеличена дистанция открытия огня и точность. Исправлена ошибка с уменьшенной максимальной дистанцией полёта снарядов ГК."
  "Огневой, Ташкент — количество первых выстрелов увеличено до 24."
  "Бронебойным снарядам орудий 152-мм/47 Mk.16 и 203-мм/55 Mk.14 (USS Cleveland, USS New Orleans) исправлены параметры лобового сопротивления, что повлекло изменения в бронепробитии."
  "HMS Invincible — добавлен кормовой торпедный аппарат и погреба с торпедами."
  "HMS Dreadnought — добавлены кормовые торпедные аппараты и погреба с торпедами. Положение носовых торпедных аппаратов изменено в соответствии с чертежами."
  "USS Baltimore — исправлены вертикальные углы наведения 40-мм орудий 'Bofors'."
  "USS Baltimore, USS Helena — для 127 mm\\38 Mk.12 орудий добавлен полубронебойный снаряд Mk.46."
  "HMS Liverpool — добавлены 152-мм и 102-мм снаряды с радиовзрывателем."
  "RN Pola, RN Zara, RN Trento — исправлен излишне большой разброс орудий 203-мм/53 Ansaldo mod.1927, mod.1924."
  "Фрунзе — исправлена ошибка, из-за которой было невозможно взять в бой полный боекомплект 45-мм снарядов."
  "SMS Von der Tann, SMS Helgoland, SMS Kaiser — из бортовых торпедных аппаратов убрано по одной торпеде в местах расположения специального приспособления 'spoon', защищавшего торпеду перед пуском. Торпеды перенесены в погреба боезапаса."
]}
{t="emphasis" v="Модификации и навыки экипажа:"}
{t="bullets" v=[
  "PT-109 — удалена лишняя модификация с глубинными бомбами."
]}
{t="emphasis" v="ТТХ, физика и модель повреждений флота"}
{t="bullets" v=[
  "Модель повреждения эсминцев изменена и теперь соответствует «крейсерской». Корпус поделён на затопляемые отсеки, вмещающие в себя остальные модули. Экипаж расположен в нескольких внутренних помещениях, откуда он может распределяться по несущим экипаж модулям."
  "Пролом брони взрывом — в Морских боях появилась механика пролома брони взрывом для всех фугасных снарядов с мгновенным взрывателем. При детонации снаряда на преграде проверяется её пробитие взрывом. При достаточной силе взрыва в преграде пробивается брешь, в которую устремляются газы и сноп осколков. Это позволило оптимизировать количество вычислений при взрывах на броне, привести к единому расчёту силу и урон осколков и секторы их разлёта. ОФ снаряды стали более эффективно поражать модули и экипаж внутри корабля, если им хватает пробития взрывом."
  "На всех крупных кораблях переработана модель повреждения открытых артиллерийских установок и установок с открытыми щитами. Теперь они в большей степени подвержены повреждениям от близких разрывов и осколков."
  "Убраны лишние места появления пробоин. Пробоины ставятся только на обшивке корабля."
  "Исправлена ошибка с вероятностью детонации собственных торпед. Шанс на подрыв торпеды при её уничтожении составляет 3 — 7% (в зависимости от условий уничтожения). Также присутствует небольшой шанс детонации при воздействии на торпеду сильного пожара. При детонации одной торпеды, остальные  оказавшиеся в зоне её взрыва торпеды могут сдетонировать на тех же условиях. Проверка вероятности происходит для каждой торпеды индивидуально. Сила взрыва торпеды зависит от типа и количества ВВ в её боевой части и наносит соответствующие повреждения кораблю в своём радиусе. Таким образом, взрыв торпеды в аппарате или в погребе не обязательно повлечёт мгновенную гибель корабля, но такое возможно. Также возможна и цепная детонация всех торпед, попавших под воздействие взрыва."
  "Nurnberg — исправлены форма и толщина бронепоясов и бронепалуб. Исправлено бронирование носовых погребов, барбетов, боевой рубки. Добавлено бронирование дальномерных постов. Исправлено количество и расположение погребов боезапаса. Добавлены бронированные щитки для шести спаренных 20-мм установок."
  "SMS Kaiser — исправлена ошибка, из-за которой в бою был не доступен выбор изученных снарядов для 150-мм артиллерии. 88-мм орудия перенесены в группу зенитного вооружения."
  "IJN Ikoma — исправлено бронирование башен ГК."
  "IJN Tone — в бронепалубе над погребами добавлены 50-мм кольца внутри барбетов."
  "Красный Крым, Красный Кавказ, HMS Kent — исправлен излишний крен на циркуляции."
  "HMS Southampton — исправлена форма и расположение топливных цистерн. Исправлены толщина и материалы бронирования (барбеты, бортовая броня погребов, башни ГК)."
  "Syonan — исправлено расположение и размер боеукладки, топливных цистерн, машинного отделения. Добавлены элеваторы подачи боезапаса и визуальная модель радарного устройства."
  "IJN Kiyoshimo — изменена модель надстройки и дымовой трубы для вращения первого торпедного аппарата на 360 градусов."
  "Керчь — исправлено некорректное вооружение в карточке. Добавлены две запасные торпеды. Исправлены неверные ТТХ установленных на корабле торпед обр. 1910 г."
  "HMS Liverpool — исправлены толщина и материалы бронирования (барбеты, броня погребов, бронепалубы)."
  "USS Brooklyn, USS Helena — исправлена некорректная толщина бронирования башен главного калибра."
  "RN Trento — исправлены размеры, количество и расположение топливных баков."
  "USS Cleveland — изменена толщина тыловой части брони башен главного калибра."
  "IJN Hyuga — удалены зазоры в бронировании на стыке бронепояса и казематов 150-мм орудий."
  "T22, T31, Leipzig — добавлены бронированные щитки для 20-мм установок."
  "Anton Schmitt (Тип 1936) — добавлены бронированные щитки для четырёхствольной 20-мм установки."
  "PT-6 — исправлена ошибка с невозможностью ремонта уничтоженной водоотливной помпы."
  "Z32 (Type 1936A) — исправлено отображение подсказки глубинных бомб на бомбомётах в рентгене."
  "IJN Isuzu — исправлено несоответствие скорости корабля в карточке и в бою."
  "PC-451 — исправлено отображение подсказок погребов боезапаса и водоотливных помп в рентгене."
  "Железняков, Свердлов, Чапаев, HMCS Haida — исправлена ошибка выходящих за пределы корпуса внутренних модулей корабля."
  "USS Helena - в соответствии с историческими данными, убрано бронирование боевой рубки."
]}
{t="emphasis" v="Модели кораблей, визуальная часть"}
{t="bullets" v=[
  "На советских бронекатерах исправлена ошибка отображения поворота башен при взгляде с дистанции, из-за которой развёрнутые на борт башни отображались в походном положении."
  "Росомаха, Енот — исправлена ошибка, из-за которой невозможно было расположить декоратор на палубе."
  "Полтава — исправлено отображение брезентового чехла орудийной маски третьей башни ГК."
  "HMCS Brantford (Класс Flower (K-218)) — исправлено расположение навигационных огней."
  "PT-15 (Type 11) — исправлено отображение антенн при взгляде на катер с дистанции."
  "USS Fletcher — исправлена ошибка с висящей в воздухе антенной радара в уничтоженном состоянии."
  "Leipzig — исправлена модель кормовой надстройки. Модель корабля приведена к состоянию до аварии с кораблём Prinz Eugen в 1944 году."
  "HMS Hawkins — изменено положение погребов боезапаса орудий главного калибра."
  "HMS Dido, HMS Arethusa — визуальное отображение количества и расположения двигателей изменено на исторически верное."
  "IJN Agano — исправлена надстройка центральной части корабля."
  "RN Pola — исправлена ошибка с наличием кормового якоря, который в конфигурации 1941 года отсутствовал."
  "RN Turbine, RN Aquilone — добавлены названия кораблей золотыми буквами на корме."
  "HMNZS Leander — исправлена ошибка с отсутствием участка палубы в носовой оконечности."
  "USS Aylwin (Farragut (DD-355)) — машинное отделение переделано в соответствии с предоставленными чертежами."
  "RN Geniere — исправлено отображение ограждения мостика в разрушенном состоянии."
  "Karl Galster, Anton Schmitt (Тип 1936(1941)) — удалено лишнее перо руля."
  "SF40 лёгкая — Исправлена ошибка соответствия погребов боезапаса своим орудиям, возле которых они располагаются. Ранее некоторые орудия пополнялись из погребов, расположенных на противоположном борту."
  "IJN Kako — убрано отображение глубинных бомб в рентгене в тех модификациях, где они должны отсутствовать."
  "JDS Yūgure (DD-184) — исправлена транскрипция надписи и номера. Добавлено название корабля на корму."
]}
{t="emphasis" v="Локализация"}
{t="bullets" v=[
  "Comandanti Medaglie d'Oro — исправлено имя корабля. Вместо названия серии Comandanti Medaglie d'Oro корабль получил имя Commandante Margottini."
]}
{t="emphasis" v="Интерфейс"}
{t="bullets" v=[
  "Названия кораблей в дереве исследования, карточках и в бою изменились. Некоторые корабли получили имена собственные. Некоторые - новые бортовые номера или указание серии или класса. Переработано государственное именование в соответствии с историческим периодом. Например, корабли Италии периода монархии получили буквы RN перед именем."
  "Следующие корабли получили новые имена и названия:"
  "Тип 1934a(1944) – Z15 Erich Steinbrinck, Тип 1934a(1940) – Z12 Erich Giese, Тип 1936(1941) – Z22 Anton Schmidtt, 1940, Тип 1936A(mob) – Z32, Тип 1936b – Z43, Тип 1936b – Z32, S-100 (1944) – S-100, S-100 (1945) – S-147, Тип М(1943) – M-802, Пр.7У – Сообразительный, 1943, Пр.159 – СКР-1, Пр.35 – СКР-7, Clemson (DD-336) – USS Litchfield, Clemson (DD-213) – USS Barker, Farragut (DD-355) –  USS Aylwin, Town(L45) – HMS Churchill, Класс G – HMS Grafton, Класс N – HMS Nepal, Класс K – HMS Kelvin, Класс J – HMS Jervis, Battle (D14) – HMS Armada, Battle (D37) – HMAS Tobruk, Tribal – HMS Eskimo, Hunt (L71) – HMS Calpe, Hunt (L79) – HMS Brissenden, Dark(FPB 1101) – Dark Adventurer, Dark(FPB 1102) – Dark Aggressor, Класс Isles – HMS Liscomb, Класс Flower – HMS Brantford, Класс River – HMS Spey, SGB(S309) – SGB Grey Goose, SGB(S304) – SGB Grey Fox, Тип Brave – Brave Borderer."
  "Исправлена рассинхронизация (отставание) прицельного маркера от перекрестия в бинокле при наведении в движении."
  "Рентген танка в ангаре дополнен отображением дополнительных функций члена экипажа, отличных от основной роли."
  "В корабельных боях убрана задержка при вертикальном наведении орудия."
]}
{t="emphasis" v="Другое"}
{t="bullets" v=[
  "Добавлено сочетание клавиш по умолчанию для пристрелочного выстрела — L.Ctrl+LMB."
]}
{t="h2" v="Экономика и развитие"}
{t="bullets" v=[
  "В игре появились VII ранг исследования и новый максимальный боевой рейтинг для авиации — 11.0. Боевой рейтинг изменён с 10.7 до 11.0 для следующих самолётов: F-4E Phantom II, МиГ-21бис, Phantom FGR.2, Phantom FG.1, F-4EJ Phantom II, Mirage IIIE."
  "Изменения в рангах:"
  "F-4E Phantom II — перенесён с VI на VII ранг. A-7D — перенесён после AV-8C с VI на VII ранг. МиГ-21МФ — перенесён с VI на VII ранг. МиГ-21СМТ — перенесён с VI на VII ранг. МиГ-21бис — перенесён с VI на VII ранг. Су-17М2 — перенесён с VI на VII ранг. Як-38 — перенесён с V на VI ранг. Phantom FGR.2 — перенесён с VI на VII ранг. Phantom FG.1 — перенесён с VI на VII ранг. Harrier GR1 — перенесён с V на VI ранг. AV-8A — перенесён с V на VI ранг. F-4EJ Phantom II — перенесён с VI на VII ранг. F-104G — перенесён с VI на VII ранг. F-5A — перенесён с VI на VII ранг. Mirage IIIC — перенесён с VI на VII ранг. Mirage IIIE — перенесён с VI на VII ранг. J35D — перенесён с VI на VII ранг. F-4F Early — перенесён с VI на VII ранг. Bf 109 G-2 — перенесён на IV ранг."
  "Meteor F Mk.8 Reaper (премиумный) — цена покупки увеличена с 8090 до 8380 ЗО."
  "Harrier GR.1 (премиумный) — цена покупки увеличена с 8910 до 9090 ЗО."
  "G.91 R/4 (италия премиумный) - стал доступен для покупки за золотые орлы."
  "Изменено требуемое количество техники для открытия следующего ранга в дереве развития бронетехники Китая: на 1 ранге: 6 → 5 на 2 ранге: 5 → 6 на 5 ранге: 4 → 5"
  "Изменения в дереве развития бронетехники Китая: M3A3 и M5A1 — сгруппированы. M24 — перенесён на позицию после группы M3A3 и M5A1. Chi-Ha Kai — перенесён на II ранг. M4A4 и M4A1 (75) W — перенесены в линейку после Т-34 (1943). Т-34-85 Gai — перенесён на IV ранг."
  "Изменения в дереве развития бронетехники Германии: Pz.IV G — перенесён на II ранг."
  "Диапазон Боевых рейтингов наземной техники расширен до БР 11.0. ОБТ, имевшие БР 10.7, повышены до БР 11.0: Challenger 2 (2F) — 11.0 Leclerc S1, S2 — 11.0 Leopard 2A5, 2A6 — 11.0 Strv 122A — 11.0 Strv 122B PLSS — 11.0 Ariete PSO — 11.0 Type 90, 90B - 11.0 M1A2 - 11.0 Т-72Б3 — 10.7 Т-80У — 10.7 Т-90А — 10.7 ZTZ99 - 10.7."
  "SGB Grey Fox и Fairmile D (697) поменяны местами в дереве развития. "
  "USS Northampton — перенесен на IV ранг. Снижена стоимость изучения с 610000 до 360000."
]}
{t="h2" v="Внешний вид и достижения"}
{t="bullets" v=[
  "Для поздних танков США обновлены камуфляжные схемы MERDC."
  "Для поздних танков США добавлены новые камуфляжные схемы MERDC 'Red Desert' и 'Summer Verdant'."
  "Для танков Германии добавлены новые трёхцветные камуфляжные схемы MHN и MAN."
  "Обновлены зимние одноцветные камуфляжи СССР, Германии, США."
  "Обновлены деформирующие схемы окраски поздних танков Швеции."
  "Tiger H1 — добавлен «Однотонный серый камуфляж», доступный для покупки за ЗО."
  "IiO 90M (Швеция) — добавлен набор финских паттернов."
  "Добавлена новая боевая награда для наземной техники — «Огнеборец». Выдаётся за тушение пожара техники союзника в рамках новой игровой механики помощи в пожаротушении."
]}
{t="h2" v="Интерфейс"}
{t="bullets" v=[
  "При создании миссии в полигоне добавлен фильтр по типу техники и типу миссии."
  "В анализе защищенности в ангаре добавлено отображение курсового угла направления атаки."
  "В анализе защищенности добавлена возможность стрельбы отдельными снарядами из лент автоматических пушек."
]}
{t="h2" v="Игровая механика"}
{t="bullets" v=[
  "В Танковые бои добавлена механика помощи в пожаротушении. Возможность пожаротушения всех союзников доступна лёгким танкам, а при игре в отряде можно оказать соответствующую помощь любому члену отряда вне зависимости от техники игрока (по аналогии с помощью в починке). Для оказания помощи у союзника не должно быть возможности потушиться самостоятельно — модуль ППО отсутствует или кончился его запас. При помощи в пожаротушении игрок потратит одну единицу собственного запаса ППО."
  "В Танковые реалистичные бои добавлена механика автоматического ввода в прицел поправки на дальность по результатам замера дальности лазерным дальномером, аналогичная уже существующей в СБ. Механика доступна только на тех танках, СУО которых имела такую возможность в реальности."
  "Множитель скорости торпед в Аркадных боях заменён с константы, равной 3, на кусочно-линейную зависимость от пройденной дистанции: до 4 км — множитель равен 3; от 4 до 8 км — множитель линейно падает от 3 до 1; свыше 8 км — множитель равен 1."
]}
"Для некоторых танков рангов с IV по VII добавлена механика командирских прицелов. Список предварительно настроенных машин (будет дополняться по мере добавления механики на другие машины):"
{t="bullets" v=[
  "США: HSTV-L, M103, M1128, M1A2 Abrams, M247, M3A3 Bradley, M41A1, M47, M48A1, M60, M60A1 (AOS), M60A1 RISE (P), M60A2, M60 AMBT, M60A3 TTS, M901, Magach 3, MBT-70, Merkava Mk.1, Merkava Mk.2B, Merkava Mk.3D, T54E1, T92, T95E1, XM-803."
  "Германия: Begleitpanzer 57, SPz BMP-1, Gepard, JPz 4-5, KPz-70, Leopard 1A5, Leopard 2A4, Leopard 2A5, Leopard 2A6, Leopard 2K, Leopard 2 PL, Leopard A1A1 (L/44), C2A1, Leopard I, Leopard A1A1, Marder A1-, mKPz M47 G, M48A2 C, M48A2 G A2, M48 Super, Jagdtiger, Radkampfwagen 90, JaPz.K A2, Class 3 (P), TAM, TAM 2C, TAM 2IP."
  "СССР: БМП-1, БМП-2М, ИС-3, ИС-4М, ИС-7, ИТ-1, Объект 120, Объект 268, Объект 279, Объект 685, Объект 906, ПТ-76Б, СУ-122-54, Т-10A, Т-10М, Т-54 (1947), Т-54 (1949), Т-54 (1951), Т-55АМ-1, Т-55А, Т-62, Т-62М-1, Т-64Б, Т-64А (1971), Т-72АВ (TURMS-T), Т-80Б, Т-80БВМ, Т-80У, Т-90А, Type 62, ЗПРК 2С6, ЗСУ-23-4, ЗСУ-37-2."
  "Британия: Centurion Action X, Centurion Mk.10, Centurion Mk.3, Strv 81 (RB 52), Centurion Mk.5/1, Challenger Mk.2, Challenger 2 (2F), Challenger 2, Challenger Mk.3, Chieftain Marksman, Chieftain Mk.10, Chieftain Mk.3, Chieftain Mk.5, Conqueror, Falcon, Striker, Caernarvon, FV4202, Warrior, Olifant Mk.1A, Olifant Mk.2, Rooikat 105, Rooikat Mk.1D, Rooikat MTTD, ZA-35, Stormer HVM, TTD, VFM5, Vickers MBT, Vickers Mk.7."
  "Япония: M41A1, M47, ST-A3, STB-1, Type 16, Type 61, Type 74, Type 74 F, Type 74G, Type 89, Type 90, Type 90 (B)."
  "Китай: M48A1, M60A3 TTS, PGZ09, PT-76, PTL02, PTZ89, Т-62 №545, Type 59, ZTZ59D1, Type 62, Type 63-I, Type 69, T-69 II G, ZBD86, WMA301, ZTZ99."
  "Италия: Centauro, Centauro ROMOR, Ariete, Ariete (P), Ariete PSO, Centauro MGS, Leopard 1A5, M47 (105/55), M60A1 'D.C.Ariete', OF-40, OF-40 Mk.2A, OF-40 (MTCA), OTOMATIC."
  "Франция: AMX-10RC, AMX-30, AMX-30 (1972), AMX-30 ACRA, AMX-30B2, AMX-30B2 BRENUS, AMX-30 DCA, AMX-32, AMX-40, AMX-50 Foch, AMX-50 Surbaissé, AMX-50 Surblindé=, Leclerc, Leclerc S2, MARS 15, SK-105A2."
  "Швеция: CV 90105 TML, CV 90120, Strv 101, Strv 104, Strv 121, Strv 122A, Strv 81, Strv 81 (RB 52)."
]}
"Для некоторых танков рангов c V по VII добавлена механика использования командиром дублирующих органов управления огнём (симуляция использования командиром дублирующих органов управления и окулярных отводов от прицелов наводчика). При потерявшем сознание наводчике на таких танках сохраняется управление огнём в случае, если командир боеспособен и исправны органы управления огнём. Список предварительно настроенных машин (будет дополняться по мере добавления механики остальным машинам):"
{t="bullets" v=[
  "США: HSTV-L, M1 Abrams, IPM1, M103, M1128, M1A1 Abrams, M1A2 Abrams, M247, M3 Bradley, M3A3 Bradley, M41A1, M47, M48A1, M551, M60, M60A1 (AOS), M60A1 RISE (P), M60 AMBT, M60A3 TTS, Magach 3, MBT-70, Merkava Mk.1, Merkava Mk.2B, Merkava Mk.3D, T54E1, T92, T95E1, XM8, XM-803, XM-1 (Chrysler), XM-1 (GM)."
  "Германия: Begleitpanzer 57, Gepard, KPz-70, Leopard 1A5, Leopard 2A4, Leopard 2A5, Leopard 2A6, Leopard 2K, Leopard 2 PL, Leopard A1A1 (L/44), C2A1, Leopard I, Leopard A1A1, Marder A1-, mKPz M47 G, M48A2 C, M48A2 G A2, M48 Super, Radkampfwagen 90, JaPz.K A2, Class 3 (P), TAM, TAM 2C, TAM 2IP."
  "СССР: БМП-2, БМП-2М, БМП-3, Т-72АВ (TURMS-T), Т-72Б3, Т-80У, Т-80БВМ, Т-90А."
  "Британия: Challenger Mk.2, Challenger 2 (2F), Challenger 2, Challenger Mk.3, Chieftain Marksman, Chieftain Mk.10, Chieftain Mk.3, Chieftain Mk.5, Conqueror, Falcon, Warrior, Rooikat 105, Rooikat Mk.1D, Rooikat MTTD, ZA-35, TTD, VFM5, Vickers Mk.7."
  "Япония: M41A1, STB-1, Type 16, Type 74, Type 74 F, Type 74G, Type 89, Type 90, Type 90 (B)."
  "Китай: CM11, M48A1, M60A3 TTS, PGZ09, ZTZ96A, ZTZ99."
  "Италия: Centauro, Centauro ROMOR, Ariete, Ariete (P), Ariete PSO, Centauro MGS, Leopard 1A5, M47 (105/55), M60A1 'D.C.Ariete', OF-40, OF-40 Mk.2A, OF-40 (MTCA), OTOMATIC."
  "Франция: AMX-10RC, AMX-30, AMX-30 (1972), AMX-30 ACRA, AMX-30B2, AMX-30B2 BRENUS, AMX-30 DCA, AMX-30 Super, AMX-32, AMX-40, Leclerc, Leclerc S2, SK-105A2."
  "Швеция: CV 90105 TML, CV 90120, Strv 121, Strv 122A, Strv 122B PLSS, Strf 9040C, Strf 9040 BILL, Lvkv 9040C."
]}
{t="h2" v="Графика"}
{t="bullets" v=[
  "Доработан рендер тепловизионного изображения при использовании «зелёного» или «красного» цвета тепловизора, изображение стало более реалистично."
  "Обновлён эффект ядерного взрыва. При настройках графики «Максимум» и «Кино» теперь можно наблюдать ударную волну с реалистичным разрушением зданий и элементов окружения на локациях. Для остальных пресетов графики детализация ударной волны снижена."
  "Добавлены новые эффекты попаданий для 206мм - 480мм снарядов."
  "Добавлены новые эффекты взрывов артиллерии в танковых боях."
  "Добавлены новые эффект при попадании по красному кирпичу."
  "Для улучшения видимости, в корабельном прицеле скрыт визуальный эффект выстрела."
  "FV4005 —  заменен визуальный эффект выстрела."
  "Добавлен новый тип эффектов стрельбы 40мм зенитных пушек."
  "Скорректировано время рассеивания дыма, его внешний вид при взрыве авиационных бомб."
  "Переработаны и улучшены эффекты пожаров и дымов на земле."
  "Убрано ошибочное ночное свечение на некоторых эффектах."
  "Устранена проблема низкой частоты кадров при нахождении в хвосте горящего самолета. "
  "Изменены все эффекты дымных следов ракет."
  "Изменены все эффекты пожаров самолетов."
  "Оптимизированы и унифицированы искры для всех эффектов попаданий."
  "Обновлён эффект разрыва снаряда в воздухе."
  "Теперь траектория падения снарядов продолжает подсвечиваться при переключении групп вооружения после выстрела. Для этого надо включить соответствующую опцию в настройках."
  "Улучшена видимость трассеров морских снарядов."
]}
{t="h2" v="Звук"}
{t="bullets" v=[
  "Переработаны звуки стрельбы всех орудий наземной техники противников/союзников (за исключением пулемётов) для видов от третьего лица и от наводчика. Акцент сделан на взрыв порохового заряда, убрана часть звуков металла."
  "Доработаны звуки стрельбы авиации, всем выстрелам добавлена плотность в области низких частот."
  "Для танков производства 80-х годов и позднее созданы новые звуки траков. Всего 4 типа: траки для основных боевых танков, траки для лёгких танков, траки для амфибий, траки для боевых машин пехоты."
  "Для всех танков противников/союзников созданы и добавлены уникальные звуки траков, в соответствии со звуками траков техники игрока."
  "Созданы новые аутентичные звуки траков для танков серии STRV103."
  "Созданы новые звуки для запуска ПТУР системы TOW: звук включения системы навигации ракеты перед стартом, звук отстрела ракеты."
  "Введён новый механизм озвучивания падения наземной техники на подвеску."
  "Система менеджмента звуковых событий взрывов доработана таким образом, чтобы избыток взрывов не вызывал потери некоторых важных звуковых событий — например, таких, как звуки двигателей и траков противников."
  "Звуки взрывов переработаны таким образом, чтобы более явно затухать с расстоянием до слушателя и не создавать локальных перенасыщенных участков, потенциально способных перегрузить игровой микс в области низких частот или подавлять общий уровень звука."
  "Система глобальной реверберации переработана  таким образом, чтобы улучшить позиционирование звуковых событий и сделать звуковой микс игры чище."
  "Внутренняя маршрутизация звуковых каналов игры переработана для более корректного воспроизведения звука на многоканальных акустических системах."
  "Исправлен эффект перегрузки звука игры на консолях во время интенсивного боя и выстрелов главных калибров кораблей."
  "Исправлен пропадающий на консолях звук стрельбы скорострельных ЗСУ."
  "Создано звуковое оформление нескольких областей  карты «Северск 13», чтобы подчеркнуть атмосферу и настроение локации."
]}
{t="h2" v="Изменения и исправления для устройств VR"}
"VR — поддержка шлемов виртуальной реальности была переработана и теперь использует OpenXR:"
{t="bullets" v=[
  "Улучшено восприятие глубины."
  "Чёткость картинки была увеличена на тех же настройках Supersampling по сравнению с предыдущей реализацией. Это также позволяет добиться аналогичного качества на более низких настройках SS."
  "Общее качество картинки было улучшено."
  "TAA теперь работает и в шлемах VR (несмотря на то, что настройка и ранее присутствовала в интерфейсе, в VR она не работала)."
  "DLSS теперь корректно поддерживается в VR."
  "Добавлены режимы окна-«зеркала» для режима VR на основном мониторе игрока: оба глаза (аналогичен единственному режиму, доступному ранее), для левого и правого глаза."
  "Ось приближения теперь работает во всех камерах, а не только при виде из кокпита."
  "Улучшено качество Oculus ASW."
  "Размеры интерфейса пользователя в VR были изменены и теперь дальние от центра элементы требуют меньшего поворота головы."
  "Исправлены артефакты вокруг близких объектов в камерах от третьего лица."
  "Исправлено некорректное освещение (затенение) фюзеляжа при виде из кабины."
  "Исправлена ошибка, из-за которой в режиме VR нельзя было пройти миссию, обучающую управлению самолётом."
]}
]